{
  "metadata": {
    "title": "Spinoza's Ethics Citation Network",
    "description": "Network of references within Spinoza's Ethics",
    "version": "1.0"
  },
  "vertices": [
    {
      "type": "DEFINITION",
      "normalized_key": "I_Def_1",
      "number": "I",
      "texts": {
        "french_text": "J’entends par cause de soi ce dont l’essence enveloppe l’existence ; autrement dit, ce dont la nature ne peut être conçue sinon comme existante.",
        "english_text": "By that which is self-caused, I mean that of which the essence involves existence, or that of which the nature is only conceivable as existent.",
        "latin_text": "Per causam sui intelligo id cujus essentia involvit existentiam sive id cujus natura non potest concipi nisi existens."
      }
    },
    {
      "type": "DEFINITION",
      "normalized_key": "I_Def_2",
      "number": "II",
      "texts": {
        "french_text": "Cette chose est dite finie en son genre, qui peut être limitée par une autre de même nature. Par exemple un corps est dit fini, parce que nous en concevons toujours un autre plus grand. De même une pensée est limitée par une autre pensée. Mais un corps n’est pas limité par une pensée, ni une pensée par un corps.",
        "english_text": "A thing is called finite after its kind, when it can be limited by another thing of the same nature; for instance, a body is called finite because we always conceive another greater body. So, also, a thought is limited by another thought, but a body is not limited by thought, nor a thought by body.",
        "latin_text": "Ea res dicitur in suo genere finita quæ alia ejusdem naturæ terminari potest. Exempli gratia corpus dicitur finitum quia aliud semper majus concipimus. Sic cogitatio alia cogitatione terminatur. At corpus non terminatur cogitatione nec cogitatio corpore."
      }
    },
    {
      "type": "DEFINITION",
      "normalized_key": "I_Def_3",
      "number": "III",
      "texts": {
        "french_text": "J’entends par substance ce qui est en soi et est conçu par soi : c’est-à-dire ce dont le concept n’a pas besoin du concept d’une autre chose, duquel il doive être formé.",
        "english_text": "By substance, I mean that which is in itself, and is conceived through itself: in other words, that of which a conception can be formed independently of any other conception.",
        "latin_text": "Per substantiam intelligo id quod in se est et per se concipitur hoc est id cujus conceptus non indiget conceptu alterius rei a quo formari debeat."
      }
    },
    {
      "type": "DEFINITION",
      "normalized_key": "I_Def_4",
      "number": "IV",
      "texts": {
        "french_text": "J’entends par attribut ce que l’entendement perçoit d’une substance comme constituant son essence.",
        "english_text": "By attribute, I mean that which the intellect perceives as constituting the essence of substance.",
        "latin_text": "Per attributum intelligo id quod intellectus de substantia percipit tanquam ejusdem essentiam constituens."
      }
    },
    {
      "type": "DEFINITION",
      "normalized_key": "I_Def_5",
      "number": "V",
      "texts": {
        "french_text": "J’entends par mode les affections d’une substance, autrement dit ce qui est dans une autre chose, par le moyen de laquelle il est aussi conçu.",
        "english_text": "By mode, I mean the modifications[1] of substance, or that which exists in, and is conceived through, something other than itself.",
        "latin_text": "Per modum intelligo substantiæ affectiones sive id quod in alio est, per quod etiam concipitur."
      }
    },
    {
      "type": "DEFINITION",
      "normalized_key": "I_Def_6",
      "number": "VI",
      "texts": {
        "french_text": "J’entends par Dieu un être absolument infini, c’est-à-dire une substance constituée par une infinité d’attributs dont chacun exprime une essence éternelle et infinie.",
        "english_text": "By God, I mean a being absolutely infinite—that is, a substance consisting in infinite attributes, of which each expresses eternal and infinite essentiality.\n\nExplanation. —I say absolutely infinite, not infinite after its kind : for, of a thing infinite only after its kind, infinite attributes may be denied ; but that which is absolutely infinite, contains in its essence whatever expresses reality, and involves no negation.",
        "latin_text": "Per Deum intelligo ens absolute infinitum hoc est substantiam constantem infinitis attributis quorum unumquodque æternam et infinitam essentiam exprimit.\n\nEXPLICATIO : Dico absolute infinitum, non autem in suo genere; quicquid enim in suo genere tantum infinitum est, infinita de eo attributa negare possumus; quod autem absolute infinitum est, ad ejus essentiam pertinet quicquid essentiam exprimit et negationem nullam involvit."
      },
      "components": [
        {
          "type": "EXPLICATION",
          "texts": {
            "french_text": "Je dis absolument infini et non infini en son genre ; car de ce qui est infini seulement dans son genre, nous pouvons nier une infinité d’attributs ; pour ce qui au contraire est absolument infini, tout ce qui exprime une essence et n’enveloppe aucune négation appartient à son essence."
          }
        }
      ]
    },
    {
      "type": "DEFINITION",
      "normalized_key": "I_Def_7",
      "number": "VII",
      "texts": {
        "french_text": "Cette chose sera dite libre qui existe par la seule nécessité de sa nature et est déterminée par soi seule à agir : cette chose sera dite nécessaire ou plutôt contrainte qui est déterminée par une autre à exister et à produire quelque effet dans une condition certaine et déterminée.",
        "english_text": "That thing is called free, which exists solely by the necessity of its own nature, and of which the action is determined by itself alone. On the other hand, that thing is necessary, or rather constrained, which is determined by something external to itself to a fixed and definite method of existence or action.",
        "latin_text": "Ea res libera dicitur quæ ex sola suæ naturæ necessitate existit et a se sola ad agendum determinatur. Necessaria autem vel potius coacta quæ ab alio determinatur ad existendum et operandum certa ac determinata ratione."
      }
    },
    {
      "type": "DEFINITION",
      "normalized_key": "I_Def_8",
      "number": "VIII",
      "texts": {
        "french_text": "J’entends par éternité l’existence elle-même en tant qu’elle est conçue comme suivant nécessairement de la seule définition d’une chose éternelle.",
        "english_text": "By eternity, I mean existence itself, in so far as it is conceived necessarily to follow solely from the definition of that which is eternal.\n\nExplanation—Existence of this kind is conceived as an eternal truth, like the essence of a thing, and, therefore, cannot be explained by means of continuance or time, though continuance may be conceived without a beginning or end.",
        "latin_text": "Per æternitatem intelligo ipsam existentiam quatenus ex sola rei æternæ definitione necessario sequi concipitur.\n\nEXPLICATIO : Talis enim existentia ut æterna veritas sicut rei essentia concipitur proptereaque per durationem aut tempus explicari non potest tametsi duratio principio et fine carere concipiatur."
      },
      "components": [
        {
          "type": "EXPLICATION",
          "texts": {
            "french_text": "Une telle existence, en effet, est conçue comme une vérité éternelle, de même que l’essence de la chose, et, pour cette raison, ne peut être expliquée par la durée ou le temps, alors même que la durée est conçue comme n’ayant ni commencement ni fin."
          }
        }
      ]
    },
    {
      "type": "AXIOME",
      "normalized_key": "I_Ax_1",
      "number": "I",
      "texts": {
        "french_text": "Tout ce qui est, est ou bien en soi, ou bien en autre chose.",
        "english_text": "Everything which exists, exists either in itself or in something else.",
        "latin_text": "Omnia quæ sunt vel in se vel in alio sunt."
      }
    },
    {
      "type": "AXIOME",
      "normalized_key": "I_Ax_2",
      "number": "II",
      "texts": {
        "french_text": "Ce qui ne peut être conçu par le moyen d’une autre chose, doit être conçu par soi.",
        "english_text": "That which cannot be conceived through anything else must be conceived through itself.",
        "latin_text": "Id quod per aliud non potest concipi, per se concipi debet."
      }
    },
    {
      "type": "AXIOME",
      "normalized_key": "I_Ax_3",
      "number": "III",
      "texts": {
        "french_text": "D’une cause déterminée que l’on suppose donnée, suit nécessairement un effet, et au contraire si nulle cause déterminée n’est donnée, il est impossible qu’un effet suive.",
        "english_text": "From a given definite cause an effect necessarily follows ; and, on the other hand, if no definite cause be granted, it is impossible that an effect can follow.",
        "latin_text": "Ex data causa determinata necessario sequitur effectus et contra si nulla detur determinata causa, impossibile est ut effectus sequatur."
      }
    },
    {
      "type": "AXIOME",
      "normalized_key": "I_Ax_4",
      "number": "IV",
      "texts": {
        "french_text": "La connaissance de l’effet dépend de la connaissance de la cause et l’enveloppe.",
        "english_text": "The knowledge of an effect depends on and involves the knowledge of a cause.",
        "latin_text": "Effectus cognitio a cognitione causæ dependet et eandem involvit."
      }
    },
    {
      "type": "AXIOME",
      "normalized_key": "I_Ax_5",
      "number": "V",
      "texts": {
        "french_text": "Les choses qui n’ont rien de commun l’une avec l’autre ne se peuvent non plus connaître l’une par l’autre ; autrement dit, le concept de l’une n’enveloppe pas le concept de l’autre.",
        "english_text": "Things which have nothing in common cannot be understood, the one by means of the other ; the conception of one does not involve the conception of the other.",
        "latin_text": "Quæ nihil commune cum se invicem habent, etiam per se invicem intelligi non possunt sive conceptus unius alterius conceptum non involvit."
      }
    },
    {
      "type": "AXIOME",
      "normalized_key": "I_Ax_6",
      "number": "VI",
      "texts": {
        "french_text": "Une idée vraie doit s’accorder avec l’objet dont elle est l’idée.",
        "english_text": "A true idea must correspond with its ideate or object.",
        "latin_text": "Idea vera debet cum suo ideato convenire."
      }
    },
    {
      "type": "AXIOME",
      "normalized_key": "I_Ax_7",
      "number": "VII",
      "texts": {
        "french_text": "Toute chose qui peut être conçue comme non existante, son essence n’enveloppe pas l’existence.",
        "english_text": "If a thing can be conceived as non-existing, its essence does not involve existence.",
        "latin_text": "Quicquid ut non existens potest concipi, ejus essentia non involvit existentiam."
      }
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_1",
      "number": "I",
      "texts": {
        "french_text": "Une substance est antérieure en nature à ses affections.",
        "english_text": ". Substance is by nature prior to its modifications.",
        "latin_text": ": Substantia prior est natura suis affectionibus."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Cela est évident par les Définitions 3 et 5.",
            "english_text": "—This is clear from Deff. iii. and v.",
            "latin_text": "Patet ex definitione 3 et 5."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_2",
      "number": "II",
      "texts": {
        "french_text": "Deux substances ayant des attributs différents n’ont rien de commun entre elles.",
        "english_text": ". Two substances, whose attributes are different, have nothing in common.",
        "latin_text": ": Duæ substantiæ diversa attributa habentes nihil inter se commune habent."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Cela est évident par la Définition 3. Chacune, en effet, doit exister en elle-même et doit être conçue par elle-même, autrement dit le concept de l’une n’enveloppe pas le concept de l’autre.",
            "english_text": "—Also evident from Def. iii. For each must exist in itself, and be conceived through itself ; in other words, the conception of one does not imply the conception of the other.",
            "latin_text": "Patet etiam ex definitione 3. Unaquæque enim in se debet esse et per se debet concipi sive conceptus unius conceptum alterius non involvit."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_3",
      "number": "III",
      "texts": {
        "french_text": "Si des choses n’ont rien de commun entre elles, l’une d’elles ne peut être cause de l’autre.",
        "english_text": ". Things which have nothing in common cannot be one the cause of the other.",
        "latin_text": ": Quæ res nihil commune inter se habent, earum una alterius causa esse non potest."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Si elles n’ont rien de commun entre elles, elles ne peuvent donc (Axiome 5) se connaître l’une par l’autre, et ainsi (Axiome 4) l’une ne peut être cause de l’autre. C. Q. F. D.",
            "english_text": "—If they have nothing in common, it follows that one cannot be apprehended by means of the other (Ax. v.), and, therefore, one cannot be the cause of the other (Ax. iv.). Q.E.D.",
            "latin_text": "Si nihil commune cum se invicem habent, ergo (per axioma 5) nec per se invicem possunt intelligi adeoque (per axioma 4) una alterius causa esse non potest. Q.E.D."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_4",
      "number": "IV",
      "texts": {
        "french_text": "Deux ou plusieurs choses distinctes se distinguent entre elles ou bien par la diversité des attributs des substances, ou bien par la diversité des affections des substances.",
        "english_text": ". Two or more distinct things are distinguished one from the other, either by the difference of the attributes of the substances, or by the difference of their modifications.",
        "latin_text": ": Duæ aut plures res distinctæ vel inter se distinguuntur ex diversitate attributorum substantiarum vel ex diversitate earundem affectionum."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Tout ce qui est, est en soi ou en autre chose (Axiome 1), c’est-à-dire (Définitions 3 et 5) que rien n’est donné hors de l’entendement, sinon les substances et leurs affections. Rien donc n’est donné hors de l’entendement par quoi plusieurs choses puissent se distinguer, sinon les substances ou, ce qui (Définition 4) revient au même, leurs attributs, et leurs affections. C. Q. F. D.",
            "english_text": "—Everything which exists, exists either in itself or in something else (Ax. i.),—that is (by Deff. iii. and v.), nothing is granted in addition to the understanding, except substance and its modifications. Nothing is, therefore, given besides the understanding, by which several things may be distinguished one from the other, except the substances, or, in other words (see Ax. iv.), their attributes and modifications. Q.E.D.",
            "latin_text": "Omnia quæ sunt vel in se vel in alio sunt (per axioma 1) hoc est (per definitiones 3 et 5) extra intellectum nihil datur præter substantias earumque affectiones. Nihil ergo extra intellectum datur per quod plures res distingui inter se possunt præter substantias sive quod idem est (per definitionem 4) earum attributa earumque affectiones. Q.E.D."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_5",
      "number": "V",
      "texts": {
        "french_text": "Il ne peut y avoir dans la nature deux ou plusieurs substances de même nature ou attribut.",
        "english_text": ". There cannot exist in the universe two or more substances having the same nature or attribute.",
        "latin_text": ": In rerum natura non possunt dari duæ aut plures substantiæ ejusdem naturæ sive attributi."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "S’il existait plusieurs substances distinctes, elles devraient se distinguer entre elles ou par la diversité des attributs ou par la diversité des affections (Proposition précédente). Si elles se distinguent seulement par la diversité des attributs, il est donc accordé qu’il n’y en a qu’une du même attribut. Si maintenant elles se distinguent par la diversité des affections, comme une substance (Proposition 1) est antérieure en nature à ses affections, on ne pourra, mettant ses affections à part et la considérant en elle-même, c’est-à-dire (Définition 3 et Axiome 6) en vérité, la concevoir comme distincte d’une autre, en d’autres termes il ne pourra y avoir plusieurs substances, mais seulement une. C. Q. F. D.",
            "english_text": "—If several distinct substances be granted, they must be distinguished one from the other, either by the difference of their attributes, or by the difference of their modifications (Prop. iv.). If only by the difference of their attributes, it will be granted that there cannot be more than one with an identical attribute. If by the difference of their modifications—as substance is naturally prior to its modifications (Prop. i.),—it follows that setting the modifications aside, and considering substance in itself, that is truly, (Deff. iii. and vi.), there cannot be conceived one substance different from another,—that is (by Prop. iv.), there cannot be granted several substances, but one substance only. Q.E.D.",
            "latin_text": "Si darentur plures distinctæ, deberent inter se distingui vel ex diversitate attributorum vel ex diversitate affectionum (per propositionem præcedentem). Si tantum ex diversitate attributorum, concedetur ergo non dari nisi unam ejusdem attributi. At si ex diversitate affectionum, cum substantia sit prior natura suis affectionibus (per propositionem 1) depositis ergo affectionibus et in se considerata hoc est (per definitionem 3 et axioma 6) vere considerata, non poterit concipi ab alia distingui hoc est (per propositionem præcedentem) non poterunt dari plures sed tantum una. Q.E.D."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_6",
      "number": "VI",
      "texts": {
        "french_text": "Une substance ne peut pas être produite par une autre substance.",
        "english_text": ". One substance cannot be produced by another substance.",
        "latin_text": ": Una substantia non potest produci ab alia substantia."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Il ne peut pas y avoir dans la nature deux substances de même attribut (Proposition précédente), c’est-à-dire (Proposition 2) ayant entre elles quelque chose de commun. Et ainsi (Proposition 3) l’une ne peut pas être cause de l’autre, autrement dit l’une ne peut pas être produite par l’autre. C. Q. F. D.",
            "english_text": "—It is impossible that there should be in the universe two substances with an identical attribute, i.e. which have anything common to them both (Prop. ii.), and, therefore (Prop. iii.), one cannot be the cause of the other, neither can one be produced by the other. Q.E.D."
          }
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit de là qu’une substance ne peut pas être produite par autre chose. Car rien n’est donné dans la Nature sinon les substances et leurs affections, comme il est évident par l’Axiome 1 et les Définitions 3 et 5. Or une substance ne peut être produite par une autre substance (Proposition précédente). Donc, absolument parlant, une substance ne peut pas être produite par autre chose. C. Q. F. D.",
            "english_text": "—Hence it follows that a substance cannot be produced by anything external to itself. For in the universe nothing is granted, save substances and their modifications (as appears from Ax. i. and Deff. iii. and v.). Now (by the last Prop.) substance cannot be produced by another substance, therefore it cannot be produced by anything external to itself. Q.E.D. This is shown still more readily by the absurdity of the contradictory. For, if substance be produced by an external cause, the knowledge of it would depend on the knowledge of its cause (Ax. iv.), and (by Def. iii.) it would itself not be substance.",
            "latin_text": "Hinc sequitur substantiam ab alio produci non posse. Nam in rerum natura nihil datur præter substantias earumque affectiones ut patet ex axiomate 1 et definitionibus 3 et 5. Atqui a substantia produci non potest (per præcedentem propositionem). Ergo substantia absolute ab alio produci non potest. Q.E.D."
          }
        },
        {
          "type": "AUTRE DEMONSTRATION",
          "texts": {
            "french_text": "Cette proposition se démontre encore plus facilement par l’absurdité de la contradictoire. Si en effet une substance pouvait être produite par autre chose, sa connaissance devrait dépendre de la connaissance de sa cause (Axiome 4) ; et ainsi (Définition 3) elle ne serait pas une substance."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_7",
      "number": "VII",
      "texts": {
        "french_text": "Il appartient à la nature d’une substance d’exister.",
        "english_text": ". In fact, this proposition would be a universal axiom, and accounted a truism. For, by substance, would be understood that which is in itself, and is conceived through itself—that is, something of which the conception requires not the conception of anything else ; whereas modifications exist in something external to themselves, and a conception of them is formed by means of a conception of the thing in which they exist. Therefore, we may have true ideas of non-existent modifications ; for, although they may have no actual existence apart from the conceiving intellect, yet their essence is so involved in something external to themselves that they may through it be conceived. Whereas the only truth substances can have, external to the intellect, must consist in their existence, because they are conceived through themselves. Therefore, for a person to say that he has a clear and distinct—that is, a true—idea of a substance, but that he is not sure whether such substance exists, would be the same as if he said that he had a true idea, but was not sure whether or no it was false (a little consideration will make this plain) ; or if anyone affirmed that substance is created, it would be the same as saying that a false idea was true—in short, the height of absurdity. It must, then, necessarily be admitted that the existence of substance as its essence is an eternal truth. And we can hence conclude by another process of reasoning—that there is but one such substance. I think that this may profitably be done at once ; and, in order to proceed regularly with the demonstration, we must premise :—\n\n1. The true definition of a thing neither involves nor expresses anything beyond the nature of the thing defined. From this it follows that—\n\n2. No definition implies or expresses a certain number of individuals, inasmuch as it expresses nothing beyond the nature of the thing defined. For instance, the definition of a triangle expresses nothing beyond the actual nature of a triangle : it does not imply any fixed number of triangles.\n\n3. There is necessarily for each individual existent thing a cause why it should exist.\n\n4. This cause of existence must either be contained in the nature and definition of the thing defined, or must be postulated apart from such definition.\n\nIt therefore follows that, if a given number of individual things exist in nature, there must be some cause for the existence of exactly that number, neither more nor less. For example, if twenty men exist in the universe (for simplicity's sake, I will suppose them existing simultaneously, and to have had no predecessors), and we want to account for the existence of these twenty men, it will not be enough to show the cause of human existence in general ; we must also show why there are exactly twenty men, neither more nor less : for a cause must be assigned for the existence of each individual. Now this cause cannot be contained in the actual nature of man, for the true definition of man does not involve any consideration of the number twenty. Consequently, the cause for the existence of these twenty men, and, consequently, of each of them, must necessarily be sought externally to each individual. Hence we may lay down the absolute rule, that everything which may consist of several individuals must have an external cause. And, as it has been shown already that existence appertains to the nature of substance, existence must necessarily be included in its definition ; and from its definition alone existence must be deducible. But from its definition (as we have shown, notes ii., iii.), we cannot infer the existence of several substances ; therefore it follows that there is only one substance of the same nature. Q.E.D.",
        "latin_text": ": Ad naturam substantiæ pertinet existere."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Une substance ne peut pas être produite par autre chose (Corollaire de la Proposition précédente), elle sera donc cause de soi, c’est-à-dire (Définition 1) que son essence enveloppe nécessairement l’existence, autrement dit qu’il appartient à sa nature d’exister. C. Q. F. D.",
            "latin_text": "Substantia non potest produci ab alio (per corollarium propositionis præcedentis); erit itaque causa sui id est (per definitionem 1) ipsius essentia involvit necessario existentiam sive ad ejus naturam pertinet existere. Q.E.D."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_8",
      "number": "VIII",
      "texts": {
        "french_text": "Toute substance est nécessairement infinie.",
        "english_text": ". Every substance is necessarily infinite.",
        "latin_text": ": Omnis substantia est necessario infinita."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Une substance ayant un certain attribut ne peut être qu’unique (Proposition 5), et il appartient à sa nature d’exister (Proposition 7). Il sera donc de sa nature qu’elle existe soit comme chose finie, soit comme chose infinie. Mais ce ne peut être comme chose finie ; car (Définition 2) elle devrait être limitée par une autre de même nature qui, elle aussi (Proposition 7), devrait nécessairement exister ; il y aurait donc deux substances de même attribut, ce qui (Proposition 5) est absurde. Elle existe donc comme chose infinie. C. Q. F. D.",
            "english_text": "—There can only be one substance with an identical attribute, and existence follows from its nature (Prop. vii.) ; its nature, therefore, involves existence, either as finite or infinite. It does not exist as finite, for (by Def. ii.) it would then be limited by something else of the same kind, which would also necessarily exist (Prop. vii.) ; and there would be two substances with an identical attribute, which is absurd (Prop. v.). It therefore exists as infinite. Q.E.D.",
            "latin_text": "Substantia unius attributi non nisi unica existit (per propositionem 5) et ad ipsius naturam pertinet existere (per propositionem 7). Erit ergo de ipsius natura vel finita vel infinita existere. At non finita. Nam (per definitionem 2) deberet terminari ab alia ejusdem naturæ quæ etiam necessario deberet existere (per propositionem 7) adeoque darentur duæ substantiæ ejusdem attributi, quod est absurdum (per propositionem 5). Existit ergo infinita. Q.E.D."
          }
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "Comme « être fini » est, en réalité, une négation partielle, et « être infini », l’affirmation absolue de l’existence d’une nature quelconque, il suit donc de la seule Proposition 7 que toute substance doit être infinie.",
            "english_text": "—As finite existence involves a partial negation, and infinite existence is the absolute affirmation of the given nature, it follows (solely from Prop. vii.) that every substance is necessarily infinite.",
            "latin_text": ": Cum finitum esse revera sit ex parte negatio et infinitum absoluta affirmatio existentiæ alicujus naturæ, sequitur ergo ex sola 7 propositione omnem substantiam debere esse infinitam."
          },
          "number": "I"
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "Je ne doute pas qu’à tous ceux qui jugent des choses confusément et n’ont pas accoutumé de les connaître par leurs premières causes, il ne soit difficile de concevoir la Démonstration de la Proposition 7 ; ils ne distinguent pas en effet entre les modifications des substances et les substances elles-mêmes et ne savent pas comment les choses sont produites. D’où vient qu’ils forgent pour les substances l’origine qu’ils voient qu’ont les choses de la nature. Ceux qui en effet ignorent les vraies causes des choses, confondent tout et, sans aucune protestation de leur esprit, forgent aussi bien des arbres que des hommes parlants, imaginent des hommes naissant de pierres aussi bien que de liqueur séminale et des formes quelconques se changeant en d’autres également quelconques. De même aussi ceux qui confondent la nature divine avec l’humaine attribuent, facilement à Dieu les affections de l’âme humaine, surtout pendant le temps qu’ils ignorent encore comment se produisent ces affections. Si, au contraire, les hommes étaient attentifs à la nature de la substance, ils ne douteraient aucunement de la vérité de la Proposition 7 ; bien mieux, cette Proposition serait pour tous un axiome et on la rangerait au nombre des notions communes. Car on entendrait par substance ce qui est en soi et est conçu par soi, c’est-à-dire ce dont la connaissance n’a pas besoin de la connaissance d’une autre chose ; par modifications, ce qui est en autre chose, le concept des modifications se formant du concept de la chose en quoi elles sont. C’est pourquoi nous pouvons avoir des idées vraies de modifications non existantes ; bien qu’elles n’existent pas en acte hors de l’entendement, leur essence en effet n’en est pas moins comprise en une autre chose par laquelle on peut la concevoir, tandis que la vérité des substances en dehors de l’entendement ne réside qu’en elles-mêmes, parce qu’elles se conçoivent par elles-mêmes. Si donc l’on disait qu’on a d’une substance une idée claire et distincte, c’est-à-dire vraie, et qu’on doute néanmoins si cette substance existe, en vérité tant vaudrait dire qu’on a une idée vraie et qu’on doute si elle est fausse (ainsi qu’il devient manifeste avec un peu d’attention) ; ou encore qui admettrait la création d’une substance, admettrait du même coup qu’une idée fausse est devenue vraie, et rien de plus absurde ne peut se concevoir. Il faut donc nécessairement reconnaître que l’existence d’une substance, tout de même que son essence, est une vérité éternelle. Et de là nous pouvons conclure d’une nouvelle manière qu’il ne peut y avoir qu’une substance unique d’une certaine nature, ce que j’ai cru qui valait la peine d’être montré ici, Mais pour le faire avec ordre il faut observer : 1o que la vraie définition de chaque chose n’enveloppe et n’exprime rien sinon la nature de la chose définie. D’où suit : 2o que nulle définition n’enveloppe et n’exprime jamais aucun nombre déterminé d’individus, puisqu’elle n’exprime rien, sinon la nature de la chose définie. Par exemple, la définition du triangle n’exprime rien de plus que la seule nature du triangle, non du tout un nombre déterminé de triangles ; 3o il faut noter que pour chaque chose existante il y a nécessairement une certaine cause en vertu de laquelle elle existe ; 4o il faut enfin noter que cette cause en vertu de laquelle une chose existe doit ou bien être contenue dans la nature même et la définition de la chose existante (alors en effet il appartient à sa nature d’exister) ou bien être donnée en dehors d’elle. Cela posé, il suit que, si dans la nature il existe un certain nombre d’individus, il doit y avoir nécessairement une cause en vertu de laquelle ces individus et non un moindre ou un plus grand nombre existent. Si, par exemple, il existe dans la nature vingt hommes (je suppose pour plus de clarté qu’ils existent tous en même temps et n’ont pas été précédés par d’autres), il ne suffira pas (pour rendre compte de l’existence de ces vingt hommes) que nous fassions connaître la cause de la nature humaine en général ; il faudra, en outre, que nous fassions connaître la cause pour laquelle il n’en existe ni plus ni moins de vingt, puisque (en vertu de la 3e observation) il doit y avoir nécessairement une cause de l’existence de chacun. Mais cette cause (suivant les observations 2 et 3) ne peut être contenue dans la nature humaine elle-même, puisque la vraie définition de l’homme n’enveloppe pas le nombre de vingt ; et ainsi (d’après l’observation 4) la cause pour laquelle ces vingt hommes existent, et conséquemment chacun d’eux en particulier, doit être nécessairement donnée en dehors de chacun ; et, pour cette raison, il faut conclure absolument que pour toute chose telle que plusieurs individus de sa nature puissent exister, il doit y avoir nécessairement une cause extérieure en vertu de laquelle ces individus existent. Dès lors, puisque (comme on l’a déjà montré dans ce Scolie) il appartient à la nature d’une substance d’exister, sa définition doit envelopper l’existence nécessaire et conséquemment son existence doit se conclure de sa seule définition. Mais de sa définition (comme on le voit par les Observations 2 et 3) ne peut suivre l’existence de plusieurs substances ; il en suit donc nécessairement qu’il n’existe qu’une seule substance de même nature, ce qu’on se proposait d’établir.",
            "english_text": "—No doubt it will be difficult for those who think about things loosely, and have not been accustomed to know them by their primary causes, to comprehend the demonstration of",
            "latin_text": ": Non dubito quin omnibus qui de rebus confuse judicant nec res per primas suas causas noscere consueverunt, difficile sit demonstrationem 7 propositionis concipere; nimirum quia non distinguunt inter modificationes substantiarum et ipsas substantias neque sciunt quomodo res producuntur. Unde fit ut principium quod res naturales habere vident, substantiis affingant; qui enim veras rerum causas ignorant, omnia confundunt et sine ulla mentis repugnantia tam arbores quam homines loquentes fingunt et homines tam ex lapidibus quam ex semine formari et quascunque formas in alias quascunque mutari imaginantur. Sic etiam qui naturam divinam cum humana confundunt, facile Deo affectus humanos tribuunt præsertim quamdiu etiam ignorant quomodo affectus in mente producuntur. Si autem homines ad naturam substantiæ attenderent, minime de veritate 7 propositionis dubitarent; imo hæc propositio omnibus axioma esset et inter notiones communes numeraretur. Nam per substantiam intelligerent id quod in se est et per se concipitur hoc est id cujus cognitio non indiget cognitione alterius rei. Per modificationes autem id quod in alio est et quarum conceptus a conceptu rei in qua sunt, formatur : quocirca modificationum non existentium veras ideas possumus habere quandoquidem quamvis non existant actu extra intellectum, earum tamen essentia ita in alio comprehenditur ut per idem concipi possint. Verum substantiarum veritas extra intellectum non est nisi in se ipsis quia per se concipiuntur. Si quis ergo diceret se claram et distinctam hoc est veram ideam substantiæ habere et nihilominus dubitare num talis substantia existat, idem hercle esset ac si diceret se veram habere ideam et nihilominus dubitare num falsa sit (ut satis attendenti sit manifestum); vel si quis statuat substantiam creari, simul statuit ideam falsam factam esse veram, quo sane nihil absurdius concipi potest adeoque fatendum necessario est substantiæ existentiam sicut ejus essentiam æternam esse veritatem. Atque hinc alio modo concludere possumus non dari nisi unicam ejusdem naturæ, quod hic ostendere operæ pretium esse duxi. Ut autem hoc ordine faciam notandum est I° veram uniuscujusque rei definitionem nihil involvere neque exprimere præter rei definitæ naturam. Ex quo sequitur hoc II° nempe nullam definitionem certum aliquem numerum individuorum involvere neque exprimere quandoquidem nihil aliud exprimit quam naturam rei definitæ. Exempli gratia definitio trianguli nihil aliud exprimit quam simplicem naturam trianguli; at non certum aliquem triangulorum numerum. III° notandum dari necessario uniuscujusque rei existentis certam aliquam causam propter quam existit. IV° denique notandum hanc causam propter quam aliqua res existit, vel debere contineri in ipsa natura et definitione rei existentis (nimirum quod ad ipsius naturam pertinet existere) vel debere extra ipsam dari. His positis sequitur quod si in natura certus aliquis numerus individuorum existat, debeat necessario dari causa cur illa individua et cur non plura nec pauciora existunt. Si exempli gratia in rerum natura 20 homines existant (quos majoris perspicuitatis causa suppono simul existere nec alios antea in natura exstitisse) non satis erit (ut scilicet rationem reddamus cur 20 homines existant) causam naturæ humanæ in genere ostendere sed insuper necesse erit causam ostendere cur non plures nec pauciores quam 20 existant quandoquidem (per III notam) uniuscujusque debet necessario dari causa cur existat. At hæc causa (per notam II et III) non potest in ipsa natura humana contineri quandoquidem vera hominis definitio numerum vicenarium non involvit adeoque (per notam IV) causa cur hi viginti homines existunt et consequenter cur unusquisque existit, debet necessario extra unumquemque dari et propterea absolute concludendum omne id cujus naturæ plura individua existere possunt, debere necessario ut existant causam externam habere. Jam quoniam ad naturam substantiæ (per jam ostensa in hoc scholio) pertinet existere, debet ejus definitio necessariam existentiam involvere et consequenter ex sola ejus definitione debet ipsius existentia concludi. At ex ipsius definitione (ut jam ex nota II et III ostendimus) non potest sequi plurium substantiarum existentia; sequitur ergo ex ea necessario unicam tantum ejusdem naturæ existere, ut proponebatur."
          },
          "number": "II"
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_9",
      "number": "IX",
      "texts": {
        "french_text": "À proportion de la réalité ou de l’être que possède chaque chose, un plus grand nombre d’attributs lui appartiennent.",
        "english_text": ". The more reality or being a thing has, the greater the number of its attributes (Def. iv.).",
        "latin_text": ": Quo plus realitatis aut esse unaquæque res habet eo plura attributa ipsi competunt."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Cela est évident par la Définition 4.",
            "latin_text": "Patet ex definitione 4."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_10",
      "number": "X",
      "texts": {
        "french_text": "Chacun des attributs d’une même substance doit être conçu par soi.",
        "english_text": ". Each particular attribute of the one substance must be conceived through itself.",
        "latin_text": ": Unumquodque unius substantiæ attributum per se concipi debet."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Un attribut est en effet ce que l’entendement perçoit d’une substance comme constituant son essence (Définition 4) ; et par suite (Définition 3) il doit être conçu par soi. C. Q. F. D.",
            "english_text": "—An attribute is that which the intellect perceives of substance, as constituting its essence (Def. iv.), and, therefore, must be conceived through itself (Def. iii.). Q.E.D.",
            "latin_text": "Attributum enim est id quod intellectus de substantia percipit tanquam ejus essentiam constituens (per definitionem 4) adeoque (per definitionem 3) per se concipi debet. Q.E.D."
          }
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "Par là il apparaît qu’encore bien que deux attributs soient conçus comme réellement distincts, c’est-à-dire l’un sans le secours de l’autre, nous ne pouvons en conclure cependant qu’ils constituent deux êtres, c’est-à-dire deux substances différentes, car il est de la nature d’une substance que chacun de ses attributs soit conçu par soi ; puisque tous les attributs qu’elle possède ont toujours été à la fois en elle et que l’un ne peut être produit par l’autre, mais que chacun exprime la réalité ou l’être de la substance. Il s’en faut donc de beaucoup qu’il y ait absurdité à rapporter plusieurs attributs à une même substance ; il n’est rien, au contraire, dans la nature de plus clair que ceci : chaque être doit être conçu sous un certain attribut et, à proportion de la réalité ou de l’être qu’il possède, il a un plus grand nombre d’attributs qui expriment et une nécessité, autrement dit une éternité, et une infinité ; et conséquemment aussi que ceci : un être absolument infini doit être nécessairement défini (comme il est dit dans Définition 6) un être qui est constitué par une infinité d’attributs dont chacun exprime une certaine essence éternelle et infinie. Si l’on demande maintenant à quel signe nous pourrons donc reconnaître la diversité des substances, qu’on lise les Propositions suivantes : elles montrent qu’il n’existe dans la nature qu’une substance unique et qu’elle est absolument infinie, ce qui fait qu’on chercherait vainement un tel signe.",
            "english_text": "—It is thus evident that, though two attributes are, in fact, conceived as distinct—that is, one without the help of the other—yet we cannot, therefore, conclude that they constitute two entities, or two different substances. For it is the nature of substance that each of its attributes is conceived through itself, inasmuch as all the attributes it has have always existed simultaneously in it, and none could be produced by any other ; but each expresses the reality or being of substance. It is, then, far from an absurdity to ascribe several attributes to one substance : for nothing in nature is more clear than that each and every entity must be conceived under some attribute, and that its reality or being is in proportion to the number of its attributes expressing necessity or eternity and infinity. Consequently it is abundantly clear, that an absolutely infinite being must necessarily be defined as consisting in infinite attributes, each of which expresses a certain eternal and infinite essence.\n\nIf anyone now ask, by what sign shall he be able to distinguish different substances, let him read the following propositions, which show that there is but one substance in the universe, and that it is absolutely infinite, wherefore such a sign would be sought in vain.",
            "latin_text": "Ex his apparet quod quamvis duo attributa realiter distincta concipiantur hoc est unum sine ope alterius, non possumus tamen inde concludere ipsa dua entia sive duas diversas substantias constituere; id enim est de natura substantiæ ut unumquodque ejus attributorum per se concipiatur quandoquidem omnia quæ habet attributa, simul in ipsa semper fuerunt nec unum ab alio produci potuit sed unumquodque realitatem sive esse substantiæ exprimit. Longe ergo abest ut absurdum sit uni substantiæ plura attributa tribuere; quin nihil in natura clarius quam quod unumquodque ens sub aliquo attributo debeat concipi et quo plus realitatis aut esse habeat eo plura attributa quæ et necessitatem sive æternitatem et infinitatem exprimunt, habeat et consequenter nihil etiam clarius quam quod ens absolute infinitum necessario sit definiendum (ut definitione 6 tradidimus) ens quod constat infinitis attributis quorum unumquodque æternam et infinitam certam essentiam exprimit. Si quis autem jam quærit ex quo ergo signo diversitatem substantiarum poterimus dignoscere, legat sequentes propositiones, quæ ostendunt in rerum natura non nisi unicam substantiam existere eamque absolute infinitam esse, quapropter id signum frustra quæreretur."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_11",
      "number": "XI",
      "texts": {
        "french_text": "Dieu, c’est-à-dire une substance constituée par une infinité d’attributs dont chacun exprime une essence éternelle et infinie, existe nécessairement.",
        "english_text": ". God, or substance, consisting of infinite attributes, of which each expresses eternal and infinite essentiality, necessarily exists.",
        "latin_text": ": Deus sive substantia constans infinitis attributis quorum unumquodque æternam et infinitam essentiam exprimit, necessario existit."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Si vous niez cela, concevez, si cela est possible, que Dieu n’existe pas. Son essence (Axiome 7) n’enveloppe donc pas l’existence. Or cela (Proposition 7) est absurde ; donc Dieu existe nécessairement. C. Q. F. D.",
            "english_text": "—If this be denied, conceive, if possible, that God does not exist : then his essence does not involve existence. But this (Prop. vii.) is absurd. Therefore God necessarily exists.",
            "latin_text": "Si negas, concipe si fieri potest, Deum non existere. Ergo (per axioma 7) ejus essentia non involvit existentiam. Atqui hoc (per propositionem 7) est absurdum : ergo Deus necessario existit. Q.E.D."
          }
        },
        {
          "type": "AUTRE DEMONSTRATION",
          "texts": {
            "french_text": "Pour toute chose il doit y avoir une cause, ou raison assignable, pourquoi elle existe ou pourquoi elle n’existe pas. Par exemple, si un triangle existe, il doit y avoir une raison ou cause pourquoi il existe ; s’il n’existe pas, il doit aussi y avoir une raison ou cause qui empêche qu’il n’existe ou ôte son existence. Cette raison ou cause d’ailleurs doit être contenue ou bien dans la nature de la chose ou bien hors d’elle. La raison, par exemple, pour laquelle un cercle carré n’existe pas, sa nature même l’indique, attendu qu’elle enveloppe une contradiction. Pourquoi une substance au contraire existe, cela suit aussi de sa seule nature, laquelle enveloppe l’existence nécessaire (Proposition 7). Il en est autrement de la raison qui fait qu’un cercle ou un triangle existe, ou qu’il n’existe pas ; elle ne suit pas de leur nature, mais de l’ordre de la nature corporelle tout entière ; car il doit suivre de cet ordre, ou bien que ce triangle existe actuellement par nécessité, ou qu’il est impossible qu’il existe actuellement. Et cela est par soi évident. Il s’ensuit que cette chose existe nécessairement, pour laquelle il n’est donné aucune raison ou cause qui empêche qu’elle n’existe. Si donc aucune raison ou cause ne peut être donnée qui empêche que Dieu n’existe ou ôte son existence, on ne pourra du tout éviter de conclure qu’il existe nécessairement. Mais, pour qu’une telle raison ou cause pût être donnée, elle devrait être contenue ou bien dans la nature même de Dieu, ou en dehors de cette nature, c’est-à-dire dans une autre substance de nature autre. Car si elle était de même nature, il serait accordé par là même qu’un Dieu est donné. Mais une substance qui serait d’une autre nature, ne pourrait rien avoir de commun avec Dieu (Proposition 2) et donc ne pourrait ni poser son existence ni l’ôter. Puis donc que la raison ou cause qui ôterait l’existence divine ne peut être donnée en dehors de la nature de Dieu, elle devra nécessairement, si l’on veut qu’il n’existe pas, être contenue dans sa propre nature, laquelle devrait alors envelopper une contradiction. Or, il est absurde d’affirmer cela d’un Être absolument infini et souverainement parfait ; donc, ni en Dieu ni hors de Dieu il n’est donné aucune raison ou cause qui ôte son existence, et par conséquent Dieu existe nécessairement. C. Q. F. D.",
            "english_text": "—The potentiality of non-existence is a negation of power, and contrariwise the potentiality of existence is a power, as is obvious. If, then, that which necessarily exists is nothing but finite beings, such finite beings are more powerful than a being absolutely infinite, which is obviously absurd ; therefore, either nothing exists, or else a being absolutely infinite necessarily exists also. Now we exist either in ourselves, or in something else which necessarily exists (see Axiom. i. and Prop. vii.). Therefore a being absolutely infinite-in other words, God (Def. vi.)—necessarily exists. Q.E.D.",
            "latin_text": "Posse non existere impotentia est et contra posse existere potentia est (ut per se notum). Si itaque id quod jam necessario existit, non nisi entia finita sunt, sunt ergo entia finita potentiora Ente absolute infinito atque hoc (ut per se notum) absurdum est; ergo vel nihil existit vel Ens absolute infinitum necessario etiam existit. Atqui nos vel in nobis vel in alio quod necessario existit, existimus (vide axioma 1 et propositionem 7). Ergo Ens absolute infinitum hoc est (per definitionem 6) Deus necessario existit. Q.E.D."
          }
        },
        {
          "type": "AUTRE DEMONSTRATION",
          "texts": {
            "french_text": "Pouvoir ne pas exister c’est impuissance, et, au contraire, pouvoir exister c’est puissance (comme il est connu de soi). Si donc ce qui existe à l’instant actuel nécessairement, ce sont seulement des êtres finis, des êtres finis seront plus puissants qu’un Être absolument infini ; or cela (comme il est connu de soi) est absurde ; donc ou bien rien n’existe ou bien un Être absolument infini existe aussi nécessairement. Or nous existons ou bien en nous-mêmes ou bien en une autre chose qui existe nécessairement (voir Axiome 1 et Proposition 7) ; donc un Être absolument infini, c’est-à-dire (par la Définition 6) Dieu existe nécessairement. C. Q. F. D."
          }
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "Dans cette dernière démonstration j’ai voulu faire voir l’existence de Dieu a posteriori, afin que la preuve fût plus aisée à percevoir ; ce n’est pas que l’existence de Dieu ne suive a priori du même principe. Car, si pouvoir exister c’est puissance, il s’ensuit que plus à la nature d’une chose il appartient de réalité, plus elle a par elle-même de forces pour exister ; ainsi un Être absolument infini, autrement dit Dieu, a de lui-même une puissance absolument infinie d’exister et, par suite, il existe absolument. Peut-être cependant beaucoup de lecteurs ne verront-ils pas aisément l’évidence de cette démonstration, parce qu’ils ont accoutumé de considérer seulement les choses qui proviennent de causes extérieures ; et parmi ces choses, celles qui se forment vite, c’est-à-dire existent facilement, ils les voient aussi périr facilement, tandis que celles qu’ils conçoivent comme plus riches en possessions, ils les jugent plus difficiles à faire, c’est-à-dire qu’ils ne croient pas qu’elles existent si facilement. Pour les libérer de ces préjugés cependant, je n’ai pas besoin de montrer ici dans quelle mesure est vrai ce dicton : ce qui se fait vite périt de même ; ni même si, eu égard à la nature totale, toutes choses sont également faciles ou non. Il suffit de noter seulement que je ne parle pas ici de choses qui proviennent de causes extérieures, mais seulement des substances, qui (Prop. 6) ne peuvent être produites par aucune cause extérieure. Car pour les choses qui proviennent de causes extérieures, qu’elles se composent de beaucoup de parties ou d’un petit nombre, tout ce qu’elles ont de perfection ou de réalité est dû à la vertu de la cause extérieure, et ainsi leur existence provient de la seule perfection de cette cause, non de la leur. Au contraire, tout ce qu’une substance a de perfection, cela n’est dû à aucune cause extérieure, c’est pourquoi de sa seule nature doit suivre son existence, qui par là n’est autre chose que son essence. La perfection donc d’une chose n’ôte pas l’existence, mais au contraire la pose ; c’est son imperfection qui l’ôte ; et ainsi nous ne pouvons être plus certains de l’existence d’aucune chose que de l’existence d’un Être absolument infini ou parfait, c’est-à-dire de Dieu. Car, puisque son essence exclut toute imperfection, et enveloppe la perfection absolue, par là même elle ôte toute raison de douter de son existence et en donne une certitude souveraine, comme je crois que le verra toute personne un peu attentive.",
            "english_text": "—In this last proof, I have purposely shown God's existence à posteriori, so that the proof might be more easily followed, not because, from the same premises, God's existence does not follow à priori. For, as the potentiality of existence is a power, it follows that, in proportion as reality increases in the nature of a thing, so also will it increase its strength for existence. Therefore a being absolutely infinite, such as God, has from himself an absolutely infinite power of existence, and hence he does absolutely exist. Perhaps there will be many who will be unable to see the force of this proof, inasmuch as they are accustomed only to consider those things which flow from external causes. Of such things, they see that those which quickly come to pass-that is, quickly come into existence—quickly also disappear ; whereas they regard as more difficult of accomplishment—that is, not so easily brought into existence—those things which they conceive as more complicated.\n\nHowever, to do away with this misconception, I need not here show the measure of truth in the proverb, \"What comes quickly, goes quickly,\" nor discuss whether, from the point of view of universal nature, all things are equally easy, or otherwise : I need only remark that I am not here speaking of things, which come to pass through causes external to themselves, but only of substances which (by Prop. vi.) cannot be produced by any external cause. Things which are produced by external causes, whether they consist of many parts or few, owe whatsoever perfection or reality they possess solely to the efficacy of their external cause ; and therefore their existence arises solely from the perfection of their external cause, not from their own. Contrariwise, whatsoever perfection is possessed by substance is due to no external cause ; wherefore the existence of substance must arise solely from its own nature, which is nothing else but its essence. Thus, the perfection of a thing does not annul its existence, but, on the contrary, asserts it. Imperfection, on the other hand, does annul it ; therefore we cannot be more certain of the existence of anything, than of the existence of a being absolutely infinite or perfect—that is, of God. For inasmuch as his essence excludes all imperfection, and involves absolute perfection, all cause for doubt concerning his existence is done away, and the utmost certainty on the question is given. This, I think, will be evident to every moderately attentive reader."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_12",
      "number": "XII",
      "texts": {
        "french_text": "De nul attribut d’une substance il ne peut être formé un concept vrai d’où il suivrait que cette substance pût être divisée.",
        "english_text": ". No attribute of substance can be conceived from which it would follow that substance can be divided.",
        "latin_text": ": Nullum substantiæ attributum potest vere concipi ex quo sequatur substantiam posse dividi."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Ou bien en effet les parties dans lesquelles la substance ainsi conçue serait divisée retiendront la nature de la substance, ou bien elles ne la retiendront pas. Dans la première hypothèse chaque partie (Proposition 8) devra être infinie et (Proposition 6) cause de soi, et (Proposition 5) être constituée par un attribut différent ; ainsi d’une seule substance plusieurs substances pourront être formées, ce qui (Proposition 6) est absurde. Ajoutez que les parties (Proposition 2) n’auraient rien de commun avec leur tout, et que le tout (Définition 4 et Proposition 10) pourrait être et être conçu sans ses parties, ce que personne ne pourra douter qui ne soit absurde. Soit maintenant la deuxième hypothèse, à savoir que les parties ne retiendront pas la nature de la substance ; dès lors, si la substance entière était divisée en parties égales, elle perdrait sa nature de substance et cesserait d’être, ce qui (Proposition 7) est absurde.",
            "english_text": "—The parts into which substance as thus conceived would be divided either will retain the nature of substance, or they will not. If the former, then (by Prop. viii.) each part will necessarily be infinite, and (by Prop. vi.) self-caused, and (by Prop. v.) will perforce consist of a different attribute, so that, in that case, several substances could be formed out of one substance, which (by Prop. vi.) is absurd. Moreover, the parts (by Prop. ii.) would have nothing in common with their whole, and the whole (by Def. iv. and Prop. x.) could both exist and be conceived without its parts, which everyone will admit to be absurd. If we adopt the second alternative—namely, that the parts will not retain the nature of substance—then, if the whole substance were divided into equal parts, it would lose the nature of substance, and would cease to exist, which (by Prop. vii.) is absurd.",
            "latin_text": "Partes enim in quas substantia sic concepta divideretur, vel naturam substantiæ retinebunt vel non. Si primum, tum (per 8 propositionem) unaquæque pars debebit esse infinita et (per propositionem 6) causa sui et (per propositionem 5) constare debebit ex diverso attributo adeoque ex una substantia plures constitui poterunt, quod (per propositionem 6) est absurdum. Adde quod partes (per propositionem 2) nihil commune cum suo toto haberent et totum (per definitionem 4 et propositionem 10) absque suis partibus et esse et concipi posset, quod absurdum esse nemo dubitare poterit. Si autem secundum ponatur quod scilicet partes naturam substantiæ non retinebunt, ergo cum tota substantia in æquales partes esset divisa, naturam substantiæ amitteret et esse desineret, quod (per propositionem 7) est absurdum."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_13",
      "number": "XIII",
      "texts": {
        "french_text": "Une substance absolument infinie est indivisible.",
        "english_text": ". Substance absolutely infinite is indivisible",
        "latin_text": ": Substantia absolute infinita est indivisibilis."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Si elle était divisible, les parties dans lesquelles elle serait divisée, ou bien retiendraient la nature d’une substance absolument infinie, ou bien ne la retiendraient pas. Dans la première hypothèse il y aurait plusieurs substances de même nature, ce qui (Proposition 5) est absurde. Dans la deuxième une substance absolument infinie pourrait, comme on l’a vu plus haut, cesser d’être, ce qui (Proposition 11) est également absurde.",
            "english_text": "—If it could be divided, the parts into which it was divided would either retain the nature of absolutely infinite substance, or they would not. If the former, we should have several substances of the same nature, which (by Prop. v.) is absurd. If the latter, then (by Prop. vii.) substance absolutely infinite could cease to exist, which (by Prop. xi.) is also absurd.",
            "latin_text": "Si enim divisibilis esset, partes in quas divideretur vel naturam substantiæ absolute infinitæ retinebunt vel non. Si primum, dabuntur ergo plures substantiæ ejusdem naturæ, quod (per propositionem 5) est absurdum. Si secundum ponatur, ergo (ut supra) poterit substantia absolute infinita desinere esse, quod (per propositionem 11) est etiam absurdum."
          }
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit de là que nulle substance et en conséquence nulle substance corporelle, en tant qu’elle est une substance, n’est divisible.",
            "english_text": "—It follows, that no substance, and consequently no extended substance, in so far as it is substance, is divisible.",
            "latin_text": "Ex his sequitur nullam substantiam et consequenter nullam substantiam corpoream, quatenus substantia est, esse divisibilem."
          }
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "Qu’une substance est indivisible, cela se connaît encore plus simplement par cela seul que la nature d’une substance ne peut être conçue autrement que comme infinie, et que, par partie d’une substance, il ne se peut rien entendre sinon une substance finie, ce qui (Proposition 8) implique une contradiction manifeste.",
            "english_text": "—The indivisibility of substance may be more easily understood as follows. The nature of substance can only be conceived as infinite, and by a part of substance, nothing else can be understood than finite substance, which (by Prop. viii) involves a manifest contradiction.",
            "latin_text": "Quod substantia sit indivisibilis, simplicius ex hoc solo intelligitur quod natura substantiæ non potest concipi nisi infinita et quod per partem substantiæ nihil aliud intelligi potest quam substantia finita, quod (per propositionem 8) manifestam contradictionem implicat."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_14",
      "number": "XIV",
      "texts": {
        "french_text": "Nulle substance en dehors de Dieu ne peut être donnée ni conçue.",
        "english_text": ". Besides God no substance can be granted or conceived.",
        "latin_text": ": Præter Deum nulla dari neque concipi potest substantia."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Dieu est un être absolument infini, duquel nul attribut, qui exprime une essence de substance, ne peut être nié (Définition 6), et il existe nécessairement (Proposition 11) ; si donc quelque substance existait en dehors de Dieu, elle devrait être expliquée par quelque attribut de Dieu, et ainsi il existerait deux substances de même attribut, ce qui (Prop. 5) est absurde ; par suite, nulle substance, en dehors de Dieu, ne peut exister et conséquemment aussi être conçue. Car, si elle pouvait être conçue, elle devrait nécessairement être conçue comme existante : or cela (par la première partie de cette Démonstration) est absurde. Donc en dehors de Dieu nulle substance ne peut exister ni être conçue. C. Q. F. D.",
            "english_text": "—As God is a being absolutely infinite, of whom no attribute that expresses the essence of substance can be denied (by Def. vi.), and he necessarily exists (by Prop. xi.) ; if any substance besides God were granted, it would have to be explained by some attribute of God, and thus two substances with the same attribute would exist, which (by Prop. v.) is absurd ; therefore, besides God no substance can be granted, or, consequently, be conceived. If it could be conceived, it would necessarily have to be conceived as existent ; but this (by the first part of this proof) is absurd. Therefore, besides God no substance can be granted or conceived. Q.E.D.\n\nCorollary I.—Clearly, therefore : 1. God is one, that is (by Def. vi.) only one substance can be granted in the universe, and that substance is absolutely infinite, as we have already indicated (in the note to Prop. x.).\n\nCorollary II.—It follows : 2. That extension and thought are either attributes of God or (by Ax. i.) accidents (affectiones) of the attributes of God."
          }
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit de là très clairement : 1o que Dieu est unique, c’est-à-dire (Définition 6) qu’il n’y a dans la nature qu’une seule substance et qu’elle est absolument infinie comme nous l’avons déjà indiqué dans le Scolie de la Proposition 10.",
            "latin_text": ": Hinc clarissime sequitur I° Deum esse unicum hoc est (per definitionem 6) in rerum natura non nisi unam substantiam dari eamque absolute infinitam esse, ut in scholio propositionis 10 jam innuimus."
          },
          "number": "I"
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit : 2o que la chose pensante et la chose étendue sont ou bien des attributs de Dieu ou bien (Axiome 1) des affections des attributs de Dieu.",
            "latin_text": ": Sequitur II° rem extensam et rem cogitantem vel Dei attributa esse vel (per axioma 1) affectiones attributorum Dei."
          },
          "number": "II"
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_15",
      "number": "XV",
      "texts": {
        "french_text": "Tout ce qui est, est en Dieu et rien ne peut sans Dieu être ni être conçu.",
        "english_text": ". and Def. v.",
        "latin_text": ": Quicquid est, in Deo est et nihil sine Deo esse neque concipi potest."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "En dehors de Dieu nulle substance ne peut exister ni être conçue (Proposition 14), c’est-à-dire (Définition 3) nulle chose qui est en soi et conçue par soi. D’autre part, des modes (Définition 5) ne peuvent exister ni être conçus sans une substance ; donc ils ne peuvent exister que dans la seule nature divine et être conçus que par elle. Or rien n’existe en dehors des substances et des modes (Axiome 1). Donc rien ne peut sans Dieu exister ni être conçu. C. Q. F. D.",
            "latin_text": "Præter Deum nulla datur neque concipi potest substantia (per 14 propositionem) hoc est (per definitionem 3) res quæ in se est et per se concipitur. Modi autem (per definitionem 5) sine substantia nec esse nec concipi possunt; quare hi in sola divina natura esse et per ipsam solam concipi possunt. Atqui præter substantias et modos nil datur (per axioma 1). Ergo nihil sine Deo esse neque concipi potest. Q.E.D."
          }
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "Il y en a qui forgent un Dieu composé comme un homme d’un corps et d’une âme et soumis aux passions ; combien ceux-là sont éloignés de la vraie connaissance de Dieu, les démonstrations précédentes suffisent à l’établir. Je laisse ces hommes de côté, car ceux qui ont quelque peu pris en considération la nature divine sont d’accord pour nier que Dieu soit corporel. Et ils tirent très justement la preuve de cette vérité de ce que nous entendons par corps toute quantité longue, large et profonde, limitée par une certaine figure, ce qui est la chose la plus absurde qui se puisse dire de Dieu, être absolument infini. En même temps, toutefois, ils font voir clairement, en essayant de le démontrer par d’autres raisons, qu’ils séparent entièrement la substance corporelle ou étendue de la nature de Dieu, et admettent qu’elle est créée par Dieu. Mais ils ignorent complètement par quelle puissance divine elle a pu être créée, ce qui montre clairement qu’ils ne connaissent pas ce qu’ils disent eux-mêmes. J’ai, du moins, démontré assez clairement, autant que j’en puis juger, (Corollaire de la Proposition 6 et Scolie de la Proposition 8) que nulle substance ne peut être produite ou créée par un autre être. De plus nous avons montré par la Proposition 14 qu’en dehors de Dieu nulle substance ne peut être ni être conçue ; et nous avons conclu de là que la substance étendue est l’un des attributs infinis de Dieu. En vue toutefois d’une explication plus complète, je réfuterai les arguments de ces adversaires qui tous se ramènent à ceci : Primo, que la substance corporelle, en tant que substance, se compose à ce qu’ils pensent, de parties ; et, pour cette raison, ils nient qu’elle puisse être infinie et conséquemment qu’elle puisse appartenir à Dieu. Ils expliquent cela par de nombreux exemples dont je rapporterai quelques-uns. Si la substance corporelle, disent-ils, est infinie, qu’on la conçoive divisée en deux parties : chacune d’elles sera ou finie ou infinie. Dans la première hypothèse l’infini se compose de deux parties finies, ce qui est absurde. Dans la deuxième il y aura donc un infini double d’un autre, ce qui n’est pas moins absurde. De plus, si une quantité infinie est mesurée au moyen de parties ayant la longueur d’un pied, elle devra se composer d’une infinité de ces parties ; de même, si elle est mesurée au moyen de parties ayant la longueur d’un pouce ; et, par conséquent, un nombre infini sera douze fois plus grand qu’un autre nombre infini. Enfin, si l’on conçoit que deux lignes AB, AC partent d’un point d’une quantité infinie et, situées à une certaine distance d’abord déterminée, soient prolongées à l’infini, il est certain que la distance entre B et C augmentera continuellement et de déterminée deviendra enfin indéterminable. Puis donc que ces absurdités sont, à ce qu’ils pensent, la conséquence de ce qu’on suppose une quantité infinie, ils en concluent que la substance corporelle doit être finie et par conséquent n’appartient pas à l’essence de Dieu. Un deuxième argument se tire aussi de la souveraine perfection de Dieu : Dieu, disent-ils, puisqu’il est un être souverainement parfait ne peut pâtir ; or la substance corporelle, puisqu’elle est divisible, peut pâtir ; il suit donc qu’elle n’appartient pas à l’essence de Dieu. Tels sont les arguments trouvés par moi dans les auteurs, par lesquels on essaie de montrer que la substance corporelle est indigne de la nature de Dieu et ne peut lui appartenir. Si cependant l’on veut bien y prendre garde, on reconnaîtra que j’y ai déjà répondu ; puisque ces arguments se fondent seulement sur ce que l’on suppose la substance corporelle composée de parties, ce que j’ai déjà fait voir (Proposition 12 avec le Corollaire de la Proposition 13) qui est absurde. Ensuite, si l’on veut examiner la question, on verra que toutes ces conséquences absurdes (à supposer qu’elles le soient toutes, point que je laisse en dehors de la présente discussion), desquelles ils veulent conclure qu’une substance étendue est finie, ne découlent pas le moins du monde de ce qu’on suppose une quantité infinie, mais de ce qu’on suppose cette quantité infinie mesurable et composée de parties finies ; on ne peut donc rien conclure de ces absurdités, sinon qu’une quantité infinie n’est pas mesurable et ne peut se composer de parties finies. Et c’est cela même que nous avons déjà démontré plus haut (Proposition 12, etc.). Le trait qu’ils nous destinent est donc jeté en réalité contre eux-mêmes. S’ils veulent d’ailleurs conclure de l’absurdité de leur propre supposition qu’une substance étendue doit être finie, en vérité ils font tout comme quelqu’un qui, pour avoir forgé un cercle ayant les propriétés du carré, en conclurait qu’un cercle n’a pas un centre d’où toutes les lignes tracées jusqu’à la circonférence sont égales. Car la substance corporelle, qui ne peut être conçue autrement qu’infinie unique et indivisible (Prop. 8, 5 et 12), ils la conçoivent multiple et divisible, pour pouvoir en conclure qu’elle est finie. C’est ainsi que d’autres, après s’être imaginé qu’une ligne est composée de points, savent trouver de nombreux arguments pour montrer qu’une ligne ne peut être divisée à l’infini. Et en effet il n’est pas moins absurde de supposer que la substance corporelle est composée de corps ou de parties, que de supposer le corps formé de surfaces, la surface de lignes, la ligne, enfin, de points. Et cela, tous ceux qui savent qu’une raison claire est infaillible, doivent le reconnaître, et en premier lieu ceux qui nient qu’un vide soit donné. Car si la substance corporelle pouvait être divisée de telle sorte que ses parties fussent réellement distinctes, pourquoi une partie ne pourrait-elle pas être anéantie, les autres conservant entre elles les même connexions qu’auparavant ? Et pourquoi doivent-elles toutes convenir entre elles de façon qu’il n’y ait pas de vide ? Certes si des choses sont réellement distinctes les unes des autres, l’une peut exister et conserver son état sans l’autre. Puis donc qu’il n’y a pas de vide dans la Nature (nous nous sommes expliqués ailleurs là-dessus) mais que toutes les parties doivent convenir entre elles de façon qu’il n’y en ait pas, il suit de là qu’elles ne peuvent se distinguer réellement, c’est-à-dire que la substance corporelle, en tant qu’elle est substance, ne peut pas être divisée. Si cependant l’on demande pourquoi nous inclinons ainsi par nature à diviser la quantité ? je réponds que la quantité est conçue par nous en deux manières : savoir abstraitement, c’est-à-dire superficiellement, telle qu’on se la représente par l’imagination, ou comme une substance, ce qui n’est possible qu’à l’entendement. Si donc nous avons égard à la quantité telle qu’elle est dans l’imagination, ce qui est le cas ordinaire et le plus facile, nous la trouverons finie, divisible et composée de parties ; si, au contraire, nous la considérons telle qu’elle est dans l’entendement et la concevons en tant que substance, ce qui est très difficile, alors, ainsi que nous l’avons assez démontré nous la trouverons infinie, unique et indivisible. Cela sera assez manifeste à tous ceux qui auront su distinguer entre l’imagination et l’entendement : surtout si l’on prend garde aussi que la matière est la même partout et qu’il n’y a pas en elle de parties distinctes, si ce n’est en tant que nous la concevons comme affectée de diverses manières ; d’où il suit qu’entre ses parties il y a une différence modale seulement et non réelle. Par exemple, nous concevons que l’eau, en tant qu’elle est eau, se divise et que ses parties se séparent les unes des autres, mais non en tant qu’elle est substance corporelle ; comme telle, en effet, elle ne souffre ni séparation ni division. De même l’eau, en tant qu’eau, s’engendre et se corrompt ; mais, en tant que substance, elle ne s’engendre ni ne se corrompt. Et par là je pense avoir répondu déjà au deuxième argument puisqu’il se fonde aussi sur cette supposition que la matière, en tant que substance, est divisible et formée de parties. Et eût-il un autre fondement, je ne sais pas pourquoi la matière serait indigne de la nature divine, puisque (Proposition 14) il ne peut y avoir en dehors de Dieu nulle substance par laquelle il pâtirait. Tout, dis-je, est en Dieu, et tout ce qui arrive, arrive par les seules lois de la nature infinie de Dieu et suit de la nécessité de son essence (comme je le montrerai bientôt) ; on ne peut donc dire à aucun égard que Dieu pâtit d’un autre être ou que la substance étendue est indigne de la nature divine, alors même qu’on la supposerait divisible, pourvu qu’on accorde qu’elle est éternelle et infinie. Mais en voilà assez sur ce point pour le présent.",
            "latin_text": "Sunt qui Deum instar hominis corpore et mente constantem atque passionibus obnoxium fingunt sed quam longe hi a vera Dei cognitione aberrent, satis ex jam demonstratis constat. Sed hos mitto : nam omnes qui naturam divinam aliquo modo contemplati sunt, Deum esse corporeum negant. Quod etiam optime probant ex eo quod per corpus intelligimus quamcunque quantitatem longam, latam et profundam, certa aliqua figura terminatam, quo nihil absurdius de Deo, ente scilicet absolute infinito, dici potest. Attamen interim aliis rationibus quibus hoc idem demonstrare conantur, clare ostendunt se substantiam ipsam corpoream sive extensam a natura divina omnino removere atque ipsam a Deo creatam statuunt. Ex qua autem divina potentia creari potuerit, prorsus ignorant; quod clare ostendit illos id quod ipsimet dicunt, non intelligere. Ego saltem satis clare meo quidem judicio demonstravi (vide corollarium propositionis 6 et scholium II propositionis 8) nullam substantiam ab alio produci vel creari. Porro propositione 14 ostendimus præter Deum nullam dari neque concipi posse substantiam atque hinc conclusimus substantiam extensam unum ex infinitis Dei attributis esse. Verum ad pleniorem explicationem adversariorum argumenta refutabo quæ omnia huc redeunt primo quod substantia corporea quatenus substantia constat ut putant partibus et ideo eandem infinitam posse esse et consequenter ad Deum pertinere posse negant. Atque hoc multis exemplis explicant ex quibus unum aut alterum afferam. Si substantia corporea aiunt est infinita, concipiatur in duas partes dividi; erit unaquæque pars vel finita vel infinita. Si illud, componitur ergo infinitum ex duabus partibus finitis, quod est absurdum. Si hoc, datur ergo infinitum duplo majus alio infinito, quod etiam est absurdum. Porro si quantitas infinita mensuratur partibus pedes æquantibus, infinitis talibus partibus constare debebit ut et si partibus mensuretur digitos æquantibus ac propterea unus numerus infinitus erit duodecies major alio infinito. Denique si ex uno puncto infinitæ cujusdam quantitatis concipiatur duas lineas ut AB, AC, certa ac determinata in initio distantia in infinitum protendi, certum est distantiam inter B et C continuo augeri et tandem ex determinata indeterminabilem fore. Cum igitur hæc absurda sequantur ut putant ex eo quod quantitas infinita supponitur, inde concludunt substantiam corpoream debere esse finitam et consequenter ad Dei essentiam non pertinere. Secundum argumentum petitur etiam a summa Dei perfectione. Deus enim inquiunt cum sit ens summe perfectum, pati non potest : atqui substantia corporea quandoquidem divisibilis est, pati potest; sequitur ergo ipsam ad Dei essentiam non pertinere. Hæc sunt quæ apud scriptores invenio argumenta quibus ostendere conantur substantiam corpoream divina natura indignam esse nec ad eandem posse pertinere. Verumenimvero si quis recte attendat, me ad hæc jam respondisse comperiet quandoquidem hæc argumenta in eo tantum fundantur quod substantiam corpoream ex partibus componi supponunt, quod jam (per propositionem 12 cum corollario propositionis 13) absurdum esse ostendi. Deinde si quis rem recte perpendere velit, videbit omnia illa absurda (siquidem omnia absurda sunt, de quo non jam disputo) ex quibus concludere volunt substantiam extensam finitam esse, minime ex eo sequi quod quantitas infinita supponatur sed quod quantitatem infinitam mensurabilem et ex partibus finitis conflari supponunt; quare ex absurdis quæ inde sequuntur, nihil aliud concludere possunt quam quod quantitas infinita non sit mensurabilis et quod ex partibus finitis conflari non possit. Atque hoc idem est quod nos supra (propositione 12 etc.) jam demonstravimus. Quare telum quod in nos intendunt, in se ipsos revera conjiciunt. Si igitur ipsi ex suo hoc absurdo concludere tamen volunt substantiam extensam debere esse finitam, nihil aliud hercle faciunt quam si quis ex eo quod finxit circulum quadrati proprietates habere, concludit circulum non habere centrum ex quo omnes ad circumferentiam ductæ lineæ sunt æquales. Nam substantiam corpoream quæ non nisi infinita, non nisi unica et non nisi indivisibilis potest concipi (vide propositiones 8, 5 et 12) eam ipsi ad concludendum eandem esse finitam, ex partibus finitis conflari et multiplicem esse et divisibilem concipiunt. Sic etiam alii postquam fingunt lineam ex punctis componi, multa sciunt invenire argumenta quibus ostendant lineam non posse in infinitum dividi. Et profecto non minus absurdum est ponere quod substantia corporea ex corporibus sive partibus componatur quam quod corpus ex superficiebus, superficies ex lineis, lineæ denique ex punctis componantur. Atque hoc omnes qui claram rationem infallibilem esse sciunt, fateri debent et imprimis ii qui negant dari vacuum. Nam si substantia corporea ita posset dividi ut ejus partes realiter distinctæ essent, cur ergo una pars non posset annihilari manentibus reliquis ut ante inter se connexis? et cur omnes ita aptari debent ne detur vacuum? Sane rerum quæ realiter ab invicem distinctæ sunt, una sine alia esse et in suo statu manere potest. Cum igitur vacuum in natura non detur (de quo alias) sed omnes partes ita concurrere debent ne detur vacuum, sequitur hinc etiam easdem non posse realiter distingui hoc est substantiam corpoream quatenus substantia est, non posse dividi. Si quis tamen jam quærat cur nos ex natura ita propensi simus ad dividendam quantitatem? ei respondeo quod quantitas duobus modis a nobis concipitur, abstracte scilicet sive superficialiter prout nempe ipsam imaginamur vel ut substantia, quod a solo intellectu fit. Si itaque ad quantitatem attendimus prout in imaginatione est, quod sæpe et facilius a nobis fit, reperietur finita, divisibilis et partibus conflata; si autem ad ipsam prout in intellectu est, attendimus et eam quatenus substantia est, concipimus, quod difficillime fit, tum ut jam satis demonstravimus, infinita, unica et indivisibilis reperietur. Quod omnibus qui inter imaginationem et intellectum distinguere sciverint, satis manifestum erit, præcipue si ad hoc etiam attendatur quod materia ubique eadem est nec partes in eadem distinguuntur nisi quatenus materiam diversimode affectam esse concipimus, unde ejus partes modaliter tantum distinguuntur, non autem realiter. Exempli gratia aquam quatenus aqua est, dividi concipimus ejusque partes ab invicem separari; at non quatenus substantia est corporea; eatenus enim neque separatur neque dividitur. Porro aqua quatenus aqua generatur et corrumpitur; at quatenus substantia nec generatur nec corrumpitur. Atque his me ad secundum argumentum etiam respondisse puto quandoquidem id in eo etiam fundatur quod materia quatenus substantia divisibilis sit et partibus confletur. Et quamvis hoc non esset, nescio cur divina natura indigna esset quandoquidem (per propositionem 14) extra Deum nulla substantia dari potest a qua ipsa pateretur. Omnia inquam in Deo sunt et omnia quæ fiunt per solas leges infinitæ Dei naturæ fiunt et ex necessitate ejus essentiæ (ut mox ostendam) sequuntur; quare nulla ratione dici potest Deum ab alio pati aut substantiam extensam divina natura indignam esse tametsi divisibilis supponatur dummodo æterna et infinita concedatur. Sed de his impræsentiarum satis."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_16",
      "number": "XVI",
      "texts": {
        "french_text": "De la nécessité de la nature divine doivent suivre en une infinité de modes une infinité de choses, c’est-à-dire tout ce qui peut tomber sous un entendement infini.",
        "english_text": "",
        "latin_text": ": Ex necessitate divinæ naturæ infinita infinitis modis (hoc est omnia quæ sub intellectum infinitum cadere possunt) sequi debent."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Cette Proposition doit être évidente pour chacun, pourvu qu’il ait égard à ce que, de la définition supposée donnée d’une chose quelconque, l’entendement conclut plusieurs propriétés qui en sont réellement les suites nécessaires (c’est-à-dire suivent de l’essence même de la chose), et d’autant plus que plus de réalité est exprimée par la définition de la chose, c’est-à-dire enveloppée dans son essence. Comme d’ailleurs la nature divine a une absolue infinité d’attributs (Définition 6), dont chacun exprime une essence infinie en son genre, de sa nécessité doivent suivre en une infinité de modes une infinité de choses, c’est-à-dire tout ce qui peut tomber sous un entendement infini. C. Q. F. D.",
            "latin_text": "Hæc propositio unicuique manifesta esse debet si modo ad hoc attendat quod ex data cujuscunque rei definitione plures proprietates intellectus concludit, quæ revera ex eadem (hoc est ipsa rei essentia) necessario sequuntur et eo plures quo plus realitatis rei definitio exprimit hoc est quo plus realitatis rei definitæ essentia involvit. Cum autem natura divina infinita absolute attributa habeat (per definitionem 6) quorum etiam unumquodque infinitam essentiam in suo genere exprimit, ex ejusdem ergo necessitate infinita infinitis modis (hoc est omnia quæ sub intellectum infinitum cadere possunt) necessario sequi debent. Q.E.D."
          }
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit de là : 1o que Dieu est cause efficiente de toutes les choses qui peuvent tomber sous un entendement infini.",
            "latin_text": ": Hinc sequitur Deum omnium rerum quæ sub intellectum infinitum cadere possunt, esse causam efficientem."
          },
          "number": "I"
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit : 2o que Dieu est cause par soi et non par accident.",
            "latin_text": ": Sequitur II° Deum causam esse per se, non vero per accidens."
          },
          "number": "II"
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit : 3o que Dieu est absolument cause première.",
            "latin_text": ": Sequitur III° Deum esse absolute causam primam."
          },
          "number": "III"
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_17",
      "number": "XVII",
      "texts": {
        "french_text": "Dieu agit par les seules lois de sa nature et sans subir aucune contrainte.",
        "english_text": ". But, for the sake of my opponents, I will show further, that although it be granted that will pertains to the essence of God, it nevertheless follows from his perfection, that things could not have been by him created other than they are, or in a different order ; this is easily proved, if we reflect on what our opponents themselves concede, namely, that it depends solely on the decree and will of God, that each thing is what it is. If it were otherwise, God would not be the cause of all things. Further, that all the decrees of God have been ratified from all eternity by God himself. If it were otherwise, God would be convicted of imperfection or change. But in eternity there is no such thing as when, before, or after ; hence it follows solely from the perfection of God, that God never can decree, or never could have decreed anything but what is ; that God did not exist before his decrees, and would not exist without them. But, it is said, supposing that God had made a different universe, or had ordained other decrees from all eternity concerning nature and her order, we could not therefore conclude any imperfection in God. But persons who say this must admit that God can change his decrees. For if God had ordained any decrees concerning nature and her order, different from those which he has ordained—in other words, if he had willed and conceived something different concerning nature—he would perforce have had a different intellect from that which he has, and also a different will. But if it were allowable to assign to God a different intellect and a different will, without any change in his essence or his perfection, what would there be to prevent him changing the decrees which he has made concerning created things, and nevertheless remaining perfect? For his intellect and will concerning things created and their order are the same, in respect to his essence and perfection, however they be conceived.\n\nFurther, all the philosophers whom I have read admit that God's intellect is entirely actual, and not at all potential ; as they also admit that God's intellect, and God's will, and God's essence are identical, it follows that, if God had had a different actual intellect and a different will, his essence would also have been different ; and thus, as I concluded at first, if things had been brought into being by God in a different way from that which has obtained, God's intellect and will, that is (as is admitted) his essence would perforce have been different, which is absurd.\n\nAs these things could not have been brought into being by God in any but the actual way and order which has obtained ; and as the truth of this proposition follows from the supreme perfection of God ; we can have no sound reason for persuading ourselves to believe that God did not wish to create all the things which were in his intellect, and to create them in the same perfection as he had understood them.\n\nBut, it will be said, there is in things no perfection nor imperfection ; that which is in them, and which causes them to be called perfect or imperfect, good or bad, depends solely on the will of God. If God had so willed, he might have brought it about that what is now perfection should be extreme imperfection, and vice versâ. What is such an assertion, but an open declaration that God, who necessarily understands that which he wishes, might bring it about by his will, that he should understand things differently from the way in which he does understand them? This (as we have just shown) is the height of absurdity. Wherefore, I may turn the argument against its employers, as follows :—All things depend on the power of God. In order that things should be different from what they are, God's will would necessarily have to be different. But God's will cannot be different (as we have just most clearly demonstrated) from God's perfection. Therefore neither can things be different. I confess, that the theory which subjects all things to the will of an indifferent deity, and asserts that they are all dependent on his fiat, is less far from the truth than the theory of those, who maintain that God acts in all things with a view of promoting what is good. For these latter persons seem to set up something beyond God, which does not depend on God, but which God in acting looks to as an exemplar, or which he aims at as a definite goal. This is only another name for subjecting God to the dominion of destiny, an utter absurdity in respect to God, whom we have shown to be the first and only free cause of the essence of all things and also of their existence. I need, therefore, spend no time in refuting such wild theories.",
        "latin_text": ": Deus ex solis suæ naturæ legibus et a nemine coactus agit."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Nous avons montré (Proposition 16) que, de la seule nécessité de la nature divine ou (ce qui revient au même) des seules lois de sa nature, suit une absolue infinité de choses et (Proposition 15) nous avons démontré que rien ne peut être ni être conçu sans Dieu, mais que tout est en Dieu ; donc rien ne peut être hors de lui, par quoi il soit déterminé à agir ou contraint d’agir, et ainsi Dieu agit par les seules lois de sa nature et sans aucune contrainte. C. Q. F. D.",
            "latin_text": "Ex sola divinæ naturæ necessitate vel (quod idem est) ex solis ejusdem naturæ legibus infinita absolute sequi modo propositione 16 ostendimus et propositione 15 demonstravimus nihil sine Deo esse nec concipi posse sed omnia in Deo esse; quare nihil extra ipsum esse potest a quo ad agendum determinetur vel cogatur atque adeo Deus ex solis suæ naturæ legibus et a nemine coactus agit. Q.E.D."
          }
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit de là : 1o qu’il n’existe aucune cause qui en dehors de Dieu ou en lui l’incite à agir, si ce n’est la perfection de sa propre nature.",
            "latin_text": ": Hinc sequitur I° nullam dari causam quæ Deum extrinsece vel intrinsece præter ipsius naturæ perfectionem incitet ad agendum."
          },
          "number": "I"
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit : 2o que Dieu seul est cause libre. Car Dieu seul existe par la seule nécessité de sa nature (Prop. 11 et Coroll. 1 de la Prop. 14) et agit par la seule nécessité de sa nature (Prop. précédente). Par suite (Définition 7), il est seul cause libre. C. Q. F. D.",
            "latin_text": ": Sequitur II° solum Deum esse causam liberam. Deus enim solus ex sola suæ naturæ necessitate existit (per propositionem 11 et corollarium I propositionis 14) et ex sola suæ naturæ necessitate agit (per propositionem præcedentem). Adeoque (per definitionem 7) solus est causa libera. Q.E.D."
          },
          "number": "II"
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "D’autres pensent que Dieu est cause libre parce qu’il peut, à ce qu’ils croient, faire que les choses que nous avons dit qui suivent de sa nature ou qui sont en son pouvoir, n’arrivent pas, en d’autres termes, ne soient pas produites par lui. C’est tout comme s’ils disaient : Dieu peut faire qu’il ne suive pas de la nature du triangle que ses trois angles égalent deux droits ; ou que d’une cause donnée l’effet ne suive pas, ce qui est absurde. En outre, je montrerai plus loin et sans le secours de cette Proposition que ni l’entendement ni la volonté n’appartiennent à la nature de Dieu. Je sais bien que plusieurs croient pouvoir démontrer qu’un entendement suprême et une libre volonté appartiennent à la nature de Dieu ; ils disent, en effet, ne rien connaître de plus parfait qu’ils puissent attribuer à Dieu, que ce qui, en nous, est la plus haute perfection. Bien que, cependant, ils conçoivent Dieu comme étant un être souverainement connaissant, ils ne croient cependant pas qu’il puisse rendre existant tout ce dont il a une connaissance actuelle, car ils croiraient ainsi détruire la puissance de Dieu. S’il avait créé, disent-ils, tout ce qui est en son entendement, il n’aurait donc rien pu créer de plus, ce qu’ils croient qui répugne à l’omnipotence divine ; et, par suite, ils ont mieux aimé admettre un Dieu indifférent à toutes choses et ne créant rien d’autre que ce que, par une certaine volonté absolue, il a décrété de créer. Mais je crois avoir montré assez clairement (Proposition 16) que de la souveraine puissance de Dieu, ou de sa nature infinie, une infinité de choses en une infinité de modes, c’est-à-dire tout, a nécessairement découlé ou en suit, toujours avec la même nécessité ; de même que de toute éternité et pour l’éternité il suit de la nature du triangle que ses trois angles égalent deux droits. C’est pourquoi la toute-puissance de Dieu a été en acte de toute éternité et demeure pour l’éternité dans la même actualité. Et de la sorte, la toute-puissance admise en Dieu est beaucoup plus parfaite, du moins à mon jugement. Bien plus, mes adversaires semblent (s’il est permis de parler ouvertement) nier la toute-puissance de Dieu. Ils sont contraints d’avouer, en effet, que Dieu a l’idée d’une infinité de choses créables que cependant il ne pourra jamais créer. Car, autrement, c’est-à-dire s’il créait tout ce dont il a l’idée, il épuiserait, suivant eux, toute sa puissance et se rendrait imparfait. Pour mettre en Dieu de la perfection, ils en sont donc réduits à admettre en même temps qu’il ne peut faire tout ce à quoi s’étend sa puissance et je ne vois pas de fiction plus absurde ou qui s’accorde moins avec la toute-puissance divine. En outre, pour dire ici quelque chose aussi de l’entendement et de la volonté que nous attribuons communément à Dieu, si l’entendement et la volonté appartiennent à l’essence éternelle de Dieu, il faut entendre par l’un et l’autre attributs autre chose certes que ce que les hommes ont coutume de faire. Car l’entendement et la volonté qui constitueraient l’essence de Dieu, devraient différer de toute l’étendue du ciel de notre entendement et de notre volonté et ne pourraient convenir avec eux autrement que par le nom, c’est-à-dire comme conviennent entre eux le chien, signe céleste, et le chien, animal aboyant. Je le démontrerai comme il suit. Si un entendement appartient à la nature divine, il ne pourra, comme notre entendement, être de sa nature postérieur (ainsi que le veulent la plupart) aux choses qu’il connaît ou exister en même temps qu’elles, puisque Dieu est antérieur à toutes choses par sa causalité (Corollaire 1 de la Proposition 16) ; mais, au contraire, la vérité et l’essence formelle des choses est telle, parce que telle elle existe objectivement dans l’entendement de Dieu. L’entendement de Dieu donc, en tant qu’il est conçu comme constituant l’essence de Dieu, est réellement la cause des choses, aussi bien de leur essence que de leur existence ; cela paraît avoir été aperçu par ceux qui ont affirmé que l’entendement de Dieu, sa volonté et sa puissance ne sont qu’une seule et même chose. Puis donc que l’entendement de Dieu est l’unique cause des choses, c’est-à-dire (comme nous l’avons montré) aussi bien de leur essence que de leur existence, il doit nécessairement différer d’elles tant à l’égard de l’essence qu’à l’égard de l’existence. Le causé, en effet, diffère de sa cause précisément en ce qu’il tient de sa cause. Par exemple, un homme est cause de l’existence mais non de l’essence d’un autre homme, car cette essence est une vérité éternelle ; par suite, ils peuvent convenir entièrement quant à l’essence, mais ils doivent différer eu égard à l’existence ; pour cette raison, si l’existence de l’un vient à périr, celle de l’autre ne périra pas pour cela ; mais, si l’essence de l’un pouvait être détruite et devenir fausse, celle de l’autre serait aussi fausse. Par suite, une chose qui est cause à la fois de l’essence et de l’existence d’un certain effet, doit différer de cet effet aussi bien à l’égard de l’essence qu’à l’égard de l’existence. Or, l’entendement de Dieu est cause tant de l’essence que de l’existence de notre entendement, donc l’entendement de Dieu en tant qu’on le conçoit comme constituant l’essence divine, diffère de notre entendement tant à l’égard de l’essence qu’à l’égard de l’existence et ne peut convenir en rien avec lui, si ce n’est par le nom, comme nous le voulions. Touchant la volonté, on procédera de même, comme chacun peut le voir aisément.",
            "latin_text": "Alii putant Deum esse causam liberam propterea quod potest ut putant efficere ut ea quæ ex ejus natura sequi diximus hoc est quæ in ejus potestate sunt, non fiant sive ut ab ipso non producantur. Sed hoc idem est ac si dicerent quod Deus potest efficere ut ex natura trianguli non sequatur ejus tres angulos æquales esse duobus rectis sive ut ex data causa non sequatur effectus, quod est absurdum. Porro infra absque ope hujus propositionis ostendam ad Dei naturam neque intellectum neque voluntatem pertinere. Scio equidem plures esse qui putant se posse demonstrare ad Dei naturam summum intellectum et liberam voluntatem pertinere; nihil enim perfectius cognoscere sese aiunt quod Deo tribuere possunt quam id quod in nobis summa est perfectio. Porro tametsi Deum actu summe intelligentem concipiant, non tamen credunt eum posse omnia quæ actu intelligit, efficere ut existant nam se eo modo Dei potentiam destruere putant. Si omnia inquiunt quæ in ejus intellectu sunt, creavisset, nihil tum amplius creare potuisset, quod credunt Dei omnipotentiæ repugnare ideoque maluerunt Deum ad omnia indifferentem statuere nec aliud creantem præter id quod absoluta quadam voluntate decrevit creare. Verum ego me satis clare ostendisse puto (vide propositionem 16) a summa Dei potentia sive infinita natura infinita infinitis modis hoc est omnia necessario effluxisse vel semper eadem necessitate sequi eodem modo ac ex natura trianguli ab æterno et in æternum sequitur ejus tres angulos æquari duobus rectis. Quare Dei omnipotentia actu ab æterno fuit et in æternum in eadem actualitate manebit. Et hoc modo Dei omnipotentia longe meo quidem judicio perfectior statuitur. Imo adversarii Dei omnipotentiam (liceat aperte loqui) negare videntur. Coguntur enim fateri Deum infinita creabilia intelligere quæ tamen nunquam creare poterit. Nam alias si scilicet omnia quæ intelligit crearet, suam juxta ipsos exhauriret omnipotentiam et se imperfectum redderet. Ut igitur Deum perfectum statuant, eo rediguntur ut simul statuere debeant ipsum non posse omnia efficere ad quæ ejus potentia se extendit, quo absurdius aut Dei omnipotentiæ magis repugnans non video quid fingi possit. Porro ut de intellectu et voluntate quos Deo communiter tribuimus, hic etiam aliquid dicam, si ad æternam Dei essentiam intellectus scilicet et voluntas pertinent, aliud sane per utrumque hoc attributum intelligendum est quam quod vulgo solent homines. Nam intellectus et voluntas qui Dei essentiam constituerent, a nostro intellectu et voluntate toto cælo differre deberent nec in ulla re præterquam in nomine convenire possent; non aliter scilicet quam inter se conveniunt canis, signum cæleste et canis, animal latrans. Quod sic demonstrabo. Si intellectus ad divinam naturam pertinet, non poterit uti noster intellectus posterior (ut plerisque placet) vel simul natura esse cum rebus intellectis quandoquidem Deus omnibus rebus prior est causalitate (per corollarium I propositionis 16) sed contra veritas et formalis rerum essentia ideo talis est quia talis in Dei intellectu existit objective. Quare Dei intellectus quatenus Dei essentiam constituere concipitur, est revera causa rerum tam earum essentiæ quam earum existentiæ, quod ab iis videtur etiam fuisse animadversum qui Dei intellectum, voluntatem et potentiam unum et idem esse asseruerunt. Cum itaque Dei intellectus sit unica rerum causa videlicet (ut ostendimus) tam earum essentiæ quam earum existentiæ, debet ipse necessario ab iisdem differre tam ratione essentiæ quam ratione existentiæ. Nam causatum differt a sua causa præcise in eo quod a causa habet. Exempli gratia homo est causa existentiæ, non vero essentiæ alterius hominis; est enim hæc æterna veritas et ideo secundum essentiam prorsus convenire possunt; in existendo autem differre debent et propterea si unius existentia pereat, non ideo alterius peribit sed si unius essentia destrui posset et fieri falsa, destrueretur etiam alterius essentia. Quapropter res quæ et essentiæ et existentiæ alicujus effectus est causa, a tali effectu differre debet tam ratione essentiæ quam ratione existentiæ. Atqui Dei intellectus est et essentiæ et existentiæ nostri intellectus causa; ergo Dei intellectus quatenus divinam essentiam constituere concipitur, a nostro intellectu tam ratione essentiæ quam ratione existentiæ differt nec in ulla re præterquam in nomine cum eo convenire potest, ut volebamus. Circa voluntatem eodem modo proceditur, ut facile unusquisque videre potest."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_18",
      "number": "XVIII",
      "texts": {
        "french_text": "Dieu est cause immanente mais non transitive de toutes choses.",
        "english_text": ". God is the indwelling and not the transient cause of all things.",
        "latin_text": ": Deus est omnium rerum causa immanens, non vero transiens."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Tout ce qui est, est en Dieu et doit être conçu par Dieu (Prop. 15), et ainsi (Coroll. 1 de la Prop. 16) Dieu est cause de choses qui sont en lui-même, ce qui est le premier point. Ensuite en dehors de Dieu nulle substance ne peut être donnée (Prop. 14), c’est-à-dire (Définition 3) en dehors de Dieu nulle chose qui soit en elle-même, ce qui était le second point. Dieu est donc cause immanente et non transitive de toutes choses. C. Q. F. D.",
            "english_text": "—All things which are, are in God, and must be conceived through God (by Prop. xv.), therefore (by Prop. xvi., Coroll. i.) God is the cause of those things which are in him. This is our first point. Further, besides God there can be no substance (by Prop. xiv.), that is nothing in itself external to God. This is our second point. God, therefore, is the indwelling and not the transient cause of all things. Q.E.D.",
            "latin_text": "Omnia quæ sunt, in Deo sunt et per Deum concipi debent (per propositionem 15) adeoque (per corollarium I propositionis 16 hujus) Deus rerum quæ in ipso sunt, est causa, quod est primum. Deinde extra Deum nulla potest dari substantia (per propositionem 14) hoc est (per definitionem 3) res quæ extra Deum in se sit, quod erat secundum. Deus ergo est omnium rerum causa immanens, non vero transiens. Q.E.D."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_19",
      "number": "XIX",
      "texts": {
        "french_text": "Dieu est éternel, autrement dit tous les attributs de Dieu sont éternels.",
        "english_text": ". God, and all the attributes of God, are eternal.",
        "latin_text": ": Deus sive omnia Dei attributa sunt æterna."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Dieu en effet est une substance (Définition 6), qui existe nécessairement (Prop. 11), c’est-à-dire (Prop. 7) à la nature de laquelle il appartient d’exister ou (ce qui revient au même) de la définition de laquelle suit l’affirmation qu’elle existe, et ainsi (Définition 8) il est éternel. De plus il faut entendre par attributs de Dieu ce qui (Déf. 4) exprime l’essence de la nature divine, c’est-à-dire appartient à la substance : cela même, dis-je, les attributs doivent l’envelopper. Or l’éternité appartient à la nature de la substance (comme je l’ai démontré déjà par la Prop. 7), donc chacun des attributs doit envelopper l’éternité, et ainsi tous sont éternels. C. Q. F. D.",
            "english_text": "—God (by Def. vi.) is substance, which (by Prop. xi.) necessarily exists, that is (by Prop. vii.) existence appertains to its nature, or (what is the same thing) follows from its definition ; therefore, God is eternal (by Def. viii.). Further, by the attributes of God we must understand that which (by Def. iv.) expresses the essence of the divine substance—in other words, that which appertains to substance : that, I say, should be involved in the attributes of substance. Now eternity appertains to the nature of substance (as I have already shown in Prop. vii.) ; therefore, eternity must appertain to each of the attributes, and thus all are eternal. Q.E.D."
          }
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "Cette Proposition est encore rendue très évidente par la façon dont (Prop. 11) j’ai démontré l’existence de Dieu. Il suit en effet de cette démonstration que l’existence de Dieu, comme son essence, est une vérité éternelle. En outre, j’ai démontré autrement encore (Prop. 19 des Principes de Descartes) l’éternité de Dieu, et il n’est pas besoin de reproduire ici ce raisonnement.",
            "english_text": "—This proposition is also evident from the manner in which (in Prop. xi.) I demonstrated the existence of God ; it is evident, I repeat, from that proof, that the existence of God, like his essence, is an eternal truth. Further (in Prop. xix. of my \"Principles of the Cartesian Philosophy\"), I have proved the eternity of God, in another manner, which I need not here repeat.",
            "latin_text": "Hæc propositio quam clarissime etiam patet ex modo quo (propositione 11) Dei existentiam demonstravi; ex ea inquam demonstratione constat Dei existentiam sicut ejus essentiam æternam esse veritatem. Deinde (propositione 19 Principiorum Cartesii) alio etiam modo Dei æternitatem demonstravi nec opus est eum hic repetere."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_20",
      "number": "XX",
      "texts": {
        "french_text": "L’existence de Dieu et son essence sont une seule et même chose.",
        "english_text": ". The existence of God and his essence are one and the same.",
        "latin_text": ": Dei existentia ejusque essentia unum et idem sunt."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Dieu (Proposition précédente) est éternel et tous ses attributs sont éternels, c’est-à-dire (Déf. 8) que chacun de ses attributs exprime de l’existence. Donc les mêmes attributs de Dieu qui expliquent l’essence éternelle de Dieu (Déf. 4), expliquent en même temps son existence éternelle, c’est-à-dire cela même qui constitue l’essence de Dieu, constitue aussi son existence, et ainsi l’essence et l’existence sont une seule et même chose. C. Q. F. D.",
            "english_text": "—God (by the last Prop.) and all his attributes are eternal, that is (by Def. viii.) each of his attributes expresses existence. Therefore the same attributes of God which explain his eternal essence, explain at the same time his eternal existence—in other words, that which constitutes God's essence constitutes at the same time his existence. Wherefore God's existence and God's essence are one and the same. Q.E.D.\n\nCorollary I.—Hence it follows that God's existence, like his essence, is an eternal truth.\n\nCorollary II.—Secondly, it follows that God, and all the attributes of God, are unchangeable. For if they could be changed in respect to existence, they must also be able to be changed in respect to essence—that is, obviously, be changed from true to false, which is absurd."
          }
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit de là : 1o que l’existence de Dieu aussi bien que son essence est une vérité éternelle.",
            "latin_text": ": Hinc sequitur I° Dei existentiam sicut ejus essentiam æternam esse veritatem."
          },
          "number": "I"
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit : 2o que Dieu est immuable, autrement dit que tous les attributs de Dieu sont immuables. Car, s’ils venaient à changer relativement à l’existence, ils devraient aussi (Prop. précédente) changer relativement à l’essence, c’est-à-dire (comme il est connu de soi) devenir faux de vrais qu’ils étaient, ce qui est absurde.",
            "latin_text": ": Sequitur II° Deum sive omnia Dei attributa esse immutabilia. Nam si ratione existentiæ mutarentur, deberent etiam (per propositionem præcedentem) ratione essentiæ mutari hoc est (ut per se notum) ex veris falsa fieri, quod est absurdum."
          },
          "number": "II"
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_21",
      "number": "XXI",
      "texts": {
        "french_text": "Tout ce qui suit de la nature d’un attribut de Dieu prise absolument, a toujours dû exister et est infini, autrement dit est infini et éternel par la vertu de cet attribut.",
        "english_text": ". All things which follow from the absolute nature of any attribute of God must always exist and be infinite, or, in other words, are eternal and infinite through the said attribute.",
        "latin_text": ": Omnia quæ ex absoluta natura alicujus attributi Dei sequuntur, semper et infinita existere debuerunt sive per idem attributum æterna et infinita sunt."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Si vous le niez, concevez, si vous le pouvez, que, dans un attribut de Dieu, quelque chose qui soit fini et ait une existence ou une durée déterminée suive de la nature absolue de cet attribut, par exemple l’idée de Dieu dans la pensée. La pensée, puisqu’on suppose qu’elle est un attribut de Dieu, est nécessairement infinie de sa nature (Prop. 11) et d’autre part, en tant qu’elle a l’idée de Dieu, on la suppose finie. Mais (Définition 2) elle ne peut être conçue comme finie si elle n’est pas limitée par la pensée elle-même. Elle ne peut l’être cependant par la pensée en tant que celle-ci constitue l’idée de Dieu ; car, ainsi considérée, la pensée est supposée finie. Ce sera donc par la pensée en tant qu’elle ne constitue pas l’idée de Dieu, encore qu’existant nécessairement (Prop. 11). Il y a donc une pensée ne constituant pas l’idée de Dieu, et, par suite, l’idée de Dieu ne suit pas de la nature de la pensée en tant que celle-ci est prise absolument (on la conçoit, en effet, comme constituant l’idée de Dieu et comme ne la constituant pas). Mais cela est contre l’hypothèse. Donc, si l’idée de Dieu dans la pensée, ou quelque chose que ce soit (peu importe, puisque la démonstration est universelle), suit dans un attribut de Dieu de la nécessité de la nature de cet attribut, prise absolument, cette chose doit être nécessairement infinie. C’était là le premier point.\n\nMaintenant, ce qui suit ainsi de la nécessité de la nature d’un attribut, ne peut avoir une durée déterminée. Si vous le niez, supposez qu’une chose qui suit de la nécessité de la nature d’un attribut, soit donnée en quelque attribut de Dieu, par exemple l’idée de Dieu dans la pensée, et que cette chose soit supposée n’avoir pas existé ou ne devoir pas exister à un certain moment du temps. Comme cependant la pensée est supposée un attribut de Dieu, elle doit exister nécessairement et être immuable (Prop. 11 et Corollaire 2 de la Prop. 20). Donc au-delà des limites de la durée de l’idée de Dieu (qu’on suppose n’avoir pas existé ou ne devoir pas exister à un certain moment du temps) la pensée devra être sans l’idée de Dieu. Or cela est contre l’hypothèse ; car on suppose que, cette pensée étant donnée, l’idée de Dieu en suit nécessairement. Donc l’idée de Dieu dans la pensée, non plus qu’aucune chose qui suit nécessairement de la nature d’un attribut de Dieu prise absolument, ne peut avoir une durée déterminée ; mais par la vertu de cet attribut cette chose est éternelle. Ce qui est le second point. On observera que ce qui est dit ici, doit être affirmé de toute chose qui, dans un attribut de Dieu, suit nécessairement de la nature de Dieu prise absolument.",
            "english_text": "—Conceive, if it be possible (supposing the proposition to be denied), that something in some attribute of God can follow from the absolute nature of the said attribute, and that at the same time it is finite, and has a conditioned existence or duration ; for instance, the idea of God expressed in the attribute thought. Now thought, in so far as it is supposed to be an attribute of God, is necessarily (by Prop. xi.) in its nature infinite. But, in so far as it possesses the idea of God, it is supposed finite. It cannot, however, be conceived as finite, unless it be limited by thought (by Def. ii.) ; but it is not limited by thought itself, in so far as it has constituted the idea of God (for so far it is supposed to be finite) ; therefore, it is limited by thought, in so far as it has not constituted the idea of God, which nevertheless (by Prop. xi.) must necessarily exist.\n\nWe have now granted, therefore, thought not constituting the idea of God, and, accordingly, the idea of God does not naturally follow from its nature in so far as it is absolute thought (for it is conceived as constituting, and also as not constituting, the idea of God), which is against our hypothesis. Wherefore, if the idea of God expressed in the attribute thought, or, indeed, anything else in any attribute of God (for we may take any example, as the proof is of universal application) follows from the necessity of the absolute nature of the said attribute, the said thing must necessarily be infinite, which was our first point.\n\nFurthermore, a thing which thus follows from the necessity of the nature of any attribute cannot have a limited duration. For if it can, suppose a thing, which follows from the necessity of the nature of some attribute, to exist in some attribute of God, for instance, the idea of God expressed in the attribute thought, and let it be supposed at some time not to have existed, or to be about not to exist.\n\nNow thought being an attribute of God, must necessarily exist unchanged (by Prop. xi., and Prop. xx., Coroll. ii.) ; and beyond the limits of the duration of the idea of God (supposing the latter at some time not to have existed, or not to be going to exist) thought would perforce have existed without the idea of God, which is contrary to our hypothesis, for we supposed that, thought being given, the idea of God necessarily flowed therefrom. Therefore the idea of God expressed in thought, or anything which necessarily follows from the absolute nature of some attribute of God, cannot have a limited duration, but through the said attribute is eternal, which is our second point. Bear in mind that the same proposition may be affirmed of anything, which in any attribute necessarily follows from God's absolute nature."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_22",
      "number": "XXII",
      "texts": {
        "french_text": "Tout ce qui suit d’un attribut de Dieu, en tant qu’il est affecté d’une modification qui par la vertu de cet attribut existe nécessairement et est infinie, doit aussi exister nécessairement et être infini.",
        "english_text": ". Whatsoever follows from any attribute of God, in so far as it is modified by a modification, which exists necessarily and as infinite, through the said attribute, must also exist necessarily and as infinite.",
        "latin_text": ": Quicquid ex aliquo Dei attributo quatenus modificatum est tali modificatione quæ et necessario et infinita per idem existit, sequitur, debet quoque et necessario et infinitum existere."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "La démonstration de cette Proposition se fait de même façon que celle de la précédente.",
            "english_text": "—The proof of this proposition is similar to that of the preceding one.",
            "latin_text": "Hujus propositionis demonstratio procedit eodem modo ac demonstratio præcedentis."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_23",
      "number": "XXIII",
      "texts": {
        "french_text": "Tout mode qui existe nécessairement et est infini, a dû suivre nécessairement ou bien de la nature d’un attribut de Dieu prise absolument, ou bien d’un attribut affecté d’une modification qui elle-même existe nécessairement et est infinie.",
        "english_text": ". Every mode, which exists both necessarily and as infinite, must necessarily follow either from the absolute nature of some attribute of God, or from an attribute modified by a modification which exists necessarily, and as infinite.",
        "latin_text": ": Omnis modus qui et necessario et infinitus existit, necessario sequi debuit vel ex absoluta natura alicujus attributi Dei vel ex aliquo attributo modificato modificatione quæ et necessario et infinita existit."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Un mode existe dans une chose autre que lui, par laquelle il doit être conçu (Définition 5), c’est-à-dire (Prop. 15) qu’il est en Dieu seul et doit être conçu par Dieu seul. Si donc l’on conçoit un mode qui existe nécessairement et est infini, ces deux caractères devront être conçus ou perçus nécessairement par le moyen d’un attribut de Dieu, en tant que cet attribut exprime l’infinité et la nécessité de l’existence, ou (ce qui revient au même d’aprés la Défin. 8) l’éternité, c’est-à-dire (Déf. 6 et Prop. 19) en tant qu’on le considère absolument. Un mode donc qui existe nécessairement, et est infini, a dû suivre de la nature d’un attribut de Dieu prise absolument, et cela ou bien immédiatement (c’est le cas de la Prop. 21) ou bien par l’intermédiaire de quelque modification qui suit de cette nature prise absolument, c’est-à-dire (Prop. précédente) qui existe nécessairement et est infinie. C. Q. F. D.",
            "english_text": "—A mode exists in something else, through which it must be conceived (Def. v.), that is (Prop. xv.), it exists solely in God, and solely through God can be conceived. If therefore a mode is conceived as necessarily existing and infinite, it must necessarily be inferred or perceived through some attribute of God, in so far as such attribute is conceived as expressing the infinity and necessity of existence, in other words (Def. viii.) eternity ; that is, in so far as it is considered absolutely. A mode, therefore, which necessarily exists as infinite, must follow from the absolute nature of some attribute of God, either immediately (Prop. xxi.) or through the means of some modification, which follows from the absolute nature of the said attribute ; that is (by Prop. xxii.), which exists necessarily and as infinite."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_24",
      "number": "XXIV",
      "texts": {
        "french_text": "L’essence des choses produites par Dieu n’enveloppe pas l’existence.",
        "english_text": ". The essence of things produced by God does not involve existence.",
        "latin_text": ": Rerum a Deo productarum essentia non involvit existentiam."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Cela est évident par la Définition 1. Car ce dont la nature (considérée en elle-même) enveloppe l’existence, est cause de soi et existe par la seule nécessité de sa nature.",
            "english_text": "—This proposition is evident from Def. i. For that of which the nature (considered in itself) involves existence is self-caused, and exists by the sole necessity of its own nature.",
            "latin_text": "Patet ex definitione 1. Id enim cujus natura (in se scilicet considerata) involvit existentiam, causa est sui et ex sola suæ naturæ necessitate existit."
          }
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit de là que Dieu n’est pas seulement la cause qui fait que les choses commencent d’exister ; mais aussi celle qui fait qu’elles persévèrent dans l’existence, autrement dit (pour user d’un terme scolastique) Dieu est cause de l’être des choses. Car, soit qu’elles existent, soit qu’elles n’existent pas, toutes les fois que nous avons égard à leur essence, nous trouvons qu’elle n’enveloppe ni existence, ni durée, et ainsi leur essence ne peut être cause ni de leur existence, ni de leur durée ; mais Dieu seul, à la seule nature de qui il appartient d’exister (Corollaire 1 de la Prop. 14).",
            "english_text": "—Hence it follows that God is not only the cause of things coming into existence, but also of their continuing in existence, that is, in scholastic phraseology, God is cause of the being of things (essendi rerum). For whether things exist, or do not exist, whenever we contemplate their essence, we see that it involves neither existence nor duration ; consequently, it cannot be the cause of either the one or the other. God must be the sole cause, inasmuch as to him alone does existence appertain. (Prop. xiv. Coroll. i.) Q.E.D.",
            "latin_text": "Hinc sequitur Deum non tantum esse causam ut res incipiant existere sed etiam ut in existendo perseverent sive (ut termino scholastico utar) Deum esse causam essendi rerum. Nam sive res existant sive non existant, quotiescunque ad earum essentiam attendimus, eandem nec existentiam nec durationem involvere comperimus adeoque earum essentia neque suæ existentiæ neque suæ durationis potest esse causa sed tantum Deus ad cujus solam naturam pertinet existere (per corollarium I propositionis 14)."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_25",
      "number": "XXV",
      "texts": {
        "french_text": "Dieu n’est pas seulement cause efficiente de l’existence, mais aussi de l’essence des choses.",
        "english_text": ". God is the efficient cause not only of the existence of things, but also of their essence.",
        "latin_text": ": Deus non tantum est causa efficiens rerum existentiæ sed etiam essentiæ."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Si vous le niez, c’est donc que Dieu n’est pas cause de l’essence ; et ainsi (Ax. 4) l’essence des choses peut être conçue sans Dieu ; or cela (Prop. 15) est absurde. Donc Dieu est cause aussi de l’essence des choses. C. Q. F. D.",
            "english_text": "—If this be denied, then God is not the cause of the essence of things ; and therefore the essence of things can (by Ax. iv.) be conceived without God. This (by Prop. xv.) is absurd. Therefore, God is the cause of the essence of things. Q.E.D.",
            "latin_text": "Si negas, ergo rerum essentiæ Deus non est causa adeoque (per axioma 4) potest rerum essentia sine Deo concipi : atqui hoc (per propositionem 15) est absurdum. Ergo rerum etiam essentiæ Deus est causa. Q.E.D."
          }
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "Cette Proposition suit plus clairement de la Proposition 16. Il suit en effet de cette dernière que, la nature divine étant donnée, aussi bien l’essence que l’existence des choses doit s’en conclure nécessairement ; et, en un mot, au sens où Dieu est dit cause de soi, il doit être dit aussi cause de toutes choses, ce qui sera établi encore plus clairement par le Corollaire suivant.",
            "english_text": "—This proposition follows more clearly from",
            "latin_text": "Hæc"
          }
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Les choses particulières ne sont rien si ce n’est des affections des attributs de Dieu, autrement dit des modes, par lesquels les attributs de Dieu sont exprimés d’une manière certaine et déterminée. Cela est démontré clairement par la Proposition 15 et la Définition 5."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_26",
      "number": "XXVI",
      "texts": {
        "french_text": "Une chose qui est déterminée à produire quelque effet a été nécessairement déterminée par Dieu ; et celle qui n’a pas été déterminée par Dieu ne peut se déterminer elle-même à produire un effet.",
        "english_text": ". A thing which is conditioned to act in a particular manner, has necessarily been thus conditioned by God ; and that which has not been conditioned by God cannot condition itself to act.",
        "latin_text": ": Res quæ ad aliquid operandum determinata est, a Deo necessario sic fuit determinata et quæ a Deo non est determinata, non potest se ipsam ad operandum determinare."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Ce par quoi les choses sont dites déterminées à produire quelque effet, est nécessairement quelque chose de positif (comme il est connu de soi) ; et ainsi son essence comme son existence ont Dieu pour cause efficiente (Prop. 25 et 16), ce qui était le premier point. La deuxième partie de la Proposition s’ensuit très clairement ; car, si une chose qui n’est pas déterminée par Dieu, pouvait se déterminer elle-même, la première partie de la proposition serait fausse, ce qui est absurde comme nous l’avons montré.",
            "english_text": "—That by which things are said to be conditioned to act in a particular manner is necessarily something positive (this is obvious) ; therefore both of its essence and of its existence God by the necessity of his nature is the efficient cause (Props. xxv. and xvi.) ; this is our first point. Our second point is plainly to be inferred therefrom. For if a thing, which has not been conditioned by God, could condition itself, the first part of our proof would be false, and this, as we have shown is absurd."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_27",
      "number": "XXVII",
      "texts": {
        "french_text": "Une chose qui est déterminée par Dieu à produire quelque effet ne peut se rendre elle-même indéterminée.",
        "english_text": ". A thing, which has been conditioned by God to act in a particular way, cannot render itself unconditioned.",
        "latin_text": ": Res quæ a Deo ad aliquid operandum determinata est, se ipsam indeterminatam reddere non potest."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Cela est évident par l’Axiome 3.",
            "english_text": "—This proposition is evident from the third axiom.",
            "latin_text": "Hæc propositio patet ex axiomate tertio."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_28",
      "number": "XXVIII",
      "texts": {
        "french_text": "Une chose singulière quelconque, autrement dit toute chose qui est finie et a une existence déterminée, ne peut exister et être déterminée à produire quelque effet, si elle n’est déterminée à exister et à produire cet effet par une autre cause qui est elle-même finie et a une existence déterminée ; et à son tour cette cause ne peut non plus exister et être déterminée à produire quelque effet, si elle n’est déterminée à exister et à produire cet effet par une autre qui est aussi finie et a une existence déterminée, et ainsi à l’infini.",
        "english_text": ". Every individual thing, or everything which is finite and has a conditioned existence, cannot exist or be conditioned to act, unless it be conditioned for existence and action by a cause other than itself, which also is finite, and has a conditioned existence ; and likewise this cause cannot in its turn exist, or be conditioned to act, unless it be conditioned for existence and action by another cause, which also is finite, and has a conditioned existence, and so on to infinity.",
        "latin_text": ": Quodcunque singulare sive quævis res quæ finita est et determinatam habet existentiam, non potest existere nec ad operandum determinari nisi ad existendum et operandum determinetur ab alia causa quæ etiam finita est et determinatam habet existentiam et rursus hæc causa non potest etiam existere neque ad operandum determinari nisi ab alia quæ etiam finita est et determinatam habet existentiam, determinetur ad existendum et operandum et sic in infinitum."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Tout ce qui est déterminé à exister et à produire quelque effet, est déterminé par Dieu (Prop. 26 et Coroll. de la Prop. 24). Mais ce qui est fini et a une existence déterminée n’a pu être produit par la nature d’un attribut de Dieu prise absolument ; car tout ce qui suit de la nature d’un attribut de Dieu prise absolument est infini et éternel (Prop. 21). Cette chose a donc dû suivre de Dieu ou d’un de ses attributs, en tant qu’on le considère comme affecté d’une certaine modification ; car, en dehors de la substance et des modes, rien n’est donné (Axiome 1, Déf. 3 et 5), et les modes (Coroll. de la Prop. 25) ne sont rien sinon des affections des attributs de Dieu. Mais cette chose n’a pu suivre de Dieu ni d’un de ses attributs en tant qu’il est affecté d’une modification qui est éternelle et infinie (Prop. 22). Elle a donc dû suivre de Dieu ou être déterminée à exister et à produire quelque effet par Dieu ou l’un de ses attributs, en tant qu’il est affecté d’une modification qui est finie et a une existence déterminée. Ce qui était le premier point. Maintenant cette cause, à son tour, ou ce mode (pour la même raison qui a servi à démontrer la première partie) a dû aussi être déterminée par une autre qui est aussi finie et a une existence déterminée, et à son tour cette dernière (pour la même raison) par une autre, et ainsi à l’infini (toujours pour la même raison). C. Q. F. D.",
            "english_text": "—Whatsoever is conditioned to exist and act, has been thus conditioned by God (by Prop. xxvi. and Prop. xxiv., Coroll.).\n\nBut that which is finite, and has a conditioned existence, cannot be produced by the absolute nature of any attribute of God ; for whatsoever follows from the absolute nature of any attribute of God is infinite and eternal (by Prop. xxi.). It must, therefore, follow from some attribute of God, in so far as the said attribute is considered as in some way modified ; for substance and modes make up the sum total of existence (by Ax. i. and Def. iii., v.), while modes are merely modifications of the attributes of God. But from God, or from any of his attributes, in so far as the latter is modified by a modification infinite and eternal, a conditioned thing cannot follow. Wherefore it must follow from, or be conditioned for, existence and action by God or one of his attributes, in so far as the latter are modified by some modification which is finite, and has a conditioned existence. This is our first point. Again, this cause or this modification (for the reason by which we established the first part of this proof) must in its turn be conditioned by another cause, which also is finite, and has a conditioned existence, and, again, this last by another (for the same reason) ; and so on (for the same reason) to infinity. Q.E.D.",
            "latin_text": "Quicquid determinatum est ad existendum et operandum, a Deo sic determinatum est (per propositionem 26 et corollarium propositionis 24). At id quod finitum est et determinatam habet existentiam, ab absoluta natura alicujus Dei attributi produci non potuit; quicquid enim ex absoluta natura alicujus Dei attributi sequitur, id infinitum et æternum est (per propositionem 21). Debuit ergo ex Deo vel aliquo ejus attributo sequi quatenus aliquo modo affectum consideratur; præter enim substantiam et modos nil datur (per axioma 1 et definitionibus 3 et 5) et modi (per corollarium propositionis 25) nihil sunt nisi Dei attributorum affectiones. At ex Deo vel aliquo ejus attributo quatenus affectum est modificatione quæ æterna et infinita est, sequi etiam non potuit (per propositionem 22). Debuit ergo sequi vel ad existendum et operandum determinari a Deo vel aliquo ejus attributo quatenus modificatum est modificatione quæ finita est et determinatam habet existentiam. Quod erat primum. Deinde hæc rursus causa sive hic modus (per eandem rationem qua primam partem hujus jam jam demonstravimus) debuit etiam determinari ab alia quæ etiam finita est et determinatam habet existentiam et rursus hæc ultima (per eandem rationem) ab alia et sic semper (per eandem rationem) in infinitum. Q.E.D."
          }
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "Comme certaines choses ont dû être produites immédiatement par Dieu, à savoir celles qui suivent nécessairement de sa nature considérée absolument, par l’intermédiaire des premières celles qui ne peuvent cependant ni être ni être conçues sans Dieu ; il suit de là : 1o qu’à l’égard des choses immédiatement produites par lui, Dieu est cause prochaine absolument ; mais non en son genre, comme on dit. Car les effets de Dieu ne peuvent ni être ni être conçus sans leur cause (Prop. 15 et Coroll. de la Prop. 24). Il suit : 2o que Dieu ne peut pas être dit proprement cause éloignée des choses singulières, si ce n’est peut-être afin de les distinguer de celles qu’il a produites immédiatement ou plutôt qui suivent de sa nature prise absolument. Car nous entendons par cause éloignée une cause telle qu’elle ne soit en aucune façon liée à son effet. Et tout ce qui est, est en Dieu et dépend de Dieu de telle sorte qu’il ne puisse ni être ni être conçu sans lui.",
            "english_text": "—As certain things must be produced immediately by God, namely those things which necessarily follow from his absolute nature, through the means of these primary attributes, which, nevertheless, can neither exist nor be conceived without God, it follows :—1. That God is absolutely the proximate cause of those things immediately produced by him. I say absolutely, not after his kind, as is usually stated. For the effects of God cannot either exist or be conceived without a cause (Prop. xv. and Prop. xxiv. Coroll.). 2. That God cannot properly be styled the remote cause of individual things, except for the sake of distinguishing these from what he immediately produces, or rather from what follows from his absolute nature. For, by a remote cause, we understand a cause which is in no way conjoined to the effect. But all things which are, are in God, and so depend on God, that without him they can neither be nor be conceived."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_29",
      "number": "XXIX",
      "texts": {
        "french_text": "Il n’est rien donné de contingent dans la nature, mais tout y est déterminé par la nécessité de la nature divine à exister et à produire quelque effet d’une certaine manière.",
        "english_text": ". Nothing in the universe is contingent, but all things are conditioned to exist and operate in a particular manner by the necessity of the divine nature.",
        "latin_text": ": In rerum natura nullum datur contingens sed omnia ex necessitate divinæ naturæ determinata sunt ad certo modo existendum et operandum."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Tout ce qui est, est en Dieu (Proposition 15) et Dieu ne peut pas être dit une chose contingente, car (Prop. 11) il existe nécessairement et non d’une façon contingente. À l’égard des modes de la nature de Dieu, ils ont suivi de cette nature nécessairement aussi, non d’une façon contingente (Prop. 16), et cela aussi bien quand on considère la nature divine absolument (Prop. 21), que lorsqu’on la considère comme déterminée à agir d’une certaine manière (Prop. 27). En outre, Dieu est cause de ces modes non seulement en tant qu’ils existent simplement (Corollaire de la Proposition 24), mais aussi en tant qu’on les considère comme déterminés à produire quelque effet (Prop. 26). Que s’ils ne sont pas déterminés par Dieu, il est impossible mais non contingent qu’ils se déterminent eux-mêmes (même Proposition) ; et si, au contraire, ils sont déterminés par Dieu, il est (Prop. 27) impossible mais non contingent qu’ils se rendent eux-mêmes indéterminés. Donc tout est déterminé par la nécessité de la nature divine, non seulement à exister, mais aussi à exister et à produire quelque effet d’une certaine manière, et il n’y a rien de contingent. C. Q. F. D.",
            "english_text": "—Whatsoever is, is in God (Prop. xv.). But God cannot be called a thing contingent. For (by Prop. xi.) he exists necessarily, and not contingently. Further, the modes of the divine nature follow therefrom necessarily, and not contingently (Prop. xvi.) ; and they thus follow, whether we consider the divine nature absolutely, or whether we consider it as in any way conditioned to act (Prop. xxvii.). Further, God is not only the cause of these modes, in so far as they simply exist (by Prop. xxiv, Coroll.), but also in so far as they are considered as conditioned for operating in a particular manner (Prop. xxvi.). If they be not conditioned by God (Prop. xxvi.), it is impossible, and not contingent, that they should condition themselves ; contrariwise, if they be conditioned by God, it is impossible, and not contingent, that they should render themselves unconditioned. Wherefore all things are conditioned by the necessity of the divine nature, not only to exist, but also to exist and operate in a particular manner, and there is nothing that is contingent. Q.E.D.",
            "latin_text": "Quicquid est in Deo est (per propositionem 15) : Deus autem non potest dici res contingens. Nam (per propositionem 11) necessario, non vero contingenter existit. Modi deinde divinæ naturæ ex eadem etiam necessario, non vero contingenter secuti sunt (per propositionem 16) idque vel quatenus divina natura absolute (per propositionem 21) vel quatenus certo modo ad agendum determinata consideratur (per propositionem 27). Porro horum modorum Deus non tantum est causa quatenus simpliciter existunt (per corollarium propositionis 24) sed etiam (per propositionem 26) quatenus ad aliquid operandum determinati considerantur. Quod si a Deo (per eandem propositionem) determinati non sint, impossibile, non vero contingens est ut se ipsos determinent et contra (per propositionem 27) si a Deo determinati sint, impossibile, non vero contingens est ut se ipsos indeterminatos reddant. Quare omnia ex necessitate divinæ naturæ determinata sunt, non tantum ad existendum sed etiam ad certo modo existendum et operandum nullumque datur contingens. Q.E.D."
          }
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "Avant de poursuivre je veux expliquer ici ce qu’il faut entendre par Nature Naturante et Nature Naturée ou plutôt le faire observer. Car déjà par ce qui précède, il est établi, je pense, qu’on doit entendre par Nature Naturante, ce qui est en soi et est conçu par soi, autrement dit ces attributs de la substance qui expriment une essence éternelle et infinie, ou encore (Coroll. 1 de la Proposition 14 et Coroll. 2 de la Prop. 17) Dieu en tant qu’il est considéré comme cause libre. Par Nature Naturée, j’entends tout ce qui suit de la nécessité de la nature de Dieu, autrement dit de celle de chacun de ses attributs, ou encore tous les modes des attributs de Dieu, en tant qu’on les considère comme des choses qui sont en Dieu et ne peuvent sans Dieu ni être ni être conçues.",
            "english_text": "—Before going any further, I wish here to explain, what we should understand by nature viewed as active (natura naturans), and nature viewed as passive (natura naturata). I say to explain, or rather call attention to it, for I think that, from what has been said, it is sufficiently clear, that by nature viewed as active we should understand that which is in itself, and is conceived through itself, or those attributes of substance, which express eternal and infinite essence, in other words (Prop. xiv., Coroll. i., and Prop. xvii., Coroll. ii) God, in so far as he is considered as a free cause.\n\nBy nature viewed as passive I understand all that which follows from the necessity of the nature of God, or of any of the attributes of God, that is, all the modes of the attributes of God, in so far as they are considered as things which are in God, and which without God cannot exist or be conceived.",
            "latin_text": "Antequam ulterius pergam, hic quid nobis per Naturam naturantem et quid per Naturam naturatam intelligendum sit, explicare volo vel potius monere. Nam ex antecedentibus jam constare existimo nempe quod per Naturam naturantem nobis intelligendum est id quod in se est et per se concipitur sive talia substantiæ attributa quæ æternam et infinitam essentiam exprimunt hoc est (per corollarium I propositionis 14 et corollarium II propositionis 17) Deus quatenus ut causa libera consideratur. Per naturatam autem intelligo id omne quod ex necessitate Dei naturæ sive uniuscujusque Dei attributorum sequitur hoc est omnes Dei attributorum modos quatenus considerantur ut res quæ in Deo sunt et quæ sine Deo nec esse nec concipi possunt."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_30",
      "number": "XXX",
      "texts": {
        "french_text": "Un entendement, actuellement fini ou actuellement infini, doit comprendre les attributs de Dieu et les affections de Dieu et rien autre chose.",
        "english_text": ". Intellect, in function (actu) finite, or in function infinite, must comprehend the attributes of God and the modifications of God, and nothing else.",
        "latin_text": ": Intellectus actu finitus aut actu infinitus Dei attributa Deique affectiones comprehendere debet et nihil aliud."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Une idée vraie doit s’accorder avec l’objet dont elle est l’idée (Axiome 6), c’est-à-dire (comme il est connu de soi), ce qui est contenu objectivement dans l’entendement doit être nécessairement donné dans la nature ; or il n’est donné dans la Nature (Coroll. 1 de la Prop. 14) qu’une substance unique, à savoir Dieu ; et il n’est pas d’autres affections (Prop. 15) que celles qui sont en Dieu et qui (même Prop.) ne peuvent sans Dieu ni être ni être conçues ; donc un entendement, actuellement fini ou actuellement infini, doit comprendre les attributs de Dieu et les affections de Dieu et rien autre chose. C. Q. F. D.",
            "english_text": "—A true idea must agree with its object (Ax. vi.) ; in other words (obviously), that which is contained in the intellect in representation must necessarily be granted in nature. But in nature (by Prop. xiv., Coroll. i.) there is no substance save God, nor any modifications save those (Prop. xv.) which are in God, and cannot without God either be or be conceived. Therefore the intellect, in function finite, or in function infinite, must comprehend the attributes of God and the modifications of God, and nothing else. Q.E.D."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_31",
      "number": "XXXI",
      "texts": {
        "french_text": "L’entendement en acte, qu’il soit fini ou infini, comme aussi la volonté, le désir, l’amour, etc., doivent être rapportés à la Nature Naturée et non à la Naturante.",
        "english_text": ". The intellect in function, whether finite or infinite, as will, desire, love, &c., should be referred to passive nature and not to active nature.",
        "latin_text": ": Intellectus actu sive is finitus sit sive infinitus, ut et voluntas, cupiditas, amor etc. ad Naturam naturatam, non vero ad naturantem referri debent."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Par entendement en effet nous entendons (comme il est connu de soi) non la pensée absolue, mais seulement un certain mode du penser, lequel diffère des autres tels que le désir, l’amour, etc., et doit par conséquent (Déf. 5) être conçu par le moyen de la pensée absolue ; il doit être conçu, dis-je (Prop. 15 et Déf. 6), par le moyen d’un attribut de Dieu exprimant l’essence éternelle et infinie de la pensée, et cela de telle façon qu’il ne puisse sans cet attribut ni être ni être conçu et, pour cette raison (Scolie de la Prop. 29), il doit être rapporté à la Nature Naturée et non à la Naturante, de même que les autres modes du penser. C. Q. F. D.",
            "english_text": "—By the intellect we do not (obviously) mean absolute thought, but only a certain mode of thinking, differing from other modes, such as love, desire, &c., and therefore (Def. v.) requiring to be conceived through absolute thought. It must (by Prop. xv. and Def. vi.), through some attribute of God which expresses the eternal and infinite essence of thought, be so conceived, that without such attribute it could neither be nor be conceived. It must therefore be referred to nature passive rather than to nature active, as must also the other modes of thinking. Q.E.D.",
            "latin_text": "Per intellectum enim (ut per se notum) non intelligimus absolutam cogitationem sed certum tantum modum cogitandi, qui modus ab aliis scilicet cupiditate, amore, etc. differt adeoque (per definitionem 5) per absolutam cogitationem concipi debet nempe (per propositionem 15 et definitionem 6) per aliquod Dei attributum quod æternam et infinitam cogitationis essentiam exprimit, ita concipi debet ut sine ipso nec esse nec concipi possit ac propterea (per scholium propositionis 29) ad Naturam naturatam, non vero naturantem referri debet ut etiam reliqui modi cogitandi. Q.E.D."
          }
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "La raison pour laquelle je parle ici d’un entendement en acte n’est pas que j’accorde l’existence d’aucun entendement en puissance ; mais, désirant éviter toute confusion, je n’ai voulu parler que de la chose la plus clairement perçue par nous, à savoir l’action même de connaître, qui est ce que nous percevons le plus clairement, Car nous ne pouvons rien connaître qui ne conduise à une connaissance plus grande de l’action de connaître,",
            "english_text": "—I do not here, by speaking of intellect in function, admit that there is such a thing as intellect in potentiality : but, wishing to avoid all confusion, I desire to speak only of what is most clearly perceived by us, namely, of the very act of understanding, than which nothing is more clearly perceived. For we cannot perceive anything without adding to our knowledge of the act of understanding.",
            "latin_text": "Ratio cur hic loquar de intellectu actu non est quia concedo ullum dari intellectum potentia sed quia omnem confusionem vitare cupio, nolui loqui nisi de re nobis quam clarissime percepta, de ipsa scilicet intellectione qua nihil nobis clarius percipitur. Nihil enim intelligere possumus quod ad perfectiorem intellectionis cognitionem non conducat."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_32",
      "number": "XXXII",
      "texts": {
        "french_text": "La volonté ne peut être appelée cause libre, mais seulement cause nécessaire.",
        "english_text": "., and, in fact, all those propositions in which I have shown, that everything in nature proceeds from a sort of necessity, and with the utmost perfection. However, I will add a few remarks, in order to overthrow this doctrine of a final cause utterly. That which is really a cause it considers as an effect, and vice versâ : it makes that which is by nature first to be last, and that which is highest and most perfect to be most imperfect. Passing over the questions of cause and priority as self-evident, it is plain from Props. xxi., xxii., xxiii. that the effect is most perfect which is produced immediately by God ; the effect which requires for its production several intermediate causes is, in that respect, more imperfect. But if those things which were made immediately by God were made to enable him to attain his end, then the things which come after, for the sake of which the first were made, are necessarily the most excellent of all.\n\nFurther, this doctrine does away with the perfection of God : for, if God acts for an object, he necessarily desires something which he lacks. Certainly, theologians and metaphysicians draw a distinction between the object of want and the object of assimilation ; still they confess that God made all things for the sake of himself, not for the sake of creation. They are unable to point to anything prior to creation, except God himself, as an object for which God should act, and are therefore driven to admit (as they clearly must), that God lacked those things for whose attainment he created means, and further that he desired them.\n\nWe must not omit to notice that the followers of this doctrine, anxious to display their talent in assigning final causes, have imported a new method of argument in proof of their theory—namely, a reduction, not to the impossible, but to ignorance ; thus showing that they have no other method of exhibiting their doctrine. For example, if a stone falls from a roof on to someone's head, and kills him, they will demonstrate by their new method, that the stone fell in order to kill the man ; for, if it had not by God's will fallen with that object, how could so many circumstances (and there are often many concurrent circumstances) have all happened together by chance? Perhaps you will answer that the event is due to the facts that the wind was blowing, and the man was walking that way. \"But why,\" they will insist, \"was the wind blowing, and why was the man at that very time walking that way?\" If you again answer, that the wind had then sprung up because the sea had begun to be agitated the day before, the weather being previously calm, and that the man had been invited by a friend, they will again insist : \"But why was the sea agitated, and why was the man invited at that time?\" So they will pursue their questions from cause to cause, till at last you take refuge in the will of God—in other words, the sanctuary of ignorance. So, again, when they survey the frame of the human body, they are amazed ; and being ignorant of the causes of so great a work of art, conclude that it has been fashioned, not mechanically, but by divine and supernatural skill, and has been so put together that one part shall not hurt another.\n\nHence anyone who seeks for the true causes of miracles, and strives to understand natural phenomena as an intelligent being, and not to gaze at them like a fool, is set down and denounced as an impious heretic by those, whom the masses adore as the interpreters of nature and the gods. Such persons know that, with the removal of ignorance, the wonder which forms their only available means for proving and preserving their authority would vanish also. But I now quit this subject, and pass on to my third point.\n\nAfter men persuaded themselves, that everything which is created is created for their sake, they were bound to consider as the chief quality in everything that which is most useful to themselves, and to account those things the best of all which have the most beneficial effect on mankind. Further, they were bound to form abstract notions for the explanation of the nature of things, such as goodness, badness, order, confusion, warmth, cold, beauty, deformity, and so on ; and from the belief that they are free agents arose the further notions of praise and blame, sin and merit.\n\nI will speak of these latter hereafter, when I treat of human nature ; the former I will briefly explain here.\n\nEverything which conduces to health and the worship of God they have called good, everything which hinders these objects they have styled bad ; and inasmuch as those who do not understand the nature of things do not verify phenomena in any way, but merely imagine them after a fashion, and mistake their imagination for understanding, such persons firmly believe that there is an order in things, being really ignorant both of things and their own nature. When phenomena are of such a kind, that the impression they make on our senses requires little effort of imagination, and can consequently be easily remembered, we say that they are well-ordered ; if the contrary, that they are ill-ordered or confused. Further, as things which are easily imagined are more pleasing to us, men prefer order to confusion-as though there were any order in nature, except in relation to our imagination—and say that God has created all things in order ; thus, without knowing it, attributing imagination to God, unless, indeed, they would have it that God foresaw human imagination, and arranged everything, so that it should be most easily imagined. If this be their theory, they would not, perhaps, be daunted by the fact that we find an infinite number of phenomena, far surpassing our imagination, and very many others which confound its weakness. But enough has been said on this subject. The other abstract notions are nothing but modes of imagining, in which the imagination is differently affected : though they are considered by the ignorant as the chief attributes of things, inasmuch as they believe that everything was created for the sake of themselves ; and, according as they are affected by it, style it good or bad, healthy or rotten and corrupt. For instance, if the motion which objects we see communicate to our nerves be conducive to health, the objects causing it are styled beautiful ; if a contrary motion be excited, they are styled ugly.\n\nThings which are perceived through our sense of smell are styled fragrant or fetid ; if through our taste, sweet or bitter, full-flavored or insipid ; if through our touch, hard or soft, rough or smooth, &c.\n\nWhatsoever affects our ears is said to give rise to noise, sound, or harmony. In this last case, there are men lunatic enough to believe, that even God himself takes pleasure in harmony ; and philosophers are not lacking who have persuaded themselves, that the motion of the heavenly bodies gives rise to harmony-all of which instances sufficiently show that everyone judges of things according to the state of his brain, or rather mistakes for things the forms of his imagination. We need no longer wonder that there have arisen all the controversies we have witnessed, and finally skepticism : for, although human bodies in many respects agree, yet in very many others they differ ; so that what seems good to one seems bad to another ; what seems well ordered to one seems confused to another ; what is pleasing to one displeases another, and so on. I need not further enumerate, because this is not the place to treat the subject at length, and also because the fact is sufficiently well known. It is commonly said : \"So many men, so many minds ; everyone is wise in his own way ; brains differ as completely as palates.\" All of which proverbs show, that men judge of things according to their mental disposition, and rather imagine than understand : for, if they understood phenomena, they would, as mathematicians attest, be convinced, if not attracted, by what I have urged.\n\nWe have now perceived, that all the explanations commonly given of nature are mere modes of imagining, and do not indicate the true nature of anything, but only the constitution of the imagination ; and, although they have names, as though they were entities, existing externally to the imagination, I call them entities imaginary rather than real ; and, therefore, all arguments against us drawn from such abstractions are easily rebutted.\n\nMany argue in this way. If all things follow from a necessity of the absolutely perfect nature of God, why are there so many imperfections in nature? such, for instance, as things corrupt to the point of putridity, loathsome deformity, confusion, evil, sin, &c. But these reasoners are, as I have said, easily confuted, for the perfection of things is to be reckoned only from their own nature and power ; things are not more or less perfect, according as they delight or offend human senses, or according as they are serviceable or repugnant to mankind. To those who ask why God did not so create all men, that they should be governed only by reason, I give no answer but this : because matter was not lacking to him for the creation of every degree of perfection from highest to lowest ; or, more strictly, because the laws of his nature are so vast, as to suffice for the production of everything conceivable by an infinite intelligence, as I have shown in",
        "latin_text": ": Voluntas non potest vocari causa libera sed tantum necessaria."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "La volonté, de même que l’entendement, est un certain mode du penser ; et ainsi (Prop. 28) chaque volition ne peut exister et être déterminée à produire quelque effet, sinon par une autre cause déterminée, cette cause l’étant à son tour par une autre, et ainsi à l’infini. Que si une volonté est supposée infinie, elle doit aussi être déterminée à exister et à produire quelque effet par Dieu, non, en tant qu’il est une substance absolument infinie, mais en tant qu’il a un attribut qui exprime l’essence absolue et éternelle de la pensée (Prop. 23). De quelque manière donc qu’on la conçoive, une volonté, finie ou infinie, requiert une cause par où elle soit déterminée à exister et à produire quelque effet et ainsi (Défin. 7) ne peut être dite cause libre, mais seulement nécessaire et contrainte. C. Q. F. D."
          }
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit de là : 1o que Dieu ne produit pas ses effets par la liberté de sa volonté.",
            "latin_text": ": Hinc sequitur I° Deum non operari ex libertate voluntatis."
          },
          "number": "I"
        },
        {
          "type": "COROLLAIRE",
          "texts": {
            "french_text": "Il suit : 2o que la volonté et l’entendement soutiennent avec la nature de Dieu la même relation que le mouvement et le repos, et, absolument, toutes les choses de la nature qui (Prop. 29) doivent être déterminées à exister et à agir d’une certaine manière. Car la volonté, comme toutes autres choses, a besoin d’une cause par où elle soit déterminée à exister et à produire quelque effet d’une certaine manière. Et bien que, d’une volonté donnée ou d’un entendement donné, suivent une infinité de choses, on ne peut dire pour cela que Dieu agit par la liberté de sa volonté ; pas plus qu’on ne peut dire, parce que du mouvement et du repos suivent certaines choses (et que ces effets aussi sont innombrables), que Dieu agit par la liberté du mouvement et du repos. La volonté donc n’appartient pas à la nature de Dieu plus que les autres choses de la nature, mais soutient avec lui la même relation que le mouvement et le repos et toutes autres choses, que nous avons montrées qui suivent de la nécessité de la nature divine et sont déterminées par elle à exister et à produire quelque effet d’une certaine manière.",
            "latin_text": ": Sequitur II° voluntatem et intellectum ad Dei naturam ita sese habere ut motus et quies et absolute ut omnia naturalia quæ (per propositionem 29) a Deo ad existendum et operandum certo modo determinari debent. Nam voluntas, ut reliqua omnia, causa indiget a qua ad existendum et operandum certo modo determinetur. Et quamvis ex data voluntate sive intellectu infinita sequantur, non tamen propterea Deus magis dici potest ex libertate voluntatis agere quam propter ea quæ ex motu et quiete sequuntur (infinita enim ex his etiam sequuntur) dici potest ex libertate motus et quietis agere. Quare voluntas ad Dei naturam non magis pertinet quam reliqua naturalia sed ad ipsam eodem modo sese habet ut motus et quies et omnia reliqua quæ ostendimus ex necessitate divinæ naturæ sequi et ab eadem ad existendum et operandum certo modo determinari."
          },
          "number": "II"
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_33",
      "number": "XXXIII",
      "texts": {
        "french_text": "Les choses n’ont pu être produites par Dieu d’aucune manière autre et dans aucun ordre autre, que de la manière et dans l’ordre où elles ont été produites.",
        "english_text": ". Things could not have been brought into being by God in any manner or in any order different from that which has in fact obtained.\nProof—All things necessarily follow from the nature of God (Prop. xvi.), and by the nature of God are conditioned to exist and act in a particular way (Prop. xxix.). If things, therefore, could have been of a different nature, or have been conditioned to act in a different way, so that the order of nature would have been different, God's nature would also have been able to be different from what it now is ; and therefore (by Prop. xi.) that different nature also would have perforce existed, and consequently there would have been able to be two or more Gods. This (by Prop. xiv., Coroll. i.) is absurd. Therefore things could not have been brought into being by God in any other manner, &c. Q.E.D.",
        "latin_text": ": Res nullo alio modo neque alio ordine a Deo produci potuerunt quam productæ sunt."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Toutes choses ont suivi nécessairement de la nature de Dieu supposée donnée (Prop. 16), et ont été déterminées par la nécessité de la nature de Dieu à exister et à produire quelque effet d’une certaine manière (Prop. 29). Si donc des choses d’une nature différente avaient pu être, ou être déterminées à produire quelque effet d’une autre manière, de façon que l’ordre de la nature fût autre, Dieu pourrait être aussi d’une nature autre, et par suite (Prop. 11) cette autre nature aussi devrait exister, et il pourrait y avoir en conséquence deux ou plusieurs Dieux, ce qui (Coroll. 1 de la Prop. 14) est absurde. Pour cette raison les choses n’ont pu être d’une manière autre et dans un ordre autre, etc. C. Q. F. D.",
            "latin_text": "Res enim omnes ex data Dei natura necessario sequutæ sunt (per propositionem 16) et ex necessitate naturæ Dei determinatæ sunt ad certo modo existendum et operandum (per propositionem 29). Si itaque res alterius naturæ potuissent esse vel alio modo ad operandum determinari ut naturæ ordo alius esset, ergo Dei etiam natura alia posset esse quam jam est ac proinde (per propositionem 11) illa etiam deberet existere et consequenter duo vel plures possent dari Dii, quod (per corollarium I propositionis 14) est absurdum. Quapropter res nullo alio modo neque alio ordine etc. Q.E.D."
          }
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "Ayant montré par ce qui précède, plus clairement que la lumière du jour, qu’il n’existe absolument rien dans les choses, à cause de quoi elles puissent être dites contingentes, je veux maintenant expliquer en quelques mots ce que nous devons entendre par Contingent, et d’abord ce que nous devons entendre par Nécessaire et Impossible, Une chose est dite nécessaire soit par rapport à son essence, soit par rapport à sa cause. Car l’existence d’une chose suit nécessairement ou bien de son essence et de sa définition ou bien d’une cause efficiente donnée. C’est pour les mêmes causes qu’une chose est dite impossible ; ou bien en effet c’est parce que son essence ou définition enveloppe une contradiction, ou bien parce que nulle cause extérieure n’est donnée, qui soit déterminée de façon à produire cette chose. Pour nulle autre cause maintenant une chose n’est dite contingente, sinon eu égard à un manque de connaissance en nous ; car une chose dont nous ignorons que l’essence enveloppe contradiction, ou de laquelle nous savons bien qu’elle n’enveloppe aucune contradiction, sans pouvoir rien affirmer avec certitude de son existence, parce que nous ignorons l’ordre des causes, une telle chose, dis-je, ne peut jamais nous apparaître ni comme nécessaire ni comme impossible et, par suite, nous l’appelons contingente ou possible.",
            "english_text": "—As I have thus shown, more clearly than the sun at noonday, that there is nothing to justify us in calling things contingent, I wish to explain briefly what meaning we shall attach to the word contingent ; but I will first explain the words necessary and impossible.\n\nA thing is called necessary either in respect to its essence or in respect to its cause ; for the existence of a thing necessarily follows, either from its essence and definition, or from a given efficient cause. For similar reasons a thing is said to be impossible ; namely, inasmuch as its essence or definition involves a contradiction, or because no external cause is granted, which is conditioned to produce such an effect ; but a thing can in no respect be called contingent, save in relation to the imperfection of our knowledge.\n\nA thing of which we do not know whether the essence does or does not involve a contradiction, or of which, knowing that it does not involve a contradiction, we are still in doubt concerning the existence, because the order of causes escapes us,-such a thing, I say, cannot appear to us either necessary or impossible. Wherefore we call it contingent or possible.",
            "latin_text": ": Quoniam his luce meridiana clarius ostendi nihil absolute in rebus dari propter quod contingentes dicantur, explicare jam paucis volo quid nobis per contingens erit intelligendum sed prius quid per necessarium et impossibile. Res aliqua necessaria dicitur vel ratione suæ essentiæ vel ratione causæ. Rei enim alicujus existentia vel ex ipsius essentia et definitione vel ex data causa efficiente necessario sequitur. Deinde his etiam de causis res aliqua impossibilis dicitur; nimirum quia vel ipsius essentia seu definitio contradictionem involvit vel quia nulla causa externa datur ad talem rem producendam determinata. At res aliqua nulla alia de causa contingens dicitur nisi respectu defectus nostræ cognitionis. Res enim cujus essentiam contradictionem involvere ignoramus vel de qua probe scimus eandem nullam contradictionem involvere et tamen de ipsius existentia nihil certo affirmare possumus propterea quod ordo causarum nos latet, ea nunquam nec ut necessaria nec ut impossibilis videri nobis potest ideoque eandem vel contingentem vel possibilem vocamus."
          },
          "number": "I"
        },
        {
          "type": "SCOLIE",
          "texts": {
            "french_text": "Il suit clairement de ce qui précède que les choses ont été produites par Dieu avec une souveraine perfection, puisqu’elles ont suivi nécessairement d’une nature donnée qui est parfaite au plus haut point. Et nulle imperfection n’est par là imputée à Dieu ; car c’est sa perfection même qui nous a contraints à l’affirmer. Bien mieux, c’est de l’affirmation contraire qu’il suivrait (je viens de le montrer) que Dieu n’est pas souverainement parfait ; car, si les choses avaient été produites d’une autre manière, il faudrait attribuer à Dieu une autre nature, différente de celle que la considération de l’Être parfait au plus haut point nous oblige à lui attribuer. Mais je ne doute pas que beaucoup ne repoussent d’abord cette manière de voir comme une chose absurde et ne consentent même pas à l’examiner ; et cela pour cette seule raison qu’ils ont accoutumé d’attribuer à Dieu une liberté de tout autre sorte que celle que nous avons définie (Déf. 7), à savoir une volonté absolue. Et je ne doute pas non plus que, s’ils veulent méditer sur ce sujet et examiner loyalement la suite de mes démonstrations, ils ne rejettent entièrement non seulement comme une chose futile, mais comme un grand empêchement à la science, cette sorte de liberté qu’ils attribuent à Dieu. Il n’est pas besoin ici de répéter ce que j’ai dit dans le Scolie de la Proposition 17. En leur faveur cependant, je montrerai encore que, même en accordant que la volonté appartient à l’essence de Dieu, il ne suit pas moins de sa perfection que les choses n’ont pu être créées par Dieu d’aucune autre manière et dans aucun autre ordre. Il sera facile de le montrer si nous avons égard en premier lieu à ce qu’eux-mêmes concèdent, à savoir, qu’il dépend du seul décret et de la seule volonté de Dieu que chaque chose qui est, soit ce qu’elle est. S’il en était autrement en effet, Dieu ne serait pas cause de toutes choses. En second lieu, ils accordent aussi que tous les décrets de Dieu ont été arrêtés par Dieu même de toute éternité. S’il en était autrement, de l’imperfection et de l’inconstance seraient imputées à Dieu. Dans l’éternité il n’y a d’ailleurs ni quand, ni avant, ni après ; il suit donc de là, c’est-à-dire de la seule perfection de Dieu, que Dieu ne peut ni n’a pu jamais décréter autre chose ; en d’autres termes que Dieu n’existe pas antérieurement à ses décrets et ne peut exister sans eux. Mais, diront-ils, quand même on supposerait que Dieu eût fait une autre nature des choses, ou qu’il eût de toute éternité décrété autre chose sur la Nature et sur son ordre, il ne s’ensuivrait en Dieu aucune imperfection. Je réponds qu’en disant cela, ils accordent que Dieu peut changer ses décrets. Car, si Dieu avait décrété sur la Nature et sur son ordre autre chose, que ce qu’il a décrété ; c’est-à-dire s’il avait, au sujet de la Nature, voulu et conçu autre chose, il aurait eu nécessairement un entendement autre que n’est actuellement le sien et une volonté autre que n’est actuellement la sienne. Et, s’il est permis d’attribuer à Dieu un autre entendement et une autre volonté, sans pour cela rien changer à son essence et à sa perfection, pour quelle cause ne pourrait-il actuellement changer ses décrets au sujet des choses créées, tout en restant également parfait ? Car, de quelque façon qu’on les conçoive, son entendement et sa volonté concernant les choses créées, soutiennent toujours le même rapport avec son essence et sa perfection. D’autre part, tous les Philosophes, à ma connaissance, accordent qu’il n’existe pas en Dieu, d’entendement en puissance mais seulement un entendement en acte ; puis donc que son entendement et sa volonté ne se distinguent pas de son essence, ainsi que tous aussi l’accordent, il suit de là encore que, si Dieu avait eu un autre entendement en acte et une autre volonté, son essence aussi eût été nécessairement autre ; et par suite (comme je l’ai d’abord conclu), si les choses eussent été produites par Dieu autrement qu’elles ne sont actuellement, l’entendement de Dieu et sa volonté, c’est-à-dire (comme on l’accorde) son essence, devraient être autres, ce qui est absurde.\n\nPuis donc que les choses n’ont pu être produites par Dieu d’aucune autre manière et dans aucun autre ordre, et que la vérité de cette proposition est une conséquence de la souveraine perfection de Dieu, nous ne nous laisserons certes jamais persuader par aucune raison que Dieu n’a pas voulu créer toutes les choses dont son entendement a l’idée avec autant de perfection qu’il s’en trouve dans les idées. On objectera qu’il n’y a dans les choses ni perfection ni imperfection, ce pour quoi elles sont dites parfaites ou imparfaites et bonnes ou mauvaises, dépendant uniquement de la volonté de Dieu ; d’où suit que, si Dieu l’eût voulu, il eût pu faire que ce qui est actuellement perfection fût une extrême imperfection et vice versa. Mais qu’est-ce donc autre chose qu’affirmer ouvertement que Dieu, qui a nécessairement l’idée de ce qu’il veut, peut, par sa volonté, faire qu’il ait des choses une idée autre que celle qu’il en a ; ce qui (je viens de le montrer) est une grande absurdité. Je puis donc retourner contre eux leur argument et cela de la façon suivante. Toutes choses dépendent de la puissance de Dieu. Pour que les choses pussent être autrement qu’elles ne sont, il faudrait donc nécessairement aussi que la volonté de Dieu fût autre ; or la volonté de Dieu ne peut pas être autre (comme nous venons de montrer qu’il suit de la perfection de Dieu avec la dernière évidence). Donc les choses aussi ne peuvent pas être autrement. Je reconnais que cette opinion, qui soumet tout à une volonté divine indifférente, et admet que tout dépend de son bon plaisir, s’éloigne moins de la vérité que cette autre consistant à admettre que Dieu agit en tout en ayant égard au bien. Car ceux qui la soutiennent, semblent poser en dehors de Dieu quelque chose qui ne dépend pas de Dieu, et à quoi Dieu a égard comme à un modèle dans ses opérations, ou a quoi il tende comme vers un but déterminé. Cela revient à soumettre Dieu au destin, et rien de plus absurde ne peut être admis au sujet de Dieu, que nous avons montré qui est la cause première et l’unique cause libre tant de l’essence de toutes choses que de leur existence. Il n’y a donc pas de raison pour perdre du temps à réfuter cette absurdité.",
            "english_text": "—It clearly follows from what we have said, that things have been brought into being by God in the highest perfection, inasmuch as they have necessarily followed from a most perfect nature. Nor does this prove any imperfection in God, for it has compelled us to affirm his perfection. From its contrary proposition, we should clearly gather (as I have just shown), that God is not supremely perfect, for if things had been brought into being in any other way, we should have to assign to God a nature different from that, which we are bound to attribute to him from the consideration of an absolutely perfect being.\n\nI do not doubt, that many will scout this idea as absurd, and will refuse to give their minds up to contemplating it, simply because they are accustomed to assign to God a freedom very different from that which we (Def. vii.) have deduced. They assign to him, in short, absolute free will. However, I am also convinced that if such persons reflect on the matter, and duly weigh in their minds our series of propositions, they will reject such freedom as they now attribute to God, not only as nugatory, but also as a great impediment to organized knowledge. There is no need for me to repeat what I have said in the note to",
            "latin_text": ": Ex præcedentibus clare sequitur res summa perfectione a Deo fuisse productas quandoquidem ex data perfectissima natura necessario secutæ sunt. Neque hoc Deum ullius arguit imperfectionis; ipsius enim perfectio hoc nos affirmare coegit. Imo ex hujus contrario clare sequeretur (ut modo ostendi) Deum non esse summe perfectum; nimirum quia si res alio modo fuissent productæ, Deo alia natura esset tribuenda, diversa ab ea quam ex consideratione Entis perfectissimi coacti sumus ei tribuere. Verum non dubito quin multi hanc sententiam ut absurdam explodant nec animum ad eandem perpendendam instituere velint idque nulla alia de causa quam quia Deo aliam libertatem assueti sunt tribuere, longe diversam ab illa quæ a nobis (definitione 7) tradita est videlicet absolutam voluntatem. Verum neque etiam dubito si rem meditari vellent nostrarumque demonstrationum seriem recte secum perpendere, quin tandem talem libertatem qualem jam Deo tribuunt, non tantum ut nugatoriam sed ut magnum scientiæ obstaculum plane rejiciant. Nec opus est ut ea quæ in scholio propositionis 17 dicta sunt, hic repetam. Attamen in eorum gratiam adhuc ostendam quod quamvis concedatur voluntatem ad Dei essentiam pertinere, ex ejus perfectione nihilominus sequatur res nullo alio potuisse modo neque ordine a Deo creari; quod facile erit ostendere si prius consideremus id quod ipsimet concedunt videlicet ex solo Dei decreto et voluntate pendere ut unaquæque res id quod est sit. Nam alias Deus omnium rerum causa non esset. Deinde quod omnia decreta ab æterno ab ipso Deo sancita fuerunt. Nam alias imperfectionis et inconstantiæ argueretur. At cum in æterno non detur quando, ante nec post, hinc ex sola scilicet Dei perfectione sequitur Deum aliud decernere nunquam posse nec unquam potuisse sive Deum ante sua decreta non fuisse nec sine ipsis esse posse. At dicent quod quamvis supponeretur quod Deus aliam rerum naturam fecisset vel quod ab æterno aliud de natura ejusque ordine decrevisset, nulla inde in Deo sequeretur imperfectio. Verum si hoc dicant, concedent simul Deum posse sua mutare decreta. Nam si Deus de natura ejusque ordine aliud quam decrevit decrevisset hoc est ut aliud de natura voluisset et concepisset, alium necessario quam jam habet intellectum et aliam quam jam habet voluntatem habuisset. Et si Deo alium intellectum aliamque voluntatem tribuere licet absque ulla ejus essentiæ ejusque perfectionis mutatione, quid causæ est cur jam non possit sua de rebus creatis decreta mutare et nihilominus æque perfectus manere? Ejus enim intellectus et voluntas circa res creatas et earum ordinem in respectu suæ essentiæ et perfectionis perinde est, quomodocunque concipiatur. Deinde omnes quos vidi philosophi concedunt nullum in Deo dari intellectum potentia sed tantum actu; cum autem et ejus intellectus et ejus voluntas ab ejusdem essentia non distinguantur ut etiam omnes concedunt, sequitur ergo hinc etiam quod si Deus alium intellectum actu habuisset et aliam voluntatem, ejus etiam essentia alia necessario esset ac proinde (ut a principio conclusi) si aliter res quam jam sunt, a Deo productæ essent, Dei intellectus ejusque voluntas hoc est (ut conceditur) ejus essentia alia esse deberet, quod est absurdum.\n\nCum itaque res nullo alio modo nec ordine a Deo produci potuerint et hoc verum esse ex summa Dei perfectione sequatur, nulla profecto sana ratio persuadere nobis potest ut credamus quod Deus noluerit omnia quæ in suo intellectu sunt, eadem illa perfectione qua ipsa intelligit, creare. At dicent in rebus nullam esse perfectionem neque imperfectionem sed id quod in ipsis est propter quod perfectæ sunt aut imperfectæ et bonæ aut malæ dicuntur, a Dei tantum voluntate pendere atque adeo si Deus voluisset, potuisset efficere ut id quod jam perfectio est, summa esset imperfectio et contra. Verum quid hoc aliud esset quam aperte affirmare quod Deus qui id quod vult necessario intelligit, sua voluntate efficere potest ut res alio modo quam intelligit, intelligat, quod (ut modo ostendi) magnum est absurdum. Quare argumentum in ipsos retorquere possum hoc modo. Omnia a Dei potestate pendent. Ut res itaque aliter se habere possint, Dei necessario voluntas aliter se habere etiam deberet; atqui Dei voluntas aliter se habere nequit (ut modo ex Dei perfectione evidentissime ostendimus). Ergo neque res aliter se habere possunt. Fateor hanc opinionem quæ omnia indifferenti cuidam Dei voluntati subjicit et ab ipsius beneplacito omnia pendere statuit, minus a vero aberrare quam illorum qui statuunt Deum omnia sub ratione boni agere. Nam hi aliquid extra Deum videntur ponere quod a Deo non dependet, ad quod Deus tanquam ad exemplar in operando attendit vel ad quod tanquam ad certum scopum collineat. Quod profecto nihil aliud est quam Deum fato subjicere, quo nihil de Deo absurdius statui potest, quem ostendimus tam omnium rerum essentiæ quam earum existentiæ primam et unicam liberam causam esse. Quare non est ut in hoc absurdo refutando tempus consumam."
          },
          "number": "II"
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_34",
      "number": "XXXIV",
      "texts": {
        "french_text": "La puissance de Dieu est son essence même.",
        "english_text": ". God's power is identical with his essence.",
        "latin_text": ": Dei potentia est ipsa ipsius essentia."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Il suit de la seule nécessité de l’essence de Dieu que Dieu est cause de soi (Prop. 11) et (Prop. 16 avec son Coroll.) de toutes choses. Donc la puissance de Dieu par laquelle lui-même et toutes choses sont et agissent est son essence même. C. Q. F. D.",
            "english_text": "—From the sole necessity of the essence of God it follows that God is the cause of himself (Prop. xi.) and of all things (Prop. xvi. and Coroll.). Wherefore the power of God, by which he and all things are and act, is identical with his essence. Q.E.D.",
            "latin_text": "Ex sola enim necessitate Dei essentiæ sequitur Deum esse causam sui (per propositionem 11) et (per propositionem 16 ejusque corollarium) omnium rerum. Ergo potentia Dei qua ipse et omnia sunt et agunt, est ipsa ipsius essentia. Q.E.D."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_35",
      "number": "XXXV",
      "texts": {
        "french_text": "Tout ce que nous concevons qui est au pouvoir de Dieu, est nécessairement.",
        "english_text": ". Whatsoever we conceive to be in the power of God, necessarily exists.",
        "latin_text": ": Quicquid concipimus in Dei potestate esse, id necessario est."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Tout ce qui est au pouvoir de Dieu doit (Prop. précédente) être compris en telle sorte en son essence qu’il en suive nécessairement, et par suite est nécessairement. C. Q. F. D.",
            "english_text": "—Whatsoever is in God's power, must (by the last Prop.) be comprehended in his essence in such a manner, that it necessarily follows therefrom, and therefore necessarily exists. Q.E.D.",
            "latin_text": "Quicquid enim in Dei potestate est, id (per propositionem præcedentem) in ejus essentia ita debet comprehendi ut ex ea necessario sequatur adeoque necessario est. Q.E.D."
          }
        }
      ]
    },
    {
      "type": "PROPOSITION",
      "normalized_key": "I_Prop_36",
      "number": "XXXVI",
      "texts": {
        "french_text": "Rien n’existe de la nature de quoi ne suive quelque effet.",
        "english_text": ". There is no cause from whose nature some effect does not follow.",
        "latin_text": ": Nihil existit ex cujus natura aliquis effectus non sequatur."
      },
      "components": [
        {
          "type": "DEMONSTRATION",
          "texts": {
            "french_text": "Tout ce qui existe, exprime en un mode certain et déterminé la nature ou l’essence de Dieu (Coroll. de la Prop. 25), autrement dit (Prop. 34) tout ce qui existe exprime en un mode certain et déterminé la puissance de Dieu qui est cause de toutes choses, et par suite (Propos. 16) quelque effet en doit suivre. C. Q. F. D.",
            "english_text": "—Whatsoever exists expresses God's nature or essence in a given conditioned manner (by Prop. xxv., Coroll.) ; that is, (by Prop. xxxiv.), whatsoever exists, expresses in a given conditioned manner God's power, which is the cause of all things, therefore an effect must (by Prop. xvi.) necessarily follow. Q.E.D.\n\n\n\nAppendix\nIn the foregoing I have explained the nature and properties of God. I have shown that he necessarily exists, that he is one : that he is, and acts solely by the necessity of his own nature ; that he is the free cause of all things, and how he is so ; that all things are in God, and so depend on him, that without him they could neither exist nor be conceived ; lastly, that all things are predetermined by God, not through his free will or absolute fiat, but from the very nature of God or infinite power. I have further, where occasion afforded, taken care to remove the prejudices, which might impede the comprehension of my demonstrations. Yet there still remain misconceptions not a few, which might and may prove very grave hindrances to the understanding of the concatenation of things, as I have explained it above. I have therefore thought it worth while to bring these misconceptions before the bar of reason.\n\nAll such opinions spring from the notion commonly entertained, that all things in nature act as men themselves act, namely, with an end in view. It is accepted as certain, that God himself directs all things to a definite goal (for it is said that God made all things for man, and man that he might worship him). I will, therefore, consider this opinion, asking first, why it obtains general credence, and why all men are naturally so prone to adopt it? secondly, I will point out its falsity ; and, lastly, I will show how it has given rise to prejudices about good and bad, right and wrong, praise and blame, order and confusion, beauty and ugliness, and the like. However, this is not the place to deduce these misconceptions from the nature of the human mind : it will be sufficient here, if I assume as a starting point, what ought to be universally admitted, namely, that all men are born ignorant of the causes of things, that all have the desire to seek for what is useful to them, and that they are conscious of such desire. Herefrom it follows, first, that men think themselves free inasmuch as they are conscious of their volitions and desires, and never even dream, in their ignorance, of the causes which have disposed them so to wish and desire. Secondly, that men do all things for an end, namely, for that which is useful to them, and which they seek. Thus it comes to pass that they only look for a knowledge of the final causes of events, and when these are learned, they are content, as having no cause for further doubt. If they cannot learn such causes from external sources, they are compelled to turn to considering themselves, and reflecting what end would have induced them personally to bring about the given event, and thus they necessarily judge other natures by their own. Further, as they find in themselves and outside themselves many means which assist them not a little in the search for what is useful, for instance, eyes for seeing, teeth for chewing, herbs and animals for yielding food, the sun for giving light, the sea for breeding fish, &c., they come to look on the whole of nature as a means for obtaining such conveniences. Now as they are aware, that they found these conveniences and did not make them, they think they have cause for believing, that some other being has made them for their use. As they look upon things as means, they cannot believe them to be self-created ; but, judging from the means which they are accustomed to prepare for themselves, they are bound to believe in some ruler or rulers of the universe endowed with human freedom, who have arranged and adapted everything for human use. They are bound to estimate the nature of such rulers (having no information on the subject) in accordance with their own nature, and therefore they assert that the gods ordained everything for the use of man, in order to bind man to themselves and obtain from him the highest honor. Hence also it follows, that everyone thought out for himself, according to his abilities, a different way of worshipping God, so that God might love him more than his fellows, and direct the whole course of nature for the satisfaction of his blind cupidity and insatiable avarice. Thus the prejudice developed into superstition, and took deep root in the human mind ; and for this reason everyone strove most zealously to understand and explain the final causes of things ; but in their endeavor to show that nature does nothing in vain, i.e. nothing which is useless to man, they only seem to have demonstrated that nature, the gods, and men are all mad together. Consider, I pray you, the result : among the many helps of nature they were bound to find some hindrances, such as storms, earthquakes, diseases, &c. : so they declared that such things happen, because the gods are angry at some wrong done to them by men, or at some fault committed in their worship. Experience day by day protested and showed by infinite examples, that good and evil fortunes fall to the lot of pious and impious alike ; still they would not abandon their inveterate prejudice, for it was more easy for them to class such contradictions among other unknown things of whose use they were ignorant, and thus to retain their actual and innate condition of ignorance, than to destroy the whole fabric of their reasoning and start afresh. They therefore laid down as an axiom, that God's judgments far transcend human understanding. Such a doctrine might well have sufficed to conceal the truth from the human race for all eternity, if mathematics had not furnished another standard of verity in considering solely the essence and properties of figures without regard to their final causes. There are other reasons (which I need not mention here) besides mathematics, which might have caused men's minds to be directed to these general prejudices, and have led them to the knowledge of the truth.\n\nI have now sufficiently explained my first point. There is no need to show at length, that nature has no particular goal in view, and that final causes are mere human figments. This, I think, is already evident enough, both from the causes and foundations on which I have shown such prejudice to be based, and also from",
            "latin_text": "Quicquid existit, Dei naturam sive essentiam certo et determinato modo exprimit (per corollarium propositionis 25) hoc est (per propositionem 34) quicquid existit, Dei potentiam quæ omnium rerum causa est, certo et determinato modo exprimit adeoque (per propositionem 16) ex eo aliquis effectus sequi debet. Q.E.D."
          }
        }
      ]
    },
    {
      "type": "APPENDICE",
      "normalized_key": "I_App",
      "texts": {
        "french_text": "J’ai expliqué dans ce qui précède la nature de Dieu et ses propriétés, savoir : qu’il existe nécessairement ; qu’il est unique ; qu’il est et agit par la seule nécessité de sa nature ; qu’il est la cause libre de toute choses, et en quelle manière il l’est ; que tout est en Dieu et dépend de lui de telle sorte que rien ne peut ni être ni être conçu sans lui ; enfin que tout a été prédéterminé par Dieu, non certes par la liberté de sa volonté, autrement dit par son bon plaisir absolu, mais par la nature absolue de Dieu, c’est-à-dire sa puissance infinie. J’ai eu soin en outre, partout où j’en ai eu l’occasion, d’écarter les préjugés qui pouvaient empêcher que mes démonstrations ne fussent perçues ; comme, toutefois, il en reste encore beaucoup qui pouvaient et peuvent aussi, et même au plus haut point, empêcher les hommes de saisir l’enchaînement des choses de la façon que je l’ai exposé, j’ai cru qu’il valait la peine de soumettre ici ces préjugés à l’examen de la raison. Tous ceux que j’entreprends de signaler ici dépendent d’ailleurs d’un seul, consistant en ce que les hommes supposent communément que toutes les choses de la nature agissent, comme eux-mêmes, en vue d’une fin, et vont jusqu’à tenir pour certain que Dieu lui-même dirige tout vers une certaine fin ; ils disent, en effet, que Dieu a tout fait en vue de l’homme et qu’il a fait l’homme pour que l’homme lui rendît un culte. C’est donc ce préjugé seul que je considérerai d’abord cherchant primo pour quelle cause la plupart s’y tiennent et pourquoi tous inclinent naturellement à l’embrasser. En second lieu j’en montrerai la fausseté, et pour finir je ferai voir comment en sont issus les préjugés relatifs au bien et au mal, au mérite et au péché, à la louange et au blâme, à l’ordre et à la confusion, à la beauté et à la laideur, et à d’autres objets de même sorte. Il n’appartient pas toutefois à mon objet présent de déduire cela de la nature de l’âme humaine. Il suffira pour le moment de poser en principe ce que tous doivent reconnaître : que tous les hommes naissent sans aucune connaissance des causes des choses, et que tous ont un appétit de rechercher ce qui leur est utile, et qu’ils en ont conscience. De là suit : 1o que les hommes se figurent être libres, parce qu’ils ont conscience de leurs volitions et de leur appétit et ne pensent pas, même en rêve, aux causes par lesquelles ils sont disposés à appéter et à vouloir, n’en ayant aucune connaissance. Il suit : 2o que les hommes agissent toujours en vue d’une fin, savoir l’utile qu’ils appètent. D’où résulte qu’ils s’efforcent toujours uniquement à connaître les causes finales des choses accomplies et se tiennent en repos quand ils en sont informés, n’ayant plus aucune raison d’inquiétude. S’ils ne peuvent les apprendre d’un autre, leur seule ressource est de se rabattre sur eux-mêmes et de réfléchir aux fins par lesquelles ils ont coutume d’être déterminés à des actions semblables, et ainsi jugent-ils nécessairement de la complexion d’autrui par la leur. Comme, en outre, ils trouvent en eux-mêmes et hors d’eux un grand nombre de moyens contribuant grandement à l’atteinte de l’utile, ainsi, par exemple, des yeux pour voir, des dents pour mâcher, des herbes et des animaux pour l’alimentation, le soleil pour s’éclairer, la mer pour nourrir des poissons, ils en viennent à considérer toutes les choses existant dans la Nature comme des moyens à leur usage. Sachant d’ailleurs qu’ils ont trouvé ces moyens, mais ne les ont pas procurés, ils ont tiré de là un motif de croire qu’il y a quelqu’un d’autre qui les a procurés pour qu’ils en fissent usage. Ils n’ont pu, en effet, après avoir considéré les choses comme des moyens, croire qu’elles se sont faites elles-mêmes, mais, tirant leur conclusion des moyens qu’ils ont accoutumé de se procurer, ils ont dû se persuader qu’il existait un ou plusieurs directeurs de la nature, doués de la liberté humaine, ayant pourvu à tous leurs besoins et tout fait pour leur usage. N’ayant jamais reçu au sujet de la complexion de ces êtres aucune information, ils ont dû aussi en juger d’après la leur propre, et ainsi ont-ils admis que les Dieux dirigent toutes choses pour l’usage des hommes afin de se les attacher et d’être tenus par eux dans le plus grand honneur ; par où il advint que tous, se référant à leur propre complexion, inventèrent divers moyens de rendre un culte à Dieu afin d’être aimés par lui par-dessus les autres, et d’obtenir qu’il dirigeât la Nature entière au profit de leur désir aveugle et de leur insatiable avidité. De la sorte, ce préjugé se tourna en superstition et poussa de profondes racines dans les âmes ; ce qui fut pour tous un motif de s’appliquer de tout leur effort à la connaissance et à l’explication des causes finales de toutes choses. Mais, tandis qu’ils cherchaient à montrer que la Nature ne fait rien en vain (c’est-à-dire rien qui ne soit pour l’usage des hommes), ils semblent n’avoir montré rien d’autre sinon que la Nature et les Dieux sont atteints du même délire que les hommes. Considérez, je vous le demande, où les choses en sont enfin venues ! Parmi tant de choses utiles offertes par la Nature, ils n’ont pu manquer de trouver bon nombre de choses nuisibles, telles les tempêtes, les tremblements de terre, les maladies, etc., et ils ont admis que de telles rencontres avaient pour origine la colère de Dieu excitée par les offenses des hommes envers lui ou par les péchés commis dans son culte ; et, en dépit des protestations de l’expérience quotidienne, montrant par des exemples sans nombre que les rencontres utiles et les nuisibles échoient sans distinction aux pieux et aux impies, ils n’ont pas pour cela renoncé à ce préjugé invétéré. Ils ont trouvé plus expédient de mettre ce fait au nombre des choses inconnues dont ils ignoraient l’usage, et de demeurer dans leur état actuel et natif d’ignorance, que de renverser tout cet échafaudage et d’en inventer un autre. Ils ont donc admis comme certain que les jugements de Dieu passent de bien loin la compréhension des hommes : cette seule cause certes eût pu faire, que le genre humain fût à jamais ignorant de la vérité, si la mathématique, occupée non des fins mais seulement des essences et des propriétés des figures, n’avait fait luire devant les hommes une autre norme de vérité ; outre la mathématique on peut assigner, d’autres causes encore (qu’il est superflu d’énumérer ici) par lesquelles il a pu arriver que les hommes aperçussent ces préjugés communs, et fussent conduits à la connaissance vraie des choses.\n\nJ’ai assez expliqué par là ce que j’ai promis en premier lieu. Pour montrer maintenant que la Nature n’a aucune fin à elle prescrite et que toutes les causes finales ne sont rien que des fictions des hommes, il ne sera pas besoin de longs discours. Je crois en effet l’avoir déjà suffisamment établi, tant en montrant de quels principes et de quelles causes ce préjugé tire son origine que par la Proposition 16 et les Corollaires de la Proposition 32, et en outre par tout ce que j’ai dit qui prouve que tout dans la nature se produit avec une nécessité éternelle et une perfection suprême. J’ajouterai cependant ceci : que cette doctrine finaliste renverse totalement la Nature. Car elle considère comme effet ce qui, en réalité, est cause, et vice versa. En outre, elle met après ce qui de nature est avant. Enfin elle rend très imparfait ce qui est le plus élevé et le plus parfait. Pour laisser de côté les deux premiers points (qui sont évidents par eux-mêmes), cet effet, comme il est établi par les Propositions 21, 22 et 23, est le plus parfait, qui est produit par Dieu immédiatement et, plus une chose a besoin pour être produite de causes intermédiaires, plus elle est imparfaite. Mais, si les choses immédiatement produites par Dieu avaient été faites pour que Dieu pût atteindre sa fin, alors nécessairement les dernières, à cause desquelles les premières eussent été faites, seraient de toutes les plus excellentes. En outre, cette doctrine détruit la perfection de Dieu ; car, si Dieu agit pour une fin, il appète nécessairement quelque chose de quoi il est privé. Et bien que Théologiens et Métaphysiciens distinguent entre une fin de besoin et une fin d’assimilation, ils conviennent cependant que Dieu a tout fait pour lui-même et non pour les choses à créer ; car ils ne peuvent en dehors de Dieu rien assigner qui fût avant la création et à cause de quoi Dieu eût agi ; ils sont donc contraints aussi de reconnaître que Dieu était privé de tout ce pour quoi il a voulu procurer des moyens et le désirait, comme il est clair de soi, Et il ne faut pas oublier ici que les sectateurs de cette doctrine, qui ont voulu faire montre de leur talent en assignant les fins des choses, ont, pour soutenir leur doctrine, introduit une nouvelle façon d’argumenter, la réduction non à l’impossible, mais à l’ignorance ; ce qui montre qu’il n’y avait pour eux aucun autre moyen d’argumenter. Si, par exemple, une pierre est tombée d’un toit sur la tête de quelqu’un et l’a tué, ils démontreront de la manière suivante que la pierre est tombée pour tuer cet homme. Si elle n’est pas tombée à cette fin par la volonté de Dieu, comment tant de circonstances (et en effet il en faut souvent un grand concours) ont-elles pu se trouver par chance réunies ? Peut-être direz-vous : cela est arrivé parce que le vent soufflait et que l’homme passait par là. Mais, insisteront-ils, pourquoi le vent soufflait-il à ce moment ? pourquoi l’homme passait-il par là à ce même instant ? Si vous répondez alors : le vent s’est levé parce que la mer, le jour avant, par un temps encore calme, avait commencé à s’agiter ; l’homme avait été invité par un ami ; ils insisteront de nouveau, car ils n’en finissent pas de poser des questions : pourquoi la mer était-elle agitée ? pourquoi l’homme a-t-il été invité pour tel moment ? et continueront ainsi de vous interroger sans relâche sur les causes des événements, jusqu’à ce que vous vous soyez réfugié dans la volonté de Dieu, cet asile de l’ignorance. De même, quand ils voient la structure du corps humain, ils sont frappés d’un étonnement imbécile et, de ce qu’ils ignorent les causes d’un si bel arrangement, concluent qu’il n’est point formé mécaniquement, mais par un art divin ou surnaturel, et en telle façon qu’aucune partie ne nuise à l’autre. Et ainsi arrive-t-il que quiconque cherche les vraies causes des prodiges et s’applique à connaître en savant les choses de la nature, au lieu de s’en émerveiller comme un sot, est souvent tenu pour hérétique et impie et proclamé tel par ceux que le vulgaire adore comme des interprètes de la Nature et des Dieux. Ils savent bien que détruire l’ignorance, c’est détruire l’étonnement imbécile, c’est-à-dire leur unique moyen de raisonnement et la sauvegarde de leur autorité. Mais en voilà assez sur ce chapitre, je passe au troisième point que j’ai résolu de traiter.\n\nAprès s’être persuadé que tout ce qui arrive est fait à cause d’eux, les hommes ont dû juger qu’en toutes choses le principal est ce qui a pour eux le plus d’utilité, et tenir pour les plus excellentes celles qui les affectent le plus agréablement. Par là ils n’ont pu manquer de former ces notions par lesquelles ils prétendent expliquer les natures des choses, ainsi le Bien, le Mal, l’Ordre, la Confusion, le Chaud, le Froid, la Beauté et la Laideur ; et de la liberté qu’ils s’attribuent sont provenues ces autres notions, la Louange et le Blâme, le Péché et le Mérite ; j’expliquerai plus tard ces dernières, quand j’aurai traité de la nature humaine, et je rendrai compte ici brièvement des premières, Les hommes donc ont appelé Bien tout ce qui contribue au bien-être et au culte de Dieu, Mal ce qui leur est contraire. Et, comme ceux qui ne connaissent pas la nature des choses, n’affirment rien qui s’applique à elles, mais les imaginent seulement et prennent l’imagination pour l’entendement, ils croient donc fermement qu’il y a en elles de l’Ordre, dans l’ignorance où ils sont de la nature tant des choses que d’eux-mêmes. Quand elles sont disposées en effet de façon que, nous les représentant par les sens, nous puissions facilement les imaginer et, par suite, nous les rappeler facilement, nous disons qu’elles sont bien ordonnées ; dans le cas contraire, qu’elles sont mal ordonnées ou confuses. Et, comme nous trouvons plus d’agrément qu’aux autres, aux choses que nous pouvons imaginer avec facilité, les hommes préfèrent l’ordre à la confusion ; comme si, sauf par rapport à notre imagination, l’ordre était quelque chose dans la Nature. Ils disent encore que Dieu a créé toutes choses avec ordre, et de la sorte, sans le savoir, attribuent à Dieu de l’imagination ; à moins peut-être qu’ils ne veuillent que Dieu, pourvoyant à l’imagination humaine, ait disposé toutes choses de façon qu’ils pussent les imaginer le plus facilement ; et probablement ils ne se laisseraient pas arrêter par cette objection qu’il se trouve une infinité de choses qui passent de beaucoup notre imagination, et un grand nombre qui la confondent à cause de sa faiblesse. Mais assez là-dessus. Pour les autres notions aussi, elles ne sont rien, si ce n’est des modes d’imaginer par lesquels l’imagination est diversement affectée, et cependant les ignorants les considèrent comme les attributs principaux des choses ; parce que, comme nous l’avons dit déjà, ils croient que toutes choses ont été faites en vue d’eux-mêmes et disent que la nature d’une chose est bonne ou mauvaise, saine ou pourrie et corrompue, suivant qu’ils sont affectés par elle. Si, par exemple, le mouvement, que reçoivent les nerfs des objets qui nous sont représentés par les yeux, convient à la santé, alors les objets qui en sont cause sont appelés beaux, et l’on dit laids ceux qui excitent un mouvement contraire. Ceux qui émeuvent le sens par le nez, on les nomme bien odorants ou fétides ; doux ou amers, agréables ou désagréables au goût, ceux qui font impression sur lui par la langue, etc. Ceux qui agissent par le toucher sont durs ou mous, rugueux ou lisses, etc. Et ceux enfin qui ébranlent les oreilles, on dit qu’ils produisent un bruit, un son ou une harmonie, et au sujet de cette dernière qualité l’extravagance des hommes a été jusqu’à croire que Dieu aussi se plaît à l’harmonie. Il ne manque pas de Philosophes qui se sont persuadé que les mouvements célestes composent une harmonie. Tout cela montre assez que chacun juge des choses selon la disposition de son cerveau ou plutôt leur a laissé se substituer les manières d’être de son imagination. Il n’y a donc pas à s’étonner (pour le noter en passant) que tant de controverses se soient, comme nous le voyons, élevées entre les hommes et que le Scepticisme en soit enfin provenu. Si, en effet, les corps humains conviennent en beaucoup de points, ils diffèrent en un très grand nombre et, par suite, ce qui paraît bon à l’un, semble mauvais à l’autre ; l’un juge ordonné ce que l’autre trouve confus ; ce qui est au gré de l’un, est à l’autre désagréable, et ainsi du reste. Je n’y insisterai pas, et parce que ce n’est pas le moment de traiter avec développement de ces choses, et parce que tout le monde en a assez fait l’expérience. Tout le monde répète : Autant de têtes, autant d’avis ; chacun abonde dans son sens ; il n’y a pas moins de différence entre les cerveaux qu’entre les palais. Et tous ces dictons montrent assez que les hommes jugent des choses selon la disposition de leur cerveau et les imaginent plutôt qu’ils ne les connaissent. S’ils les avaient clairement connues, elles auraient, comme en témoigne la Mathématique, la puissance sinon d’attirer, du moins de convaincre tout le monde.\n\nNous voyons ainsi que toutes les notions par lesquelles le vulgaire a coutume d’expliquer la Nature, sont seulement des Modes d’imaginer et ne renseignent sur la nature d’aucune chose, mais seulement sur la façon dont est constituée l’imagination, et, comme elles ont des noms qui semblent s’appliquer à des êtres existant en dehors de l’imagination, je les appelle êtres non de raison mais d’imagination ; et ainsi tous les arguments qui sont tirés contre nous de notions semblables, se peuvent facilement réfuter. Beaucoup en effet ont coutume d’argumenter ainsi. Si toutes choses ont suivi de la nécessité de la nature d’un Dieu tout parfait, d’où viennent donc tant d’imperfections dans la Nature ? c’est-à-dire, d’où vient que les choses se corrompent jusqu’à la fétidité, qu’elles soient laides à donner la nausée, d’où viennent la confusion, le mal, le péché, etc. Il est, je viens de le dire, facile de répondre. Car la perfection des choses doit s’estimer seulement par leur nature et leur puissance, et elles ne sont donc pas plus ou moins parfaites parce qu’elles plaisent aux sens de l’homme ou les offensent, conviennent à la nature humaine ou lui répugnent. Quant à ceux qui demandent pourquoi Dieu n’a pas créé tous les hommes de façon que la seule raison les conduisît et les gouvernât, je ne réponds rien, sinon que cela vient de ce que la matière ne lui a pas fait défaut pour créer toutes choses, savoir : depuis le plus haut jusqu’au plus bas degré de perfection ; ou, pour parler plus proprement, de ce que les lois de la Nature se sont trouvées assez amples pour suffire à la production de tout ce qui pouvait être conçu par un entendement infini, comme je l’ai démontré Proposition 16. Tels sont les préjugés que j’ai voulu signaler ici. S’il en reste encore d’autres de même farine, chacun pourra s’en guérir avec un peu de réflexion.",
        "english_text": "In the foregoing I have explained the nature and properties of God. I have shown that he necessarily exists, that he is one : that he is, and acts solely by the necessity of his own nature ; that he is the free cause of all things, and how he is so ; that all things are in God, and so depend on him, that without him they could neither exist nor be conceived ; lastly, that all things are predetermined by God, not through his free will or absolute fiat, but from the very nature of God or infinite power. I have further, where occasion afforded, taken care to remove the prejudices, which might impede the comprehension of my demonstrations. Yet there still remain misconceptions not a few, which might and may prove very grave hindrances to the understanding of the concatenation of things, as I have explained it above. I have therefore thought it worth while to bring these misconceptions before the bar of reason.\n\nAll such opinions spring from the notion commonly entertained, that all things in nature act as men themselves act, namely, with an end in view. It is accepted as certain, that God himself directs all things to a definite goal (for it is said that God made all things for man, and man that he might worship him). I will, therefore, consider this opinion, asking first, why it obtains general credence, and why all men are naturally so prone to adopt it? secondly, I will point out its falsity ; and, lastly, I will show how it has given rise to prejudices about good and bad, right and wrong, praise and blame, order and confusion, beauty and ugliness, and the like. However, this is not the place to deduce these misconceptions from the nature of the human mind : it will be sufficient here, if I assume as a starting point, what ought to be universally admitted, namely, that all men are born ignorant of the causes of things, that all have the desire to seek for what is useful to them, and that they are conscious of such desire. Herefrom it follows, first, that men think themselves free inasmuch as they are conscious of their volitions and desires, and never even dream, in their ignorance, of the causes which have disposed them so to wish and desire. Secondly, that men do all things for an end, namely, for that which is useful to them, and which they seek. Thus it comes to pass that they only look for a knowledge of the final causes of events, and when these are learned, they are content, as having no cause for further doubt. If they cannot learn such causes from external sources, they are compelled to turn to considering themselves, and reflecting what end would have induced them personally to bring about the given event, and thus they necessarily judge other natures by their own. Further, as they find in themselves and outside themselves many means which assist them not a little in the search for what is useful, for instance, eyes for seeing, teeth for chewing, herbs and animals for yielding food, the sun for giving light, the sea for breeding fish, &c., they come to look on the whole of nature as a means for obtaining such conveniences. Now as they are aware, that they found these conveniences and did not make them, they think they have cause for believing, that some other being has made them for their use. As they look upon things as means, they cannot believe them to be self-created ; but, judging from the means which they are accustomed to prepare for themselves, they are bound to believe in some ruler or rulers of the universe endowed with human freedom, who have arranged and adapted everything for human use. They are bound to estimate the nature of such rulers (having no information on the subject) in accordance with their own nature, and therefore they assert that the gods ordained everything for the use of man, in order to bind man to themselves and obtain from him the highest honor. Hence also it follows, that everyone thought out for himself, according to his abilities, a different way of worshipping God, so that God might love him more than his fellows, and direct the whole course of nature for the satisfaction of his blind cupidity and insatiable avarice. Thus the prejudice developed into superstition, and took deep root in the human mind ; and for this reason everyone strove most zealously to understand and explain the final causes of things ; but in their endeavor to show that nature does nothing in vain, i.e. nothing which is useless to man, they only seem to have demonstrated that nature, the gods, and men are all mad together. Consider, I pray you, the result : among the many helps of nature they were bound to find some hindrances, such as storms, earthquakes, diseases, &c. : so they declared that such things happen, because the gods are angry at some wrong done to them by men, or at some fault committed in their worship. Experience day by day protested and showed by infinite examples, that good and evil fortunes fall to the lot of pious and impious alike ; still they would not abandon their inveterate prejudice, for it was more easy for them to class such contradictions among other unknown things of whose use they were ignorant, and thus to retain their actual and innate condition of ignorance, than to destroy the whole fabric of their reasoning and start afresh. They therefore laid down as an axiom, that God's judgments far transcend human understanding. Such a doctrine might well have sufficed to conceal the truth from the human race for all eternity, if mathematics had not furnished another standard of verity in considering solely the essence and properties of figures without regard to their final causes. There are other reasons (which I need not mention here) besides mathematics, which might have caused men's minds to be directed to these general prejudices, and have led them to the knowledge of the truth.\n\nI have now sufficiently explained my first point. There is no need to show at length, that nature has no particular goal in view, and that final causes are mere human figments. This, I think, is already evident enough, both from the causes and foundations on which I have shown such prejudice to be based, and also from Prop. xvi., and the Corollary of Prop. xxxii., and, in fact, all those propositions in which I have shown, that everything in nature proceeds from a sort of necessity, and with the utmost perfection. However, I will add a few remarks, in order to overthrow this doctrine of a final cause utterly. That which is really a cause it considers as an effect, and vice versâ : it makes that which is by nature first to be last, and that which is highest and most perfect to be most imperfect. Passing over the questions of cause and priority as self-evident, it is plain from Props. xxi., xxii., xxiii. that the effect is most perfect which is produced immediately by God ; the effect which requires for its production several intermediate causes is, in that respect, more imperfect. But if those things which were made immediately by God were made to enable him to attain his end, then the things which come after, for the sake of which the first were made, are necessarily the most excellent of all.\n\nFurther, this doctrine does away with the perfection of God : for, if God acts for an object, he necessarily desires something which he lacks. Certainly, theologians and metaphysicians draw a distinction between the object of want and the object of assimilation ; still they confess that God made all things for the sake of himself, not for the sake of creation. They are unable to point to anything prior to creation, except God himself, as an object for which God should act, and are therefore driven to admit (as they clearly must), that God lacked those things for whose attainment he created means, and further that he desired them.\n\nWe must not omit to notice that the followers of this doctrine, anxious to display their talent in assigning final causes, have imported a new method of argument in proof of their theory—namely, a reduction, not to the impossible, but to ignorance ; thus showing that they have no other method of exhibiting their doctrine. For example, if a stone falls from a roof on to someone's head, and kills him, they will demonstrate by their new method, that the stone fell in order to kill the man ; for, if it had not by God's will fallen with that object, how could so many circumstances (and there are often many concurrent circumstances) have all happened together by chance? Perhaps you will answer that the event is due to the facts that the wind was blowing, and the man was walking that way. \"But why,\" they will insist, \"was the wind blowing, and why was the man at that very time walking that way?\" If you again answer, that the wind had then sprung up because the sea had begun to be agitated the day before, the weather being previously calm, and that the man had been invited by a friend, they will again insist : \"But why was the sea agitated, and why was the man invited at that time?\" So they will pursue their questions from cause to cause, till at last you take refuge in the will of God—in other words, the sanctuary of ignorance. So, again, when they survey the frame of the human body, they are amazed ; and being ignorant of the causes of so great a work of art, conclude that it has been fashioned, not mechanically, but by divine and supernatural skill, and has been so put together that one part shall not hurt another.\n\nHence anyone who seeks for the true causes of miracles, and strives to understand natural phenomena as an intelligent being, and not to gaze at them like a fool, is set down and denounced as an impious heretic by those, whom the masses adore as the interpreters of nature and the gods. Such persons know that, with the removal of ignorance, the wonder which forms their only available means for proving and preserving their authority would vanish also. But I now quit this subject, and pass on to my third point.\n\nAfter men persuaded themselves, that everything which is created is created for their sake, they were bound to consider as the chief quality in everything that which is most useful to themselves, and to account those things the best of all which have the most beneficial effect on mankind. Further, they were bound to form abstract notions for the explanation of the nature of things, such as goodness, badness, order, confusion, warmth, cold, beauty, deformity, and so on ; and from the belief that they are free agents arose the further notions of praise and blame, sin and merit.\n\nI will speak of these latter hereafter, when I treat of human nature ; the former I will briefly explain here.\n\nEverything which conduces to health and the worship of God they have called good, everything which hinders these objects they have styled bad ; and inasmuch as those who do not understand the nature of things do not verify phenomena in any way, but merely imagine them after a fashion, and mistake their imagination for understanding, such persons firmly believe that there is an order in things, being really ignorant both of things and their own nature. When phenomena are of such a kind, that the impression they make on our senses requires little effort of imagination, and can consequently be easily remembered, we say that they are well-ordered ; if the contrary, that they are ill-ordered or confused. Further, as things which are easily imagined are more pleasing to us, men prefer order to confusion-as though there were any order in nature, except in relation to our imagination—and say that God has created all things in order ; thus, without knowing it, attributing imagination to God, unless, indeed, they would have it that God foresaw human imagination, and arranged everything, so that it should be most easily imagined. If this be their theory, they would not, perhaps, be daunted by the fact that we find an infinite number of phenomena, far surpassing our imagination, and very many others which confound its weakness. But enough has been said on this subject. The other abstract notions are nothing but modes of imagining, in which the imagination is differently affected : though they are considered by the ignorant as the chief attributes of things, inasmuch as they believe that everything was created for the sake of themselves ; and, according as they are affected by it, style it good or bad, healthy or rotten and corrupt. For instance, if the motion which objects we see communicate to our nerves be conducive to health, the objects causing it are styled beautiful ; if a contrary motion be excited, they are styled ugly.\n\nThings which are perceived through our sense of smell are styled fragrant or fetid ; if through our taste, sweet or bitter, full-flavored or insipid ; if through our touch, hard or soft, rough or smooth, &c.\n\nWhatsoever affects our ears is said to give rise to noise, sound, or harmony. In this last case, there are men lunatic enough to believe, that even God himself takes pleasure in harmony ; and philosophers are not lacking who have persuaded themselves, that the motion of the heavenly bodies gives rise to harmony-all of which instances sufficiently show that everyone judges of things according to the state of his brain, or rather mistakes for things the forms of his imagination. We need no longer wonder that there have arisen all the controversies we have witnessed, and finally skepticism : for, although human bodies in many respects agree, yet in very many others they differ ; so that what seems good to one seems bad to another ; what seems well ordered to one seems confused to another ; what is pleasing to one displeases another, and so on. I need not further enumerate, because this is not the place to treat the subject at length, and also because the fact is sufficiently well known. It is commonly said : \"So many men, so many minds ; everyone is wise in his own way ; brains differ as completely as palates.\" All of which proverbs show, that men judge of things according to their mental disposition, and rather imagine than understand : for, if they understood phenomena, they would, as mathematicians attest, be convinced, if not attracted, by what I have urged.\n\nWe have now perceived, that all the explanations commonly given of nature are mere modes of imagining, and do not indicate the true nature of anything, but only the constitution of the imagination ; and, although they have names, as though they were entities, existing externally to the imagination, I call them entities imaginary rather than real ; and, therefore, all arguments against us drawn from such abstractions are easily rebutted.\n\nMany argue in this way. If all things follow from a necessity of the absolutely perfect nature of God, why are there so many imperfections in nature? such, for instance, as things corrupt to the point of putridity, loathsome deformity, confusion, evil, sin, &c. But these reasoners are, as I have said, easily confuted, for the perfection of things is to be reckoned only from their own nature and power ; things are not more or less perfect, according as they delight or offend human senses, or according as they are serviceable or repugnant to mankind. To those who ask why God did not so create all men, that they should be governed only by reason, I give no answer but this : because matter was not lacking to him for the creation of every degree of perfection from highest to lowest ; or, more strictly, because the laws of his nature are so vast, as to suffice for the production of everything conceivable by an infinite intelligence, as I have shown in Prop. xvi.\n\nSuch are the misconceptions I have undertaken to note ; if there are any more of the same sort, everyone may easily dissipate them for himself with the aid of a little reflection.",
        "latin_text": ": His Dei naturam ejusque proprietates explicui ut quod necessario existit; quod sit unicus; quod ex sola suæ naturæ necessitate sit et agat; quod sit omnium rerum causa libera et quomodo; quod omnia in Deo sint et ab ipso ita pendeant ut sine ipso nec esse nec concipi possint; et denique quod omnia a Deo fuerint prædeterminata, non quidem ex libertate voluntatis sive absoluto beneplacito sed ex absoluta Dei natura sive infinita potentia. Porro ubicunque data fuit occasio, præjudicia quæ impedire poterant quominus meæ demonstrationes perciperentur, amovere curavi sed quia non pauca adhuc restant præjudicia quæ etiam imo maxime impedire poterant et possunt quominus homines rerum concatenationem eo quo ipsam explicui modo, amplecti possint, eadem hic ad examen rationis vocare operæ pretium duxi. Et quoniam omnia quæ hic indicare suscipio præjudicia pendent ab hoc uno quod scilicet communiter supponant homines omnes res naturales ut ipsos propter finem agere, imo ipsum Deum omnia ad certum aliquem finem dirigere pro certo statuant : dicunt enim Deum omnia propter hominem fecisse, hominem autem ut ipsum coleret. Hoc igitur unum prius considerabo quærendo scilicet primo causam cur plerique hoc in præjudicio acquiescant et omnes natura adeo propensi sint ad idem amplectendum. Deinde ejusdem falsitatem ostendam et tandem quomodo ex hoc orta sint præjudicia de bono et malo, merito et peccato, laude et vituperio, ordine et confusione, pulchritudine et deformitate et de aliis hujus generis. Verum hæc ab humanæ mentis natura deducere non est hujus loci : satis hic erit si pro fundamento id capiam quod apud omnes debet esse in confesso nempe hoc quod omnes homines rerum causarum ignari nascuntur et quod omnes appetitum habent suum utile quærendi, cujus rei sunt conscii. Ex his enim sequitur primo quod homines se liberos esse opinentur quandoquidem suarum volitionum suique appetitus sunt conscii et de causis a quibus disponuntur ad appetendum et volendum, quia earum sunt ignari nec per somnium cogitant. Sequitur secundo homines omnia propter finem agere videlicet propter utile quod appetunt; unde fit ut semper rerum peractarum causas finales tantum scire expetant et ubi ipsas audiverint, quiescant; nimirum quia nullam habent causam ulterius dubitandi. Sin autem easdem ex alio audire nequeant, nihil iis restat nisi ut ad semet se convertant et ad fines a quibus ipsi ad similia determinari solent, reflectant et sic ex suo ingenio ingenium alterius necessario judicant. Porro cum in se et extra se non pauca reperiant media quæ ad suum utile assequendum non parum conducant ut exempli gratia oculos ad videndum, dentes ad masticandum, herbas et animantia ad alimentum, solem ad illuminandum, mare ad alendum pisces, hinc factum ut omnia naturalia tanquam ad suum utile media considerent et quia illa media ab ipsis inventa, non autem parata esse sciunt, hinc causam credendi habuerunt aliquem alium esse qui illa media in eorum usum paraverit. Nam postquam res ut media consideraverunt, credere non potuerunt easdem se ipsas fecisse sed ex mediis quæ sibi ipsi parare solent, concludere debuerunt dari aliquem vel aliquos naturæ rectores humana præditos libertate qui ipsis omnia curaverint et in eorum usum omnia fecerint. Atque horum etiam ingenium quandoquidem de eo nunquam quid audiverant, ex suo judicare debuerunt atque hinc statuerunt Deos omnia in hominum usum dirigere ut homines sibi devinciant et in summo ab iisdem honore habeantur; unde factum ut unusquisque diversos Deum colendi modos ex suo ingenio excogitaverit ut Deus eos supra reliquos diligeret et totam naturam in usum cæcæ illorum cupiditatis et insatiabilis avaritiæ dirigeret. Atque ita hoc præjudicium in superstitionem versum et altas in mentibus egit radices; quod in causa fuit ut unusquisque maximo conatu omnium rerum causas finales intelligere easque explicare studeret. Sed dum quæsiverunt ostendere naturam nihil frustra (hoc est quod in usum hominum non sit) agere, nihil aliud videntur ostendisse quam naturam Deosque æque ac homines delirare. Vide quæso quo res tandem evasit! Inter tot naturæ commoda non pauca reperire debuerunt incommoda, tempestates scilicet, terræ motus, morbos etc. atque hæc statuerunt propterea evenire quod Dii irati essent ob injurias sibi ab hominibus factas sive ob peccata in suo cultu commissa et quamvis experientia indies reclamaret ac infinitis exemplis ostenderet commoda atque incommoda piis æque ac impiis promiscue evenire, non ideo ab inveterato præjudicio destiterunt : facilius enim iis fuit hoc inter alia incognita quorum usum ignorabant, ponere et sic præsentem suum et innatum statum ignorantiæ retinere quam totam illam fabricam destruere et novam excogitare. Unde pro certo statuerunt Deorum judicia humanum captum longissime superare : quæ sane unica fuisset causa ut veritas humanum genus in æternum lateret nisi mathesis, quæ non circa fines sed tantum circa figurarum essentias et proprietates versatur, aliam veritatis normam hominibus ostendisset et præter mathesin aliæ etiam adsignari possunt causæ (quas hic enumerare supervacaneum est) a quibus fieri potuit ut homines communia hæc præjudicia animadverterent et in veram rerum cognitionem ducerentur.\n\nHis satis explicui id quod primo loco promisi. Ut jam autem ostendam naturam finem nullum sibi præfixum habere et omnes causas finales nihil nisi humana esse figmenta, non opus est multis. Credo enim id jam satis constare tam ex fundamentis et causis unde hoc præjudicium originem suam traxisse ostendi quam ex propositione 16 et corollariis propositionis 32 et præterea ex iis omnibus quibus ostendi omnia naturæ æterna quadam necessitate summaque perfectione procedere. Hoc tamen adhuc addam nempe hanc de fine doctrinam naturam omnino evertere. Nam id quod revera causa est, ut effectum considerat et contra. Deinde id quod natura prius est, facit posterius. Et denique id quod supremum et perfectissimum est, reddit imperfectissimum. Nam (duobus prioribus omissis quia per se manifesta sunt) ut ex propositionibus 21, 22 et 23 constat, ille effectus perfectissimus est qui a Deo immediate producitur et quo aliquid pluribus causis intermediis indiget ut producatur, eo imperfectius est. At si res quæ immediate a Deo productæ sunt, ea de causa factæ essent ut Deus finem assequeretur suum, tum necessario ultimæ quarum de causa priores factæ sunt, omnium præstantissimæ essent. Deinde hæc doctrina Dei perfectionem tollit nam si Deus propter finem agit, aliquid necessario appetit quo caret. Et quamvis theologi et metaphysici distinguant inter finem indigentiæ et finem assimilationis, fatentur tamen Deum omnia propter se, non vero propter res creandas egisse quia nihil ante creationem præter Deum assignare possunt propter quod Deus ageret adeoque necessario fateri coguntur Deum iis propter quæ media parare voluit, caruisse eaque cupivisse, ut per se clarum. Nec hic prætereundum est quod hujus doctrinæ sectatores qui in assignandis rerum finibus suum ingenium ostentare voluerunt, ad hanc suam doctrinam probandam novum attulerunt modum argumentandi reducendo scilicet non ad impossibile sed ad ignorantiam, quod ostendit nullum aliud fuisse huic doctrinæ argumentandi medium. Nam si exempli gratia ex culmine aliquo lapis in alicujus caput ceciderit eumque interfecerit, hoc modo demonstrabunt lapidem ad hominem interficiendum cecidisse. Ni enim eum in finem Deo id volente ceciderit, quomodo tot circumstantiæ (sæpe enim multæ simul concurrunt) casu concurrere potuerunt? Respondebis fortasse id ex eo quod ventus flavit et quod homo illac iter habebat, evenisse. At instabunt, cur ventus illo tempore flavit? Cur homo illo eodemque tempore illac iter habebat? Si iterum respondeas ventum tum ortum quia mare præcedenti die tempore adhuc tranquillo agitari inceperat et quod homo ab amico invitatus fuerat, instabunt iterum quia nullus rogandi finis, cur autem mare agitabatur? cur homo in illud tempus invitatus fuit? et sic porro causarum causas rogare non cessabunt donec ad Dei voluntatem hoc est ignorantiæ asylum confugeris. Sic etiam ubi corporis humani fabricam vident, stupescunt et ex eo quod tantæ artis causas ignorant, concludunt eandem non mechanica sed divina vel supernaturali arte fabricari talique modo constitui ut una pars alteram non lædat. Atque hinc fit ut qui miraculorum causas veras quærit quique res naturales ut doctus intelligere, non autem ut stultus admirari studet, passim pro hæretico et impio habeatur et proclametur ab iis quos vulgus tanquam naturæ Deorumque interpretes adorat. Nam sciunt quod sublata ignorantia stupor hoc est unicum argumentandi tuendæque suæ auctoritatis medium quod habent, tollitur. Sed hæc relinquo et ad id quod tertio loco hic agere constitui, pergo.\n\nPostquam homines sibi persuaserunt omnia quæ fiunt propter ipsos fieri, id in unaquaque re præcipuum judicare debuerunt quod ipsis utilissimum et illa omnia præstantissima æstimare a quibus optime afficiebantur. Unde has formare debuerunt notiones quibus rerum naturas explicarent scilicet bonum, malum, ordinem, confusionem, calidum, frigidum, pulchritudinem et deformitatem et quia se liberos existimant, inde hæ notiones ortæ sunt scilicet laus et vituperium, peccatum et meritum sed has infra postquam de natura humana egero, illas autem hic breviter explicabo. Nempe id omne quod ad valetudinem et Dei cultum conducit, bonum, quod autem iis contrarium est, malum vocaverunt. Et quia ii qui rerum naturam non intelligunt sed res tantummodo imaginantur, nihil de rebus affirmant et imaginationem pro intellectu capiunt, ideo ordinem in rebus esse firmiter credunt rerum suæque naturæ ignari. Nam cum ita sint dispositæ ut cum nobis per sensus repræsentantur, eas facile imaginari et consequenter earum facile recordari possimus, easdem bene ordinatas, si vero contra, ipsas male ordinatas sive confusas esse dicimus. Et quoniam ea nobis præ cæteris grata sunt quæ facile imaginari possumus, ideo homines ordinem confusioni præferunt quasi ordo aliquid in natura præter respectum ad nostram imaginationem esset; dicuntque Deum omnia ordine creasse et hoc modo ipsi nescientes Deo imaginationem tribuunt nisi velint forte Deum humanæ imaginationi providentem res omnes eo disposuisse modo quo ipsas facillime imaginari possent; nec moram forsan iis injiciet quod infinita reperiantur quæ nostram imaginationem longe superant et plurima quæ ipsam propter ejus imbecillitatem confundunt. Sed de hac re satis. Cæteræ deinde notiones etiam præter imaginandi modos quibus imaginatio diversimode afficitur, nihil sunt et tamen ab ignaris tanquam præcipua rerum attributa considerantur quia ut jam diximus, res omnes propter ipsos factas esse credunt et rei alicujus naturam bonam vel malam, sanam vel putridam et corruptam dicunt prout ab eadem afficiuntur. Exempli gratia si motus quem nervi ab objectis per oculos repræsentatis accipiunt, valetudini conducat, objecta a quibus causatur pulchra dicuntur, quæ autem contrarium motum cient, deformia. Quæ deinde per nares sensum movent, odorifera vel fætida vocant, quæ per linguam, dulcia aut amara, sapida aut insipida etc. Quæ autem per tactum, dura aut mollia, aspera aut lævia etc. Et quæ denique aures movent, strepitum, sonum vel harmoniam edere dicuntur quorum postremum homines adeo dementavit ut Deum etiam harmonia delectari crederent. Nec desunt philosophi qui sibi persuaserint motus cælestes harmoniam componere. Quæ omnia satis ostendunt unumquemque pro dispositione cerebri de rebus judicasse vel potius imaginationis affectiones pro rebus accepisse. Quare non mirum est (ut hoc etiam obiter notemus) quod inter homines tot quot experimur, controversiæ ortæ sint ex quibus tandem scepticismus. Nam quamvis humana corpora in multis conveniant, in plurimis tamen discrepant et ideo id quod uni bonum, alteri malum videtur; quod uni ordinatum, alteri confusum; quod uni gratum, alteri ingratum est et sic de cæteris quibus hic supersedeo cum quia hujus loci non est de his ex professo agere, tum quia hoc omnes satis experti sunt. Omnibus enim in ore est \"quot capita tot sensus\", \"suo quemque sensu abundare\", \"non minora cerebrorum quam palatorum esse discrimina\" : quæ sententiæ satis ostendunt homines pro dispositione cerebri de rebus judicare resque potius imaginari quam intelligere. Res enim si intellexissent, illæ omnes teste mathesi, si non allicerent, ad minimum convincerent.\n\nVidemus itaque omnes notiones quibus vulgus solet naturam explicare, modos esse tantummodo imaginandi nec ullius rei naturam sed tantum imaginationis constitutionem indicare et quia nomina habent, quasi essent entium extra imaginationem existentium, eadem entia non rationis sed imaginationis voco atque adeo omnia argumenta quæ contra nos ex similibus notionibus petuntur, facile propulsari possunt. Solent enim multi sic argumentari. Si omnia ex necessitate perfectissimæ Dei naturæ sunt consecuta, unde ergo tot imperfectiones in natura ortæ? Videlicet rerum corruptio ad fætorem usque, rerum deformitas quæ nauseam moveat, confusio, malum, peccatum etc. Sed ut modo dixi, facile confutantur. Nam rerum perfectio ex sola earum natura et potentia est æstimanda nec ideo res magis aut minus perfectæ sunt propterea quod hominum sensum delectant vel offendunt, quod humanæ naturæ conducunt vel quod eidem repugnant. Iis autem qui quærunt cur Deus omnes homines non ita creavit ut solo rationis ductu gubernarentur? nihil aliud respondeo quam quia ei non defuit materia ad omnia ex summo nimirum ad infimum perfectionis gradum creanda vel magis proprie loquendo quia ipsius naturæ leges adeo amplæ fuerunt ut sufficerent ad omnia quæ ab aliquo infinito intellectu concipi possunt producenda, ut propositione 16 demonstravi.\n\nHæc sunt quæ hic notare suscepi præjudicia. Si quædam hujus farinæ adhuc restant, poterunt eadem ab unoquoque mediocri meditatione emendari."
      }
    }
  ],
  "edges": [
    {
      "source": "I_Def_1",
      "target": "I_Prop_24",
      "type": "citation"
    },
    {
      "source": "I_Def_1",
      "target": "I_Prop_7",
      "type": "citation"
    },
    {
      "source": "I_Def_1",
      "target": "I_Prop_24",
      "type": "citation"
    },
    {
      "source": "I_Def_1",
      "target": "I_Prop_7",
      "type": "citation"
    },
    {
      "source": "I_Def_2",
      "target": "I_Prop_21",
      "type": "citation"
    },
    {
      "source": "I_Def_2",
      "target": "I_Prop_22",
      "type": "citation"
    },
    {
      "source": "I_Def_2",
      "target": "I_Prop_8",
      "type": "citation"
    },
    {
      "source": "I_Def_2",
      "target": "I_Prop_21",
      "type": "citation"
    },
    {
      "source": "I_Def_2",
      "target": "I_Prop_22",
      "type": "citation"
    },
    {
      "source": "I_Def_2",
      "target": "I_Prop_8",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_1",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_10",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_15",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_18",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_2",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_28",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_4",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_5",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_1",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_10",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_15",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_18",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_2",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_28",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_4",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_5",
      "type": "citation"
    },
    {
      "source": "I_Def_3",
      "target": "I_Prop_6",
      "type": "citation"
    },
    {
      "source": "I_Def_4",
      "target": "I_Prop_10",
      "type": "citation"
    },
    {
      "source": "I_Def_4",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Def_4",
      "target": "I_Prop_19",
      "type": "citation"
    },
    {
      "source": "I_Def_4",
      "target": "I_Prop_20",
      "type": "citation"
    },
    {
      "source": "I_Def_4",
      "target": "I_Prop_4",
      "type": "citation"
    },
    {
      "source": "I_Def_4",
      "target": "I_Prop_9",
      "type": "citation"
    },
    {
      "source": "I_Def_4",
      "target": "I_Prop_10",
      "type": "citation"
    },
    {
      "source": "I_Def_4",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Def_4",
      "target": "I_Prop_19",
      "type": "citation"
    },
    {
      "source": "I_Def_4",
      "target": "I_Prop_20",
      "type": "citation"
    },
    {
      "source": "I_Def_4",
      "target": "I_Prop_4",
      "type": "citation"
    },
    {
      "source": "I_Def_4",
      "target": "I_Prop_9",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_1",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_15",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_28",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_31",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_4",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_1",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_15",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_25",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_28",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_31",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_4",
      "type": "citation"
    },
    {
      "source": "I_Def_5",
      "target": "I_Prop_6",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_11",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_14",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_16",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_19",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_31",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_10",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_11",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_14",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_16",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_19",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Def_6",
      "target": "I_Prop_31",
      "type": "citation"
    },
    {
      "source": "I_Def_7",
      "target": "I_Prop_32",
      "type": "citation"
    },
    {
      "source": "I_Def_7",
      "target": "I_Prop_17",
      "type": "citation"
    },
    {
      "source": "I_Def_7",
      "target": "I_Prop_32",
      "type": "citation"
    },
    {
      "source": "I_Def_7",
      "target": "I_Prop_33",
      "type": "citation"
    },
    {
      "source": "I_Def_8",
      "target": "I_Prop_19",
      "type": "citation"
    },
    {
      "source": "I_Def_8",
      "target": "I_Prop_20",
      "type": "citation"
    },
    {
      "source": "I_Def_8",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Def_8",
      "target": "I_Prop_19",
      "type": "citation"
    },
    {
      "source": "I_Def_8",
      "target": "I_Prop_20",
      "type": "citation"
    },
    {
      "source": "I_Def_8",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Prop_1",
      "target": "I_Prop_5",
      "type": "citation"
    },
    {
      "source": "I_Prop_1",
      "target": "I_Prop_5",
      "type": "citation"
    },
    {
      "source": "I_Prop_2",
      "target": "I_Prop_11",
      "type": "citation"
    },
    {
      "source": "I_Prop_2",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Prop_2",
      "target": "I_Prop_6",
      "type": "citation"
    },
    {
      "source": "I_Prop_2",
      "target": "I_Prop_11",
      "type": "citation"
    },
    {
      "source": "I_Prop_2",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Prop_2",
      "target": "I_Prop_6",
      "type": "citation"
    },
    {
      "source": "I_Prop_3",
      "target": "I_Prop_6",
      "type": "citation"
    },
    {
      "source": "I_Prop_3",
      "target": "I_Prop_6",
      "type": "citation"
    },
    {
      "source": "I_Prop_4",
      "target": "I_Prop_5",
      "type": "citation"
    },
    {
      "source": "I_Prop_4",
      "target": "I_Prop_5",
      "type": "citation"
    },
    {
      "source": "I_Prop_5",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Prop_5",
      "target": "I_Prop_13",
      "type": "citation"
    },
    {
      "source": "I_Prop_5",
      "target": "I_Prop_14",
      "type": "citation"
    },
    {
      "source": "I_Prop_5",
      "target": "I_Prop_6",
      "type": "citation"
    },
    {
      "source": "I_Prop_5",
      "target": "I_Prop_8",
      "type": "citation"
    },
    {
      "source": "I_Prop_5",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Prop_5",
      "target": "I_Prop_13",
      "type": "citation"
    },
    {
      "source": "I_Prop_5",
      "target": "I_Prop_14",
      "type": "citation"
    },
    {
      "source": "I_Prop_5",
      "target": "I_Prop_15",
      "type": "citation"
    },
    {
      "source": "I_Prop_5",
      "target": "I_Prop_6",
      "type": "citation"
    },
    {
      "source": "I_Prop_5",
      "target": "I_Prop_8",
      "type": "citation"
    },
    {
      "source": "I_Prop_6",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Prop_6",
      "target": "I_Prop_11",
      "type": "citation"
    },
    {
      "source": "I_Prop_6",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Prop_7",
      "target": "I_Prop_11",
      "type": "citation"
    },
    {
      "source": "I_Prop_7",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Prop_7",
      "target": "I_Prop_19",
      "type": "citation"
    },
    {
      "source": "I_Prop_7",
      "target": "I_Prop_8",
      "type": "citation"
    },
    {
      "source": "I_Prop_7",
      "target": "I_Prop_11",
      "type": "citation"
    },
    {
      "source": "I_Prop_7",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Prop_7",
      "target": "I_Prop_19",
      "type": "citation"
    },
    {
      "source": "I_Prop_7",
      "target": "I_Prop_8",
      "type": "citation"
    },
    {
      "source": "I_Prop_8",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Prop_8",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Prop_8",
      "target": "I_Prop_15",
      "type": "citation"
    },
    {
      "source": "I_Prop_10",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Prop_10",
      "target": "I_Prop_12",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_13",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_14",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_19",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_21",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_22",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_29",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_33",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_34",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_13",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_14",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_17",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_19",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_21",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_22",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_29",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_33",
      "type": "citation"
    },
    {
      "source": "I_Prop_11",
      "target": "I_Prop_34",
      "type": "citation"
    },
    {
      "source": "I_Prop_12",
      "target": "I_Prop_15",
      "type": "citation"
    },
    {
      "source": "I_Prop_14",
      "target": "I_Prop_15",
      "type": "citation"
    },
    {
      "source": "I_Prop_14",
      "target": "I_Prop_18",
      "type": "citation"
    },
    {
      "source": "I_Prop_14",
      "target": "I_Prop_15",
      "type": "citation"
    },
    {
      "source": "I_Prop_14",
      "target": "I_Prop_18",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_17",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_18",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_25",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_29",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_30",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_31",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_17",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_18",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_25",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_28",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_29",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_30",
      "type": "citation"
    },
    {
      "source": "I_Prop_15",
      "target": "I_Prop_31",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_17",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_26",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_29",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_33",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_34",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_36",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_17",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_25",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_26",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_29",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_33",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_34",
      "type": "citation"
    },
    {
      "source": "I_Prop_16",
      "target": "I_Prop_36",
      "type": "citation"
    },
    {
      "source": "I_Prop_19",
      "target": "I_Prop_20",
      "type": "citation"
    },
    {
      "source": "I_Prop_19",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Prop_19",
      "target": "I_Prop_20",
      "type": "citation"
    },
    {
      "source": "I_Prop_19",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Prop_21",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Prop_21",
      "target": "I_Prop_28",
      "type": "citation"
    },
    {
      "source": "I_Prop_21",
      "target": "I_Prop_29",
      "type": "citation"
    },
    {
      "source": "I_Prop_21",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Prop_21",
      "target": "I_Prop_28",
      "type": "citation"
    },
    {
      "source": "I_Prop_21",
      "target": "I_Prop_29",
      "type": "citation"
    },
    {
      "source": "I_Prop_22",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Prop_22",
      "target": "I_Prop_28",
      "type": "citation"
    },
    {
      "source": "I_Prop_22",
      "target": "I_Prop_23",
      "type": "citation"
    },
    {
      "source": "I_Prop_22",
      "target": "I_Prop_28",
      "type": "citation"
    },
    {
      "source": "I_Prop_23",
      "target": "I_Prop_32",
      "type": "citation"
    },
    {
      "source": "I_Prop_23",
      "target": "I_Prop_32",
      "type": "citation"
    },
    {
      "source": "I_Prop_25",
      "target": "I_Prop_26",
      "type": "citation"
    },
    {
      "source": "I_Prop_25",
      "target": "I_Prop_26",
      "type": "citation"
    },
    {
      "source": "I_Prop_26",
      "target": "I_Prop_28",
      "type": "citation"
    },
    {
      "source": "I_Prop_26",
      "target": "I_Prop_29",
      "type": "citation"
    },
    {
      "source": "I_Prop_26",
      "target": "I_Prop_28",
      "type": "citation"
    },
    {
      "source": "I_Prop_26",
      "target": "I_Prop_29",
      "type": "citation"
    },
    {
      "source": "I_Prop_27",
      "target": "I_Prop_29",
      "type": "citation"
    },
    {
      "source": "I_Prop_27",
      "target": "I_Prop_29",
      "type": "citation"
    },
    {
      "source": "I_Prop_28",
      "target": "I_Prop_32",
      "type": "citation"
    },
    {
      "source": "I_Prop_28",
      "target": "I_Prop_32",
      "type": "citation"
    },
    {
      "source": "I_Prop_29",
      "target": "I_Prop_33",
      "type": "citation"
    },
    {
      "source": "I_Prop_29",
      "target": "I_Prop_32",
      "type": "citation"
    },
    {
      "source": "I_Prop_29",
      "target": "I_Prop_33",
      "type": "citation"
    },
    {
      "source": "I_Prop_34",
      "target": "I_Prop_35",
      "type": "citation"
    },
    {
      "source": "I_Prop_34",
      "target": "I_Prop_36",
      "type": "citation"
    },
    {
      "source": "I_Prop_34",
      "target": "I_Prop_35",
      "type": "citation"
    },
    {
      "source": "I_Prop_34",
      "target": "I_Prop_36",
      "type": "citation"
    }
  ]
}